
#Область СлужебныеПроцедурыИФункции

Функция ДоступныеПоляРегистраСведений(МетаданныеРегистра) Экспорт
	Поля = Новый Массив;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Поле = ЭлементыМоделиОписанияПредставлений.НовыйПолеПредставления();
		Поле.Имя = Измерение.Имя;
		Поле.ТипЗначения = Измерение.Тип; 
		Поля.Добавить(Поле);	
	КонецЦикла;	
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		Поле = ЭлементыМоделиОписанияПредставлений.НовыйПолеПредставления();
		Поле.Имя = Ресурс.Имя;
		Поле.ТипЗначения =  Ресурс.Тип; 
		Поля.Добавить(Поле); 
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		Поле = ЭлементыМоделиОписанияПредставлений.НовыйПолеПредставления();
		Поле.Имя =  Реквизит.Имя;
		Поле.ТипЗначения =  Реквизит.Тип; 
		Поля.Добавить(Поле); 
	КонецЦикла;	

	Возврат Поля	
КонецФункции

Функция ИзмеренияРегистраСведений(МетаданныеРегистра) Экспорт
	Измерения = Новый Массив;
	
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Поле = ЭлементыМоделиОписанияПредставлений.НовыйПолеФильтра(); 
		Поле.Имя = Измерение.Имя; 
		Поле.Обязательный = Ложь; 

		Измерения.Добавить(Поле);	
	КонецЦикла;	
	
	Возврат Измерения;	
КонецФункции

#КонецОбласти
