#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьКоллекциюОтборов(КоллекцияОтборов, ОтборыИсполяемогоПредставления, ПараметрыЗапроса) Экспорт
	Если Не ЗначениеЗаполнено(ОтборыИсполяемогоПредставления) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ЭлементОтбора Из ОтборыИсполяемогоПредставления Цикл
		Поле = СтрСоединить(ЭлементОтбора.ПутьКПолю, ".");
		Если ЭлементОтбора.ЗначениеОтбора.ЭтоПараметрЗапроса Тогда
			Значение = ПараметрыЗапроса[ЭлементОтбора.ЗначениеОтбора.Значение];
		Иначе
			Значение = ЭлементОтбора.ЗначениеОтбора.Значение;
		КонецЕсли;	
			
		ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(
			КоллекцияОтборов, 
			Поле, 
			ЭлементОтбора.ВидСравнения, 
			Значение);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти