///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2024, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВариантыОтчетов

// Параметры:
//   Настройки - см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.Настройки.
//   НастройкиОтчета - см. ВариантыОтчетов.ОписаниеОтчета.
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиОтчета.ОпределитьНастройкиФормы = Истина;

	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
	МодульВариантыОтчетов.УстановитьРежимВыводаВПанеляхОтчетов(Настройки, НастройкиОтчета, Ложь);
	
	НастройкиВарианта = МодульВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Универсальный отчет по справочникам, документам, регистрам.'");
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗагрузитьНастройкиПриИзмененииПараметров() Экспорт 
	Параметры = Новый Массив;
	Параметры.Добавить(Новый ПараметрКомпоновкиДанных("ТекстЗапросаИсточника"));
	
	Возврат Параметры;
КонецФункции

// Возвращает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Настройки - НастройкиКомпоновкиДанных
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных
//  ДоступныеЗначения - Структура
//  Контекст - Произвольный
//
// Возвращаемое значение:
//  Структура:
//    * Период - СтандартныйПериод
//    * ТипОбъектаМетаданных - Строка
//    * ИмяОбъектаМетаданных - Строка
//    * ИмяТаблицы - Строка
//    * ИсточникДанных - СправочникСсылка.ИдентификаторыОбъектовМетаданных
// 
Функция ФиксированныеПараметры(Настройки, ПользовательскиеНастройки, ДоступныеЗначения, Контекст) Экспорт 
	ФиксированныеПараметры = Новый Структура("ТекстЗапросаИсточника");
	ДоступныеЗначения = Новый Структура("ТекстЗапросаИсточника");
	
	УстановитьФиксированныйПараметр("ТекстЗапросаИсточника", ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
//	УстановитьФиксированныйПараметр("ИсточникДанных", ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	
//	ДоступныеЗначения.ТипОбъектаМетаданных = ДоступныеТипыОбъектовМетаданных();
//	УстановитьФиксированныйПараметр(
//		"ТипОбъектаМетаданных",
//		ФиксированныеПараметры,
//		Настройки, ПользовательскиеНастройки,
//		ДоступныеЗначения.ТипОбъектаМетаданных, Контекст);
//		
//	ФиксированныеПараметры.ИмяТипаОбъектаМетаданных = ФиксированныеПараметры.ТипОбъектаМетаданных;
//	
//	ДоступныеЗначения.ИмяОбъектаМетаданных = ДоступныеОбъектыМетаданных(
//		ФиксированныеПараметры.ТипОбъектаМетаданных);
//	УстановитьФиксированныйПараметр(
//		"ИмяОбъектаМетаданных",
//		ФиксированныеПараметры,
//		Настройки,
//		ПользовательскиеНастройки,
//		ДоступныеЗначения.ИмяОбъектаМетаданных);
//	
//	ДоступныеЗначения.ИмяТаблицы = ДоступныеТаблицы(
//		ФиксированныеПараметры.ТипОбъектаМетаданных, ФиксированныеПараметры.ИмяОбъектаМетаданных);
//	УстановитьФиксированныйПараметр(
//		"ИмяТаблицы", ФиксированныеПараметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения.ИмяТаблицы);
//	
//	ФиксированныеПараметры.ИмяТаблицыОбъектаМетаданных = ФиксированныеПараметры.ИмяТаблицы;
//	
//	ФиксированныеПараметры.ИсточникДанных = ИсточникДанных(
//		ФиксированныеПараметры.ТипОбъектаМетаданных, ФиксированныеПараметры.ИмяОбъектаМетаданных);
//	
//	Идентификаторы = СтрРазделить("ТипОбъектаМетаданных, ИмяОбъектаМетаданных, ИмяТаблицы", ", ", Ложь);
//	ПараметрыДанных = Настройки.ПараметрыДанных.Элементы;
//	Для Каждого Идентификатор Из Идентификаторы Цикл 
//		ЭлементНастройки = ПараметрыДанных.Найти(Идентификатор);
//		Если ЭлементНастройки = Неопределено
//			Или ЭлементНастройки.Значение = ФиксированныеПараметры[Идентификатор] Тогда 
//			Продолжить;
//		КонецЕсли;
//		
//		Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Ложь);
//		Прервать;
//	КонецЦикла;
	
	Возврат ФиксированныеПараметры;
КонецФункции

Процедура УстановитьФиксированныйПараметр(Идентификатор, Параметры, Настройки, ПользовательскиеНастройки, ДоступныеЗначения = Неопределено, Контекст = Неопределено)
	ФиксированныйПараметр = Параметры[Идентификатор];
	
	Если ДоступныеЗначения = Неопределено Тогда 
		ДоступныеЗначения = Новый СписокЗначений;
	КонецЕсли;
	
	ЭлементНастройки = Настройки.ПараметрыДанных.Элементы.Найти(Идентификатор);
	Если ЭлементНастройки = Неопределено Тогда 
		Если ДоступныеЗначения.Количество() > 0 Тогда 
			Параметры[Идентификатор] = ДоступныеЗначения[0].Значение;
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
	ЭлементПользовательскойНастройки = Неопределено;   
			
	Если ТипЗнч(ПользовательскиеНастройки) = Тип("ПользовательскиеНастройкиКомпоновкиДанных")
		И (Настройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")
		Или ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("ОтчетИнициализирован")) Тогда 
		
		ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
		ЭлементНастройки.ИдентификаторПользовательскойНастройки);
	КонецЕсли;     
	
	Если ЭлементПользовательскойНастройки <> Неопределено
		И ДоступныеЗначения.НайтиПоЗначению(ЭлементПользовательскойНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ДоступныеЗначения.НайтиПоЗначению(ЭлементНастройки.Значение) <> Неопределено Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	ИначеЕсли Идентификатор = "ИмяОбъектаМетаданных"
		И ЗначениеЗаполнено(Параметры.ИсточникДанных) Тогда 
		ФиксированныйПараметр = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(Параметры.ИсточникДанных).Имя;
	ИначеЕсли ДоступныеЗначения.Количество() > 0 Тогда 
		ФиксированныйПараметр = ДоступныеЗначения[0].Значение;
	ИначеЕсли ЭлементПользовательскойНастройки <> Неопределено
		И ЗначениеЗаполнено(ЭлементПользовательскойНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементПользовательскойНастройки.Значение;
	ИначеЕсли ЗначениеЗаполнено(ЭлементНастройки.Значение) Тогда 
		ФиксированныйПараметр = ЭлементНастройки.Значение;
	КонецЕсли;
	
	Если Идентификатор = "ТипОбъектаМетаданных"
		И ЗначениеЗаполнено(Параметры.ИсточникДанных)
		И Параметры.ИсточникДанных.ПолучитьОбъект() <> Неопределено Тогда 
		
		ОбъектМетаданных = МетаданныеИсточникаДанных(Параметры.ИсточникДанных, Контекст);
		Если ОбъектМетаданных <> Неопределено Тогда
			ТипОбъектаМетаданных = ОбщегоНазначения.ИмяБазовогоТипаПоОбъектуМетаданных(ОбъектМетаданных);
			Если ТипОбъектаМетаданных <> ФиксированныйПараметр Тогда 
				Параметры.ИсточникДанных = Неопределено;
			КонецЕсли;
		Иначе
			Параметры.ИсточникДанных = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Параметры[Идентификатор] = ФиксированныйПараметр;
КонецПроцедуры

// Устанавливает значения специализированных параметров универсального отчета.
//
// Параметры:
//  Отчет
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных
//
Процедура УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ПараметрыДанных = Настройки.ПараметрыДанных;
	
	ДоступныеПараметры = ПараметрыДанных.ДоступныеПараметры;
	Если ДоступныеПараметры = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Для Каждого Параметр Из ФиксированныеПараметры Цикл 
		Если ДоступныеПараметры.Элементы.Найти(Параметр.Ключ) = Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ЭлементНастройки = ПараметрыДанных.Элементы.Найти(Параметр.Ключ);
		Если ЭлементНастройки = Неопределено Тогда 
			ЭлементНастройки = ПараметрыДанных.Элементы.Добавить();
			ЭлементНастройки.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ЭлементНастройки.Значение = Параметр.Значение;
			ЭлементНастройки.Использование = Истина;
		Иначе
			ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
		
		ЭлементПользовательскойНастройки = Неопределено;
		Если ПользовательскиеНастройки <> Неопределено Тогда 
			ЭлементПользовательскойНастройки = ПользовательскиеНастройки.Элементы.Найти(
				ЭлементНастройки.ИдентификаторПользовательскойНастройки);
		КонецЕсли;
		
		Если ЭлементПользовательскойНастройки <> Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(ЭлементПользовательскойНастройки, ЭлементНастройки, "Использование, Значение");
		КонецЕсли;
	КонецЦикла;
	
	Если ПользовательскиеНастройки <> Неопределено Тогда 
		ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
	КонецЕсли;
КонецПроцедуры

#Область РаботаСТиповойСхемойНастраиваемойВПользовательскихНастройках

Функция СхемаКомпоновкиДанных(ФиксированныеПараметры) Экспорт 
	СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	ТекстЗапроса = СтрЗаменить(ФиксированныеПараметры.ТекстЗапросаИсточника, "¶", Символы.ПС);
	Если ПустаяСтрока(ТекстЗапроса) Тогда
		Возврат СхемаКомпоновкиДанных;
	КонецЕсли;
	
	СхемаКомпоновкиДанных.ПоляИтога.Очистить();
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.ИспользоватьГруппировкиЗапросаЕслиВозможно = Истина;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
		
	МодельЗапроса = ОбработкаМоделиЗапроса.РазобратьЗапрос(ТекстЗапроса);	
	
	Для Каждого ПолеЗапроса Из МодельЗапроса.Элементы[МодельЗапроса.Элементы.ВГраница()].Колонки Цикл
		ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Поле = ПолеЗапроса.Имя;
		ПолеНабора.ПутьКДанным = ПолеЗапроса.Имя;
		ПолеНабора.ТипЗначения = ПолеЗапроса.ТипЗначения;		
	КонецЦикла;	
	
	Попытка
		ПараметрыЗапроса =  МодельЗапросаУтилиты.ПолучитьИспользуемыеПараметры(ТекстЗапроса);
		УниверсальныйОтчетРасширенный.УстановитьПрефиксыПсевдонимамПредставленийВПакете(МодельЗапроса);
		УниверсальныйОтчетРасширенный.ЗаменитьИсполняемыеПредставленияВременнымиТаблицами(МодельЗапроса);
		ТекстЗапроса = ГенерацияТекстовЗапросов.ТекстПакетаЗапросов(МодельЗапроса);
	
		НаборДанных.Запрос = ТекстЗапроса;
	Исключение
		Возврат СхемаКомпоновкиДанных;
	КонецПопытки;
	
	Для Каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
		ПараметрСхемы = СхемаКомпоновкиДанных.Параметры.Добавить();
		ПараметрСхемы.Имя = ПараметрЗапроса.Имя;
		ПараметрСхемы.Использование = ИспользованиеПараметраКомпоновкиДанных.Всегда;
		ПараметрСхемы.ЗапрещатьНезаполненныеЗначения = Истина;
		ПараметрСхемы.ОграничениеИспользования = Ложь;
		ПараметрСхемы.ДоступенСписокЗначений =  ПараметрЗапроса.ЭтоСписокЗначений;
		Если ПараметрЗапроса.ТипЗначения = Неопределено 
			Или МодельЗапросаТипы.СодержитПроизвольныйТип(ПараметрЗапроса.ТипЗначения) Тогда
			ПараметрСхемы.ТипЗначения = Новый ОписаниеТипов("Неопределено");	
		Иначе
			ПараметрСхемы.ТипЗначения = ПараметрЗапроса.ТипЗначения;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;
КонецФункции

// Устанавливает настройки по умолчанию.
//
// Параметры:
//  Отчет - ОтчетОбъект
//  ФиксированныеПараметры - см. ФиксированныеПараметры
//  Настройки - НастройкиКомпоновкиДанных
//  ПользовательскиеНастройки - ПользовательскиеНастройкиКомпоновкиДанных
//
Процедура УстановитьСтандартныеНастройки(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки) Экспорт 
	ОтчетИнициализирован = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
		Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь);    
		
	Если ОтчетИнициализирован Тогда 
		Возврат;
	КонецЕсли;
	
	РежимыОтображенияФиксированныхПараметров = РежимыОтображенияФиксированныхПараметров(Настройки);
	
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Настройки = Отчет.КомпоновщикНастроек.Настройки;
	Настройки.Выбор.Элементы.Очистить();
	Настройки.Структура.Очистить();
	
	УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображенияФиксированныхПараметров);
	
//	ДобавитьПоказатели(ФиксированныеПараметры, Настройки);
//	СформироватьСтруктуру(ФиксированныеПараметры, Отчет.СхемаКомпоновкиДанных, Настройки);
	
	УстановитьФиксированныеПараметры(Отчет, ФиксированныеПараметры, Настройки, ПользовательскиеНастройки);
	
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован", Истина);
КонецПроцедуры

#КонецОбласти

#Область РаботаСПроизвольнойСхемойИзФайла

// Возвращает загружаемую схему компоновки данных.
//
// Параметры:
//  ЗагруженнаяСхема - ДвоичныеДанные
//
// Возвращаемое значение:
//  СхемаКомпоновкиДанных
//
Функция ИзвлечьСхемуИзДвоичныхДанных(ЗагруженнаяСхема) Экспорт
	
	ПолноеИмяФайла = ПолучитьИмяВременногоФайла();
	ЗагруженнаяСхема.Записать(ПолноеИмяФайла);
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл(ПолноеИмяФайла);
	
	СхемаКД = СериализаторXDTO.ПрочитатьXML(ЧтениеXML, Тип("СхемаКомпоновкиДанных"));
	
	ЧтениеXML.Закрыть();
	ЧтениеXML = Неопределено;
	
	УдалитьФайлы(ПолноеИмяФайла);
	
	Если СхемаКД.НастройкиПоУмолчанию.ДополнительныеСвойства.Свойство("СхемаКомпоновкиДанных") Тогда
		СхемаКД.НастройкиПоУмолчанию.ДополнительныеСвойства.СхемаКомпоновкиДанных = Неопределено;
	КонецЕсли;
	
	Возврат СхемаКД;
	
КонецФункции

Процедура УстановитьСтандартныеНастройкиЗагруженнойСхемы(Отчет, ДвоичныеДанныеСхемы, Настройки, ПользовательскиеНастройки) Экспорт 
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Настройки.ДополнительныеСвойства, "ОтчетИнициализирован", Ложь) Тогда 
		Возврат;
	КонецЕсли;
	
	Настройки = Отчет.СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	Настройки.ДополнительныеСвойства.Вставить("СхемаКомпоновкиДанных", ДвоичныеДанныеСхемы);
	Настройки.ДополнительныеСвойства.Вставить("ОтчетИнициализирован",  Истина);
КонецПроцедуры

#КонецОбласти

#Область РаботаСИсточникомДанныхВариантаОтчета

// Возвращает настройки варианта отчета с установленным параметром ИсточникДанных.
//
// Параметры:
//  Вариант - СправочникОбъект.ВариантыОтчетов - хранилище настроек варианта отчета.
//
// Возвращаемое значение:
//   НастройкиКомпоновкиДанных, Неопределено - обновленные настройки или Неопределено,
//                                            если обновить не удалось.
//
Функция НастройкиВарианта(Вариант) Экспорт
	Попытка
		НастройкиВарианта = Вариант.Настройки.Получить(); // НастройкиКомпоновкиДанных
	Исключение
		// Не удалось десериализовать хранилище значения:
		//  возможно обнаружена ссылка на несуществующий тип.
		Возврат Неопределено;
	КонецПопытки;
	
	Если НастройкиВарианта = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыДанных = НастройкиВарианта.ПараметрыДанных.Элементы;
	
	ПараметрыИскомые = Новый Структура(
		"ТипОбъектаМетаданных, ПолноеИмяОбъектаМетаданных, ИмяОбъектаМетаданных, ИсточникДанных");
	Для Каждого Параметр Из ПараметрыИскомые Цикл 
		НайденныйПараметр = ПараметрыДанных.Найти(Параметр.Ключ);
		Если НайденныйПараметр <> Неопределено Тогда 
			ПараметрыИскомые[Параметр.Ключ] = НайденныйПараметр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	// Если в настройках варианта хранится параметр с неактуальным именем - выполнится его актуализация.
	Если ЗначениеЗаполнено(ПараметрыИскомые.ПолноеИмяОбъектаМетаданных) Тогда 
		ПараметрыИскомые.ИмяОбъектаМетаданных = ПараметрыИскомые.ПолноеИмяОбъектаМетаданных;
	КонецЕсли;
	ПараметрыИскомые.Удалить("ПолноеИмяОбъектаМетаданных");
	
	Если Не ЗначениеЗаполнено(ПараметрыИскомые.ИсточникДанных) Тогда 
		ПараметрыИскомые.ИсточникДанных = ИсточникДанных(
			ПараметрыИскомые.ТипОбъектаМетаданных, ПараметрыИскомые.ИмяОбъектаМетаданных);
		Если ПараметрыИскомые.ИсточникДанных = Неопределено Тогда 
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыУстанавливаемые = Новый Структура("ИсточникДанных, ИмяОбъектаМетаданных");
	ЗаполнитьЗначенияСвойств(ПараметрыУстанавливаемые, ПараметрыИскомые);
	
	ИмяОбъекта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыИскомые.ИсточникДанных, "Имя");
	Если ИмяОбъекта <> ПараметрыУстанавливаемые.ИмяОбъектаМетаданных Тогда 
		ПараметрыУстанавливаемые.ИмяОбъектаМетаданных = ИмяОбъекта;
	КонецЕсли;
	
	Для Каждого Параметр Из ПараметрыУстанавливаемые Цикл 
		НайденныйПараметр = ПараметрыДанных.Найти(Параметр.Ключ);
		Если НайденныйПараметр = Неопределено Тогда 
			ПараметрДанных = ПараметрыДанных.Добавить();
			ПараметрДанных.Параметр = Новый ПараметрКомпоновкиДанных(Параметр.Ключ);
			ПараметрДанных.Значение = Параметр.Значение;
			ПараметрДанных.Использование = Истина;
		Иначе
			НастройкиВарианта.ПараметрыДанных.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
		КонецЕсли;
	КонецЦикла;
	
	Возврат НастройкиВарианта;
КонецФункции

// Возвращает источник данных отчета
//
// Параметры:
//  ТипМенеджера - Строка - представление менеджера объекта метаданных,
//                 например, "Справочники" или "РегистрыСведений" и т.д.
//  ИмяОбъекта  - Строка - краткое имя объекта метаданных,
//                например, "Валюты" или "КурсыВалют" и т.д.
//
// Возвращаемое значение:
//   - СправочникСсылка.ИдентификаторыОбъектовМетаданных - ссылка на найденный элемент справочника
//   - Неопределено
//
Функция ИсточникДанных(ТипМенеджера, ИмяОбъекта)
	ТипОбъекта = ТипОбъектаПоТипуМенеджера(ТипМенеджера);
	ПолноеИмяОбъекта = ТипОбъекта + "." + ИмяОбъекта;
	Если ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ПолноеИмяОбъекта) = Неопределено Тогда 
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Варианты отчетов.Установка источника данных универсального отчета'", 
			ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ВариантыОтчетов,,
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Источник данных %1 отсутствует'"), 
				ПолноеИмяОбъекта));
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ОбщегоНазначения.ИдентификаторОбъектаМетаданных(ПолноеИмяОбъекта);
КонецФункции

Функция МетаданныеИсточникаДанных(ИсточникДанных, Контекст)
	
	Попытка
		ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоИдентификатору(ИсточникДанных);
	Исключение
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Отчет не может быть сформирован по причине: %1 %2'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()),
			НСтр("ru = 'Выберите другой справочник или документ.'"));
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Формирование варианта универсального отчета'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Предупреждение, Метаданные.Отчеты.УниверсальныйОтчет,, ТекстСообщения);
		Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения") Тогда
			ТекстРекомендации = НСтр("ru = 'Отчет не может быть сформирован. Выберите другой справочник или документ.'");
			ОтчетыКлиентСервер.ОтобразитьСостояниеОтчета(
				Контекст, ТекстРекомендации);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат ОбъектМетаданных;
	
КонецФункции

// Возвращает тип объекта метаданных по соответствующему типу менеджера
//
// Параметры:
//  ТипМенеджера - Строка - представление менеджера объекта метаданных,
//                 например, "Справочники" или "РегистрыСведений" и т.д.
//
// Возвращаемое значение:
//   Строка - тип объекта метаданных, например, "Справочник" или "РегистрСведений" и т.д.
//
Функция ТипОбъектаПоТипуМенеджера(ТипМенеджера)
	Типы = Новый Соответствие;
	Типы.Вставить("Справочники", "Справочник");
	Типы.Вставить("Документы", "Документ");
	Типы.Вставить("Обработки", "Обработка");
	Типы.Вставить("ПланыВидовХарактеристик", "ПланВидовХарактеристик");
	Типы.Вставить("РегистрыБухгалтерии", "РегистрБухгалтерии");
	Типы.Вставить("РегистрыНакопления", "РегистрНакопления");
	Типы.Вставить("РегистрыРасчета", "РегистрРасчета");
	Типы.Вставить("РегистрыСведений", "РегистрСведений");
	Типы.Вставить("БизнесПроцессы", "БизнесПроцесс");
	Типы.Вставить("ЖурналыДокументов", "ЖурналДокументов");
	Типы.Вставить("Задачи", "Задача");
	Типы.Вставить("Отчеты", "Отчет");
	Типы.Вставить("Константы", "Константа");
	Типы.Вставить("Перечисления", "Перечисление");
	Типы.Вставить("ПланыВидовРасчета", "ПланВидовРасчета");
	Типы.Вставить("ПланыОбмена", "ПланОбмена");
	Типы.Вставить("ПланыСчетов", "ПланСчетов");
	
	Возврат ?(Типы[ТипМенеджера] = Неопределено, "", Типы[ТипМенеджера]);
КонецФункции

#КонецОбласти

#Область СтандартныйЗаголовок

// Параметры:
//  Контекст - ФормаКлиентскогоПриложения
//           - Структура
//  Настройки - НастройкиКомпоновкиДанных
//  ФиксированныеПараметры - Структура
//  ДоступныеЗначения - СписокЗначений
//
Процедура УстановитьСтандартныйЗаголовокОтчета(Контекст, Настройки, ФиксированныеПараметры, ДоступныеЗначения) Экспорт 
	
//	Если Не УстановкаСтандартногоЗаголовкаОтчетаДоступна(Контекст) Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	ЗначенияПараметров = ЗначенияПараметровСтандартногоЗаголовка(Контекст, ФиксированныеПараметры, ДоступныеЗначения);
//	
//	ПредставлениеПериода = ПредставлениеПериодаОтчета(ЗначенияПараметров.Период);
//	
//	Если ЗначенияПараметров.ТипОбъектаМетаданных = Неопределено
//		И ЗначенияПараметров.ИмяОбъектаМетаданных = Неопределено
//		И ЗначенияПараметров.ИмяТаблицы = Неопределено Тогда 
//		
//		Заголовок = Метаданные.Отчеты.УниверсальныйОтчет.Представление();
//		
//	ИначеЕсли ЗначенияПараметров.ИмяТаблицы = Неопределено
//		И Не ЗначениеЗаполнено(ПредставлениеПериода) Тогда 
//		
//		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Универсальный отчет: %1 ""%2""'"),
//			ЗначенияПараметров.ТипОбъектаМетаданных,
//			ЗначенияПараметров.ИмяОбъектаМетаданных);
//		
//	ИначеЕсли ЗначенияПараметров.ИмяТаблицы <> Неопределено
//		И Не ЗначениеЗаполнено(ПредставлениеПериода) Тогда 
//		
//		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Универсальный отчет: %1 ""%2"" - таблица ""%3""'"),
//			ЗначенияПараметров.ТипОбъектаМетаданных,
//			ЗначенияПараметров.ИмяОбъектаМетаданных,
//			ЗначенияПараметров.ИмяТаблицы);
//		
//	ИначеЕсли ЗначенияПараметров.ИмяТаблицы = Неопределено
//		И ЗначениеЗаполнено(ПредставлениеПериода) Тогда 
//		
//		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Универсальный отчет: %1 ""%2"" за %3'"),
//			ЗначенияПараметров.ТипОбъектаМетаданных,
//			ЗначенияПараметров.ИмяОбъектаМетаданных,
//			ПредставлениеПериода);
//	Иначе
//		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
//			НСтр("ru = 'Универсальный отчет: %1 ""%2"" - таблица ""%3"" за %4'"),
//			ЗначенияПараметров.ТипОбъектаМетаданных,
//			ЗначенияПараметров.ИмяОбъектаМетаданных,
//			ЗначенияПараметров.ИмяТаблицы,
//			ПредставлениеПериода);
//	КонецЕсли;
//	
//	ЗаголовокУстановленИнтерактивно = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(
//		Настройки.ДополнительныеСвойства, "ЗаголовокУстановленИнтерактивно", Ложь);
//	
//	Если Не ЗаголовокУстановленИнтерактивно Тогда 
//		ПараметрЗаголовка = Настройки.ПараметрыВывода.Элементы.Найти("Заголовок");
//		ПараметрЗаголовка.Значение = Заголовок;
//	КонецЕсли;
//	
//	Если ТипЗнч(Контекст) = Тип("ФормаКлиентскогоПриложения")
//		И Контекст.ТипФормыОтчета = ТипФормыОтчета.Основная Тогда 
//		
//		Контекст.Заголовок = Заголовок;
//		Контекст.ОтчетНаименованиеТекущегоВарианта = Заголовок;
//	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область КоличествоПодчиненныхЗаписейВГруппировках

Процедура ВывестиКоличествоПодчиненныхЗаписей(Настройки, Схема, СтандартнаяОбработка) Экспорт 
	
	Если Схема.ВычисляемыеПоля.Найти("КоличествоПодчиненныхЗаписей") = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	ВыводитьКоличествоЗаписей = ВыводитьКоличествоЗаписей(Настройки);
	
	Для Каждого ЭлементСтруктуры Из Настройки.Структура Цикл 
		
		Если Не ЭлементСтруктуры.Использование Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда 
			
			ВывестиКоличествоПодчиненныхЗаписейГруппировки(ЭлементСтруктуры, ВыводитьКоличествоЗаписей);
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда 
			
			ВывестиКоличествоПодчиненныхЗаписейТаблицы(ЭлементСтруктуры, ВыводитьКоличествоЗаписей);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Параметры:
//  Настройки - НастройкиКомпоновкиДанных
//
// Возвращаемое значение:
//  Булево
//
Функция ВыводитьКоличествоЗаписей(Настройки)
	
	ВыводитьКоличествоЗаписей = Настройки.ПараметрыДанных.Элементы.Найти("ВыводитьКоличествоПодчиненныхЗаписей");
	
	Возврат ВыводитьКоличествоЗаписей <> Неопределено
		И ВыводитьКоличествоЗаписей.Значение;
	
КонецФункции

Процедура ВывестиКоличествоПодчиненныхЗаписейГруппировки(Группировка, Выводить)
	
	ПоляГруппировки = Группировка.ПоляГруппировки.Элементы;
	
	Если ПоляГруппировки.Количество() > 0 Тогда 
		
		ВыбранныеПоля = Группировка.Выбор;
		ПолеКоличестваЗаписей = ПолеКоличестваПодчиненныхЗаписей(ВыбранныеПоля, ВыбранныеПоля.Элементы);
		ПолеКоличестваЗаписей.Использование = Выводить;
		
	Иначе
		СкрытьКоличествоЗаписейВДетальныхЗаписях(Группировка);
	КонецЕсли;
	
	Для Каждого ЭлементСтруктуры Из Группировка.Структура Цикл 
		
		Если Не ЭлементСтруктуры.Использование Тогда 
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(ЭлементСтруктуры) = Тип("ГруппировкаКомпоновкиДанных") Тогда 
			
			ВывестиКоличествоПодчиненныхЗаписейГруппировки(ЭлементСтруктуры, Выводить);
			
		ИначеЕсли ТипЗнч(ЭлементСтруктуры) = Тип("ТаблицаКомпоновкиДанных") Тогда 
			
			ВывестиКоличествоПодчиненныхЗаписейТаблицы(ЭлементСтруктуры, Выводить);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВывестиКоличествоПодчиненныхЗаписейТаблицы(Таблица, Выводить)
	
	КолонкаКоличестваЗаписей = Неопределено;
	
	Для Каждого Колонка Из Таблица.Колонки Цикл 
		
		ПоляГруппировки = Колонка.ПоляГруппировки.Элементы;
		
		Если ПоляГруппировки.Количество() = 0 Тогда 
			
			КолонкаКоличестваЗаписей = Колонка;
			Прервать;
		
		КонецЕсли;
		
	КонецЦикла;
	
	Если КолонкаКоличестваЗаписей <> Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	КолонкаКоличестваЗаписей = Таблица.Колонки.Добавить();
	
	ВыбранныеПоля = КолонкаКоличестваЗаписей.Выбор;
	ПолеКоличестваЗаписей = ПолеКоличестваПодчиненныхЗаписей(ВыбранныеПоля, ВыбранныеПоля.Элементы);
	ПолеКоличестваЗаписей.Использование = Выводить;
	
	СкрытьКоличествоЗаписейВДетальныхЗаписяхТаблицы(Таблица.Строки);
	
КонецПроцедуры

Функция ПолеКоличестваПодчиненныхЗаписей(ВыбранныеПоля, Элементы)
	
	ПолеКоличестваЗаписей = Неопределено;
	ИскомоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоПодчиненныхЗаписей");
	
	Для Каждого Элемент Из Элементы Цикл 
		
		Если ТипЗнч(Элемент) = Тип("ВыбранноеПолеКомпоновкиДанных") Тогда 
			
			Если Элемент.Поле = ИскомоеЗначение Тогда 
				
				ПолеКоличестваЗаписей = Элемент;
				Прервать;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаВыбранныхПолейКомпоновкиДанных") Тогда 
			
			Если Элемент.Использование Тогда 
				ПолеКоличестваПодчиненныхЗаписей(ВыбранныеПоля, Элемент.Элементы);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПолеКоличестваЗаписей = Неопределено Тогда 
		
		ПолеКоличестваЗаписей = ВыбранныеПоля.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
		ПолеКоличестваЗаписей.Поле = ИскомоеЗначение;
		
	КонецЕсли;
	
	Возврат ПолеКоличестваЗаписей;
	
КонецФункции

Процедура СкрытьКоличествоЗаписейВДетальныхЗаписяхТаблицы(Строки)
	
	Для Каждого Строка Из Строки Цикл 
		
		ПоляГруппировки = Строка.ПоляГруппировки.Элементы;
		
		Если ПоляГруппировки.Количество() = 0 Тогда 
			СкрытьКоличествоЗаписейВДетальныхЗаписях(Строка);
		Иначе
			СкрытьКоличествоЗаписейВДетальныхЗаписяхТаблицы(Строка.Структура);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СкрытьКоличествоЗаписейВДетальныхЗаписях(ДетальныеЗаписи)
	
	Поле = Новый ПолеКомпоновкиДанных("КоличествоПодчиненныхЗаписей");
	
	ОформлениеКоличестваЗаписей = ОформлениеКоличестваЗаписей(ДетальныеЗаписи, Поле);
	
	ОформляемоеПоле = ОформлениеКоличестваЗаписей.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Поле;
	
	УсловиеОформления = ОформлениеКоличестваЗаписей.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	УсловиеОформления.ЛевоеЗначение = Поле;
	УсловиеОформления.ВидСРавнения = ВидСравненияКомпоновкиДанных.НеРавно;
	УсловиеОформления.ПравоеЗначение = 0;
	УсловиеОформления.Использование = Истина;
	
	ОформлениеКоличестваЗаписей.Оформление.УстановитьЗначениеПараметра("Текст", "");
	
	ВариантыИспользования = ВариантыИспользованияОформления();
	Для Каждого ВариантИспользования Из ВариантыИспользования Цикл 
		ОформлениеКоличестваЗаписей[ВариантИспользования] = ИспользованиеУсловногоОформленияКомпоновкиДанных.НеИспользовать;
	КонецЦикла;
	
КонецПроцедуры

// Возвращаемое значение:
//   Массив из Строка - коллекция строковых идентификаторов свойства элемента условного оформления 
//                      ИспользованиеУсловногоОформленияКомпоновкиДанных.
//
Функция ВариантыИспользованияОформления()
	
	ВариантыИспользования = Новый Массив;
	ВариантыИспользования.Добавить("ИспользоватьВЗаголовке");
	ВариантыИспользования.Добавить("ИспользоватьВЗаголовкеПолей");
	ВариантыИспользования.Добавить("ИспользоватьВИерархическойГруппировке");
	ВариантыИспользования.Добавить("ИспользоватьВОбщемИтоге");
	ВариантыИспользования.Добавить("ИспользоватьВОтборе");
	ВариантыИспользования.Добавить("ИспользоватьВПараметрах");
	ВариантыИспользования.Добавить("ИспользоватьВЗаголовкеОбщегоИтога");
	ВариантыИспользования.Добавить("ИспользоватьВЗаголовкеПолейРесурсов");
	ВариантыИспользования.Добавить("ИспользоватьВЗаголовкеПолейРесурсовОбщегоИтога");
	
	Возврат ВариантыИспользования;
	
КонецФункции

Функция ОформлениеКоличестваЗаписей(ДетальныеЗаписи, ИскомоеЗначение)
	
	ОформлениеКоличестваЗаписей = Неопределено;
	
	ЭлементыОформления = ДетальныеЗаписи.УсловноеОформление.Элементы;
	
	Для Каждого ЭлементОформления Из ЭлементыОформления Цикл 
		
		ПоляОформления = ЭлементОформления.Поля.Элементы;
		
		Если ПоляОформления.Количество() > 0
			И ПоляОформления[0].Поле = ИскомоеЗначение Тогда 
			
			ОформлениеКоличестваЗаписей = ЭлементОформления;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ОформлениеКоличестваЗаписей = Неопределено Тогда 
		ОформлениеКоличестваЗаписей = ЭлементыОформления.Добавить();
	КонецЕсли;
	
	ОформлениеКоличестваЗаписей.Поля.Элементы.Очистить();
	ОформлениеКоличестваЗаписей.Отбор.Элементы.Очистить();
	
	Возврат ОформлениеКоличестваЗаписей;
	
КонецФункции

Функция РежимыОтображенияФиксированныхПараметров(Настройки)
	
	РежимыОтображения = Новый Структура();
	РежимыОтображения.Вставить("Период", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("ТипОбъектаМетаданных", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("ИмяОбъектаМетаданных", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("ИмяТаблицы", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
	РежимыОтображения.Вставить("ВыводитьКоличествоПодчиненныхЗаписей", РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный);
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого РежимОтображения Из РежимыОтображения Цикл 
		
		НайденныйПараметр = Параметры.Найти(РежимОтображения.Ключ);
		
		Если НайденныйПараметр <> Неопределено Тогда 
			РежимыОтображения[РежимОтображения.Ключ] = НайденныйПараметр.РежимОтображения;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат РежимыОтображения;
	
КонецФункции

Процедура УстановитьРежимыОтображенияФиксированныхПараметров(Настройки, РежимыОтображения)
	
	Параметры = Настройки.ПараметрыДанных.Элементы;
	
	Для Каждого РежимОтображения Из РежимыОтображения Цикл 
		
		НайденныйПараметр = Параметры.Найти(РежимОтображения.Ключ);
		
		Если НайденныйПараметр <> Неопределено Тогда 
			НайденныйПараметр.РежимОтображения = РежимыОтображения[РежимОтображения.Ключ];
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПериодДатаОкончания(Период, ТипОбъектаМетаданных, ИмяТаблицы) Экспорт
	
	Если Период = Неопределено Тогда
		Возврат Дата(1, 1, 1);
	КонецЕсли;
	
	ДатаОкончания = ?(ТипЗнч(Период) = Тип("СтандартныйПериод"), Период.ДатаОкончания, Период);
	
	Если СтрНайти(ВРег(ТипОбъектаМетаданных), "РЕГИСТР") = 0
	   Или СтрСравнить(ИмяТаблицы, "Остатки") <> 0 Тогда
		Возврат ДатаОкончания;
	КонецЕсли;
	
	Возврат Новый Граница(ДатаОкончания, ВидГраницы.Включая);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли