#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция СоздатьВалидаторОтбора(ИдентификаторИсточникаПредставления, ИмяПредставления, ОписаниеОтбора) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Обработка = Создать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Обработка.УстановитьИдентификаторИсточникаПредставления(ИдентификаторИсточникаПредставления);
	Обработка.УстановитьИмяПредставления(ИмяПредставления);
	Обработка.УстановитьОписаниеОтбора(ОписаниеОтбора);
	Обработка.УстановитьРежимВалидации();
	
	Возврат Обработка;
КонецФункции

Функция СоздатьДелегаторОтбора(ИдентификаторИсточникаПредставления, ИмяПредставления, ОписаниеОтбора) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	Обработка = Создать();
	УстановитьПривилегированныйРежим(Ложь);
	
	Обработка.УстановитьИдентификаторИсточникаПредставления(ИдентификаторИсточникаПредставления);
	Обработка.УстановитьИмяПредставления(ИмяПредставления);
	Обработка.УстановитьОписаниеОтбора(ОписаниеОтбора);
	
	Возврат Обработка;
КонецФункции

#КонецОбласти

#КонецЕсли