#Область СлужебныеПроцедурыИФункции

Процедура КодЗаполненияКоллекцииОтборовВМассивСтрок(МассивСтрок, ИмяКоллекцииОтборов, ОтборыИсполяемогоПредставления, ТекущиеТабуляции) Экспорт
	Если Не ЗначениеЗаполнено(ОтборыИсполяемогоПредставления) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ВыражениеОтбора Из ОтборыИсполяемогоПредставления Цикл
		ЭлементОтбора = ИсполнительПредставленийУтилиты.ЭлементБазовогоОтбораИзВыражения(ВыражениеОтбора);
		
		ПолеСтрокой = ГенерацияИсполняемогоКодаПредставленийУтилиты.ПримитивноеЗначениеВСтроку(ЭлементОтбора.ПутьКПолю);
		Если ЭлементОтбора.ЗначениеОтбора.ЭтоПараметрЗапроса Тогда
			ЗначениеСтрокой = ЭлементОтбора.ЗначениеОтбора.Значение;
		Иначе
			ЗначениеСтрокой = ГенерацияИсполняемогоКодаПредставленийУтилиты.ПримитивноеЗначениеВСтроку(ЭлементОтбора.ЗначениеОтбора.Значение);
		КонецЕсли;
		
		ВидСравненияСтрокой = ГенерацияИсполняемогоКодаПредставленийУтилиты.ПримитивноеЗначениеВСтроку(ЭлементОтбора.ВидСравнения);
			
		Строка = "ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(" + ИмяКоллекцииОтборов + ", " + ПолеСтрокой + ", " + ВидСравненияСтрокой + ", " + ЗначениеСтрокой + ");";
		МассивСтрок.ДобавитьСтроку(ТекущиеТабуляции + Строка);	
	КонецЦикла;
	
	МассивСтрок.ДобавитьСтроку(Символы.ПС);
КонецПроцедуры

#КонецОбласти