#Область СлужебныеПроцедурыИФункции

Процедура ЗаменитьИсполняемыеПредставленияВременнымиТаблицами(МодельЗапроса) Экспорт
	СчетчикИсполняемыхПредставлений = Новый Соответствие();
	ИндексЗапроса = 0;
	Для ИндексЗапроса = 0 По МодельЗапроса.Элементы.ВГраница() Цикл
		Если МодельЗапроса.Элементы[ИндексЗапроса].Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса);
	КонецЦикла;
КонецПроцедуры

// Заменить ВТИсполняемыми представленями в пакете.
// 
// Параметры:
//  МодельПакета - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
//  МодельИсходногоПакета - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
Процедура ЗаменитьВТИсполняемымиПредставленямиВПакете(МодельПакета, МодельИсходногоПакета) Экспорт
	ИсполняемыеПредставления = ИсполняемыеПредставленияИзПакета(МодельИсходногоПакета);
	
	Для Каждого Запрос Из МодельПакета.Элементы Цикл
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Запрос, ИсполняемыеПредставления);
	КонецЦикла;		
КонецПроцедуры

// Установить префиксы псевдонимам представлений в пакете.
// 
// Параметры:
//  Пакет - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
Процедура УстановитьПрефиксыПсевдонимамПредставленийВПакете(Пакет) Экспорт
	Счетчик = Новый Соответствие();
	Для Каждого Запрос Из Пакет.Элементы Цикл
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Запрос, Счетчик);	
	КонецЦикла;
	
КонецПроцедуры

Функция ИсполняемыеПредставленияИзПакета(МодельПакета) Экспорт
	ИсполняемыеПредставления = Новый Соответствие();
	
	Для Каждого Запрос Из  МодельПакета.Элементы Цикл	
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьИсполняемыеПредставленияИзЗапроса(Запрос, ИсполняемыеПредставления);
	КонецЦикла;
	
	Возврат ИсполняемыеПредставления;
КонецФункции

Процедура ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса)
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	Для ИндексОператора = 0 По МодельТекущегоЗапроса.Операторы.ВГраница() Цикл
		ЗаменитьИсполняемыеПредставленияВМоделиОператора(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора);
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемыеПредставленияВМоделиОператора(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора)
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	Для Каждого Источник Из МодельТекущегоЗапроса.Операторы[ИндексОператора].Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(Источник.Источник.ЗапросВыбора, СчетчикИсполняемыхПредставлений, -1);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			ЗаменитьИсполняемоеПредставлениеНаВТ(МодельЗапроса, Источник, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора);	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемоеПредставлениеНаВТ(МодельЗапроса, Источник, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора)
	ОписаниеФильтра = Неопределено;
	Если Источник.Источник.ВТФильтр <> Неопределено Тогда
		ОписаниеФильтра = МодельЗапросаУтилиты.СкопироватьЭлементМоделиЗапроса(Источник.Источник.ВТФильтр);
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(
			Источник.Источник.ВТФильтр.ЗапросВыбора, 
			СчетчикИсполняемыхПредставлений, 
			-1);	
	КонецЕсли;
	
	Псевдоним =Источник.Источник.Псевдоним;
	ОписаниеВТ = ОписаниеВТДляЗамены(Источник.Источник.ИмяТаблицы, СчетчикИсполняемыхПредставлений);
	ОписаниеВТ.Имя = Псевдоним;
	
	Источник.Источник = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица();
	Источник.Источник.ИмяТаблицы = Псевдоним;
	Источник.Источник.Псевдоним = Псевдоним;
	Источник.Источник.ОписаниеВТ = ОписаниеВТ;
	
	Если ОписаниеФильтра <>  Неопределено Тогда
		Построитель = МодельЗапросаУтилиты.СоздатьПостроительМодели(
			МодельЗапроса, 
			ИндексЗапроса, 
			ИндексОператора);
		
		ПсевдонимТаблицыФильтра = Псевдоним + "_Фильтр";		
		Построитель.ДобавитьВложенныйЗапрос(ОписаниеФильтра.ЗапросВыбора, ПсевдонимТаблицыФильтра);
		
		Построитель.ДобавитьСоединение(ПсевдонимТаблицыФильтра, Источник.Источник.Псевдоним, "Левое");
		ЧастиУсловия = Новый Массив();
		ИндексПоля = 0;
		Для Каждого Поле Из ОписаниеФильтра.Поля Цикл
			ЧастиУсловия.Добавить(Источник.Источник.Псевдоним + "." + Поле + "=" 
				+ ПсевдонимТаблицыФильтра + "." + ОписаниеФильтра.ЗапросВыбора.Колонки[ИндексПоля].Имя);
			ИндексПоля = ИндексПоля + 1;
		КонецЦикла;
		Построитель.УстановитьУсловиеСоединения(
			ПсевдонимТаблицыФильтра, 
			Источник.Источник.Псевдоним, 
			СтрСоединить(ЧастиУсловия, " И "));	
			
		МодельЗапроса = Построитель.ПолучитьМодель();
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеВТДляЗамены(ИмяТаблицыПредставления, СчетчикИсполняемыхПредставлений)
	Если СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления) = Неопределено Тогда
		Номер = 0;
	Иначе
		Номер = СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления);
	КонецЕсли;
	
	Номер = Номер + 1;
	СчетчикИсполняемыхПредставлений.Вставить(ИмяТаблицыПредставления, Номер);
	
	ИмяВТ =  СтрЗаменить(ИмяТаблицыПредставления, ".", "_") + "_" + Формат(Номер, "ЧГ=;");
	ОписаниеПредставления = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениТаблицы(ИмяТаблицыПредставления);
	
	ОписаниеВТ = ЭлементыМоделиЗапроса.НовыйОписаниеВременнойТаблицы();
	ОписаниеВТ.Имя = ИмяВТ;
	ОписаниеВТ.СозданаВЭтомПакете = Ложь;
	
	Для Каждого Поле Из ОписаниеПредставления.Поля Цикл
		ОписаниеВТ.Колонки.Вставить(ВРег(Поле.Имя), Поле.ТипЗначения);
		ОписаниеВТ.ПорядокКолонок.Добавить(Поле.Имя);
	КонецЦикла;
	
	Если ОписаниеПредставления.ОписаниеВТФильтр <> Неопределено Тогда
		Для Каждого ПолеФильтра Из ОписаниеПредставления.ОписаниеВТФильтр.ПоляФильтра Цикл
			Если ОписаниеВТ.Колонки.Получить(ВРег(ПолеФильтра.Имя)) = Неопределено Тогда
				Если ПолеФильтра.ТипЗначения = Неопределено Тогда
					ОписаниеВТ.Колонки.Вставить(
						ВРег(ПолеФильтра.Имя), 
						МодельЗапросаТипы.ПроизвольныйТип());
				Иначе
					ОписаниеВТ.Колонки.Вставить(ВРег(ПолеФильтра.Имя), ПолеФильтра.ТипЗначения);
				КонецЕсли;
				ОписаниеВТ.ПорядокКолонок.Добавить(ПолеФильтра.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ОписаниеВТ;
КонецФункции

Процедура ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Запрос, ИсполняемыеПредставления)
	Для Каждого Оператор Из Запрос.Операторы Цикл
		ЗаменитьВТИсполняемымиПредставленямиВОператоре(Оператор, ИсполняемыеПредставления);	
	КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьВТИсполняемымиПредставленямиВОператоре(Оператор, ИсполняемыеПредставления)
	ИсточникиПоИдентификаторам = МодельЗапросаУтилиты.ИсточникиОператораПоИдентификаторма(Оператор);
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Источник.Источник.ЗапросВыбора, ИсполняемыеПредставления);
		ИначеЕсли Источник.Источник.Тип = "ИсточникДанныхВременнаяТаблица" Тогда 	
			ЗаменитьВТИсполняемымПредставлением(Источник, ИсполняемыеПредставления, ИсточникиПоИдентификаторам);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьВТИсполняемымПредставлением(Источник, ИсполняемыеПредставления, ИсточникиПоИдентификаторам)
	ИсполняемоеПредставление = ИсполняемыеПредставления.Получить(Источник.Источник.Псевдоним);
	Если ИсполняемоеПредставление = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ИсполняемоеПредставление.ВТФильтр <> Неопределено Тогда
		ИсполняемоеПредставление.ВТФильтр = ПрисоединяемыйЗапросВОписаниеВТФильтр(
			Источник, 
			Источник.Источник.Псевдоним,
			ИсточникиПоИдентификаторам);	
	КонецЕсли;
	
	Источник.Источник = ИсполняемоеПредставление;
КонецПроцедуры

Функция ПрисоединяемыйЗапросВОписаниеВТФильтр(Источник, Псевдоним, ИсточникиПоИдентификаторам)
	Для Каждого Соединение Из Источник.Соединения Цикл
		ПрисоединясыйИсточник = ИсточникиПоИдентификаторам[Соединение.Источник];
		Если ПрисоединясыйИсточник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос"
			И ПрисоединясыйИсточник.Источник.Псевдоним = ПрисоединясыйИсточник.Источник.Псевдоним  + "_Фильтр" Тогда
				
			ВТФильтр = ЭлементыМоделиЗапроса.НовыйПараметрИсполняемогоПредставленияВТФильтр();
			ВТФильтр.ЗапросВыбора = Источник.Источник.ЗапросВыбора();
			
			Условия = МодельЗапросаУтилиты.УсловиеВМассивВыраженийПоИ(Соединение.Условие);
			Для Каждого Условие Из Условия Цикл
				
			КонецЦикла;	
			
			Возврат ВТФильтр;
		КонецЕсли;
	КонецЦикла;	
КонецФункции

Процедура УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Запрос, Счетчик) 
	Для Каждого Оператор Из Запрос.Операторы Цикл
		УстановитьПрефиксыПсевдонимамПредставленийВОператоре(Оператор, Счетчик);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьПрефиксыПсевдонимамПредставленийВОператоре(Оператор, Счетчик) 
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Источник.Источник.ЗапросВыбора, Счетчик);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			Если Источник.Источник.ВТФильтр <> Неопределено Тогда
				УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Источник.Источник.ВТФильтр.ЗапросВыбора, Счетчик);
			КонецЕсли;	
			Источник.Источник.Псевдоним = НовыйПсевдонимИсполняемогоПредтсавления(Источник.Источник.Псевдоним, Счетчик);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция НовыйПсевдонимИсполняемогоПредтсавления(ТекущийПсевдоним, Счетчик)
	Номер = Счетчик.Получить(ТекущийПсевдоним);
	Если Номер = Неопределено Тогда
		Номер = 0;
	КонецЕсли;
	
	Номер = Номер + 1;
	Счетчик.Вставить(ТекущийПсевдоним, Номер);
	
	Возврат ТекущийПсевдоним + Формат(Номер, "ЧГ=;");
КонецФункции

Процедура ЗаполнитьИсполняемыеПредставленияИзЗапроса(Запрос, ИсполняемыеПредставления) 
	Для Каждого Оператор Из Запрос.Операторы Цикл
		ЗаполнитьИсполняемыеПредставленияИзОператора(Оператор, ИсполняемыеПредставления);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьИсполняемыеПредставленияИзОператора(Оператор, ИсполняемыеПредставления) 
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаполнитьИсполняемыеПредставленияИзОператора(Источник.Источник.ЗапросВыбора, ИсполняемыеПредставления);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			Если Источник.Источник.ВТФильтр <> Неопределено Тогда
				ЗаполнитьИсполняемыеПредставленияИзОператора(Источник.Источник.ВТФильтр.ЗапросВыбора, ИсполняемыеПредставления);
			КонецЕсли;	
			ИсполняемыеПредставления.Вставить(Источник.Источник.Псевдоним, Источник.Источник)
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция НовыйПсевдонимИсполняемогоПредтсавления(ТекущийПсевдоним, Счетчик)
	Номер = Счетчик.Получить(ТекущийПсевдоним);
	Если Номер = Неопределено Тогда
		Номер = 0;
	КонецЕсли;
	
	Номер = Номер + 1;
	Счетчик.Вставить(ТекущийПсевдоним, Номер);
	
	Возврат ТекущийПсевдоним + Формат(Номер, "ЧГ=;");
КонецФункции



#КонецОбласти