#Область СлужебныеПроцедурыИФункции

Процедура ЗаменитьИсполняемыеПредставленияВременнымиТаблицами(МодельЗапроса) Экспорт
	Контекст = КонтекстЗаменыИсполняемыхПредставлений();
	
	ИндексЗапроса = 0;
	Для ИндексЗапроса = 0 По МодельЗапроса.Элементы.ВГраница() Цикл
		Если МодельЗапроса.Элементы[ИндексЗапроса].Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(
			МодельЗапроса, 
			ИндексЗапроса,
			Контекст);
	КонецЦикла;
	
	Для Каждого КлючЗначение Из Контекст.ИменаПредставленийПоИменамВТ Цикл
		ИспользуемеыПоля = Контекст.ИспользуемыеПоляПредставлений.Получить(КлючЗначение.Ключ);
		Если ЗначениеЗаполнено(ИспользуемеыПоля) Тогда
			ДобавитьДекларациюВТВПакет(МодельЗапроса, КлючЗначение.Значение, КлючЗначение.Ключ, ИспользуемеыПоля);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

// Заменить ВТИсполняемыми представленями в пакете.
// 
// Параметры:
//  МодельПакета - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
//  МодельИсходногоПакета - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
Процедура ЗаменитьВТИсполняемымиПредставленямиВПакете(МодельПакета, МодельИсходногоПакета) Экспорт
	ИсполняемыеПредставления = ИсполняемыеПредставленияИзПакета(МодельИсходногоПакета);
	
	ИменаВТКУдалению = Новый Соответствие();
	Для Каждого Запрос Из МодельПакета.Элементы Цикл
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Запрос, ИсполняемыеПредставления, ИменаВТКУдалению);
	КонецЦикла;		
	
	ВГраница = МодельПакета.Элементы.ВГраница();
	Для Индекс = 0 По МодельПакета.Элементы.ВГраница() Цикл
		Если МодельПакета.Элементы[ВГраница - Индекс].Тип <> "ЗапросУничтожения"
			И ИменаВТКУдалению.Получить(МодельПакета.Элементы[ВГраница - Индекс].ТаблицаДляПомещения) <> Неопределено Тогда
				
			 МодельПакета.Элементы.Удалить(ВГраница - Индекс);
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

// Исполняемая схема компоновки данных.
// 
// Параметры:
//  МодельИсполняемгоЗапроса - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
//  ПараметрыСхемы - ПараметрыСхемыКомпоновкиДанных
// 
// Возвращаемое значение:
// 	СхемаКомпоновкиДанных 
Функция ИсполняемаяСхемаКомпоновкиДанных(МодельИсполняемгоЗапроса, ПараметрыСхемы) Экспорт
	СхемаКомпоновкиДанных = Новый СхемаКомпоновкиДанных();
	
	ИсточникДанных = СхемаКомпоновкиДанных.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя = "ИсточникДанных1";
	ИсточникДанных.ТипИсточникаДанных = "Local";
	
	НаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Добавить(Тип("НаборДанныхОбъектСхемыКомпоновкиДанных"));
	НаборДанных.Имя = "НаборДанных1";
	НаборДанных.ИсточникДанных = ИсточникДанных.Имя;
	НаборДанных.ИмяОбъекта = "Данные";

	ФинальныйЗапрос = МодельИсполняемгоЗапроса.Элементы[МодельИсполняемгоЗапроса.Элементы.ВГраница()];
	
	Для Каждого ПолеЗапроса Из ФинальныйЗапрос.Колонки Цикл
		ПолеНабора = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеНабора.Поле = ПолеЗапроса.Имя;
		ПолеНабора.ПутьКДанным = ПолеЗапроса.Имя;
		ПолеНабора.ТипЗначения = ПолеЗапроса.ТипЗначения;	
	КонецЦикла;	
	
	Для Каждого Параметр Из ПараметрыСхемы Цикл
		НовыйПараметрСхемы = СхемаКомпоновкиДанных.Параметры.Добавить();
		НовыйПараметрСхемы.Имя = Параметр.Имя;
		НовыйПараметрСхемы.Использование = Параметр.Использование;
		НовыйПараметрСхемы.ЗапрещатьНезаполненныеЗначения = Параметр.ЗапрещатьНезаполненныеЗначения;
		НовыйПараметрСхемы.ОграничениеИспользования = Параметр.ЗапрещатьНезаполненныеЗначения;
		НовыйПараметрСхемы.ДоступенСписокЗначений = Параметр.ДоступенСписокЗначений;
		НовыйПараметрСхемы.ТипЗначения = Параметр.ТипЗначения;
	КонецЦикла;
	
	Возврат СхемаКомпоновкиДанных;
КонецФункции

// Установить префиксы псевдонимам представлений в пакете.
// 
// Параметры:
//  Пакет - см. ЭлементыМоделиЗапроса.НовыйПакетЗапросов
Процедура УстановитьПрефиксыПсевдонимамПредставленийВПакете(Пакет) Экспорт
	Счетчик = Новый Соответствие();
	Для Каждого Запрос Из Пакет.Элементы Цикл
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Запрос, Счетчик);	
	КонецЦикла;
	
КонецПроцедуры

Функция ИсполняемыеПредставленияИзПакета(МодельПакета) Экспорт
	ИсполняемыеПредставления = Новый Соответствие();
	
	Для Каждого Запрос Из  МодельПакета.Элементы Цикл	
		Если Запрос.Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаполнитьИсполняемыеПредставленияИзЗапроса(Запрос, ИсполняемыеПредставления);
	КонецЦикла;
	
	Возврат ИсполняемыеПредставления;
КонецФункции

Процедура ОбработатьЗазыменованияВФинальномЗапросе(Пакет) Экспорт
	Индекс = Пакет.Элементы.ВГраница();
	СписокДолступныхВТ = МодельЗапросаУтилиты.ОписаниеДоступныхВременныхТаблиц(Пакет, Индекс);
	
	ОбработатьРазыменованияВЗапросе(Пакет.Элементы[Индекс], Индекс, СписокДолступныхВТ);
КонецПроцедуры

Функция КонтекстОбработкиРазыменований(Оператор, ИндексЗапроса, СписокДоступныхВТ) Экспорт
	Возврат МодельЗапросаУтилиты.КонтекстОбработкиВыражения(Оператор, ИндексЗапроса, СписокДоступныхВТ);
КонецФункции

Функция КонтекстОбработкиРазыменованийВложенногоЗапроса(ТекущийКонтекст) Экспорт
	Возврат ОбработкаМоделиЗапроса.КонтекстОбработкиВложенногоЗапроса(ТекущийКонтекст, Истина);
КонецФункции

Функция КонтекстОбработкиРазыменованийПараметровВиртуальнойТаблицы(ТекущийКонтекст, ИдентификаторИсточника) Экспорт
	Возврат ОбработкаМоделиЗапроса.КонтекстОбработкиПараметровВиртуальнойТаблицы(ТекущийКонтекст, ИдентификаторИсточника);
КонецФункции

Процедура ДополнитьТекущийКонтекст(Контекст, Оператор)
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Контекст.ИсточникиПоИдентификаторам.Вставить(Источник.ИдентификаторИсточника, Источник);
		Контекст.ИспользуемыеТаблицы.Вставить(ВРег(Источник.Источник.Псевдоним), Источник);
	КонецЦикла; 
КонецПроцедуры

Процедура ОбработатьРазыменованияВЗапросе(Запрос, ИндексЗапроса, СписокДоступныхВТ = Неопределено, Контекст = Неопределено) Экспорт
	ИндексОператора = 0;
	Для Каждого Оператор Из Запрос.Операторы Цикл
		ОбработатьРазыменованияВОператоре(Оператор, ИндексЗапроса, СписокДоступныхВТ);				
		ИндексОператора = ИндексОператора +  1;
	КонецЦикла;	
		
	Если ЗначениеЗаполнено(Запрос.Порядок) Тогда
		Контекст = КонтекстОбработкиРазыменований(Запрос.Операторы[00], ИндексЗапроса, СписокДоступныхВТ);
		Обработчик = Обработки.ОбработчикРазыменованийДляСКДПосетитель.СоздатьОбработчик(Контекст);
		Для Каждого ЭлементПорядка Из Запрос.Порядок Цикл
			Если ЭлементПорядка.Тип = "СсылкаНаКолонкуЗапроса" Тогда
				Продолжить;
			КонецЕсли;
			
			ОбработатьРазыменованиеВВыражении(ЭлементПорядка, Обработчик);
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры	  

Процедура ОбработатьРазыменованияВОператоре(Оператор, ИндексЗапроса, СписокДоступныхВТ = Неопределено, Контекст = Неопределено)
	Если Контекст = Неопределено Тогда
		Контекст = КонтекстОбработкиРазыменований(Оператор, ИндексЗапроса, СписокДоступныхВТ);
	Иначе
		ДополнитьТекущийКонтекст(Контекст, Оператор);	
	КонецЕсли;
	Обработчик = Обработки.ОбработчикРазыменованийДляСКДПосетитель.СоздатьОбработчик(Контекст);
	
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхТаблица" Тогда	
			ОбработатьРазыменованиеВПараметрахВиртуальнойТаблицы(Источник, Контекст);
		ИначеЕсли Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда  
			ВложенныйКонтекс = КонтекстОбработкиРазыменованийВложенногоЗапроса(Контекст);
			ОбработатьРазыменованияВЗапросе(Источник.Источник.ЗапросВыбора, -1, , ВложенныйКонтекс);
		КонецЕсли;
		Для Каждого Соединение Из Источник.Соединения Цикл
			ОбработатьРазыменованиеВВыражении(Соединение.Условие, Обработчик);	
		КонецЦикла;	
	КонецЦикла;
	
	Для Каждого Поле Из Оператор.ВыбираемыеПоля Цикл 
		ОбработатьРазыменованиеВВыражении(Поле.Выражение, Обработчик);	
	КонецЦикла;
	
	Для Каждого ЭлементГруппировки Из Оператор.Группировка.Элементы Цикл
		ОбработатьРазыменованиеВВыражении(ЭлементГруппировки, Обработчик);	
	КонецЦикла;	
	
	Для Каждого ВыражениеУсловие Из Оператор.Отбор Цикл
		ОбработатьРазыменованиеВПараметрахВиртуальнойТаблицы(ВыражениеУсловие, Обработчик);	
	КонецЦикла;
	
	Для Каждого ВыражениеУсловие Из Оператор.ОтборСгруппированных Цикл
		ОбработатьРазыменованиеВПараметрахВиртуальнойТаблицы(ВыражениеУсловие, Обработчик);	
	КонецЦикла;
КонецПроцедуры

Процедура ОбработатьРазыменованиеВПараметрахВиртуальнойТаблицы(Источник, Контекст)
	Если Не ЗначениеЗаполнено(Источник.Источник.Параметры) Тогда
		Возврат;
	КонецЕсли;
	
	КонтекстОбработкиПараметров = КонтекстОбработкиРазыменованийПараметровВиртуальнойТаблицы(
		Контекст, 
		Источник.ИдентификаторИсточника);
		
	Обработчик = Обработки.ОбработчикРазыменованийДляСКДПосетитель.СоздатьОбработчик(КонтекстОбработкиПараметров);
	
	ЭтоТаблицаОборотовРегистраНакопления = СтрНачинаетсяС(ВРег(Источник.Источник.ИмяТаблицы), ВРег("РегистрНакопления."))
		И СтрЗаканчиваетсяНа(ВРег(Источник.Источник.ИмяТаблицы), ВРег(".Обороты"));
	
	Для Индекс = 0 По Источник.Источник.Параметры.ВГраница() Цикл
		ВыражениеПараметра = Источник.Источник.Параметры[Индекс];
		// TODO нужна полноценная валидация параметров в зависимости от типа таблицы
		Если Индекс <> 2 Или Не ЭтоТаблицаОборотовРегистраНакопления Тогда
			ОбработатьРазыменованиеВВыражении(ВыражениеПараметра, Обработчик);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработатьРазыменованиеВВыражении(Выражение, Обработчик)
	ОбходМоделиЯзыкаВыражений.ОбойтиДерево(Выражение.Значение, Обработчик);	
КонецПроцедуры

Процедура ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(МодельЗапроса, ИндексЗапроса, Контекст)
	
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	Для ИндексОператора = 0 По МодельТекущегоЗапроса.Операторы.ВГраница() Цикл
		ЗаменитьИсполняемыеПредставленияВМоделиОператора(
			МодельЗапроса, 
			ИндексЗапроса, 
			ИндексОператора,
			Контекст);
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемыеПредставленияВМоделиОператора(МодельЗапроса, ИндексЗапроса, ИндексОператора, Контекст)
	
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	ИспользуемыеПоляИсточников = МодельЗапросаУтилиты.ИспользуемыеПоляИсточников(
		МодельТекущегоЗапроса,
		ИндексОператора);
		
	Для Каждого Источник Из МодельТекущегоЗапроса.Операторы[ИндексОператора].Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(
				Источник.Источник.ЗапросВыбора, 
				-1,
				Контекст);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			ЗаменитьИсполняемоеПредставлениеНаВТ(
				МодельЗапроса, 
				Источник, 
				ИндексЗапроса, 
				ИндексОператора,
				Контекст,
				ИспользуемыеПоляИсточников);	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемоеПредставлениеНаВТ(МодельЗапроса, Источник, ИндексЗапроса, 
	ИндексОператора, Контекст, ИспользуемыеПоля)
	
	ОписаниеФильтра = Неопределено;
	Если Источник.Источник.ВТФильтр <> Неопределено Тогда
		ОписаниеФильтра = МодельЗапросаУтилиты.СкопироватьЭлементМоделиЗапроса(Источник.Источник.ВТФильтр);
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(
			Источник.Источник.ВТФильтр.ЗапросВыбора, 
			-1,
			Контекст);	
	КонецЕсли;
	
	ИспользуемыеПоляПредставления = ИспользуемыеПоля.Получить(Источник.ИдентификаторИсточника);
	Если ИспользуемыеПоляПредставления = Неопределено Тогда
		ИспользуемыеПоляПредставления = Новый Соответствие();
	КонецЕсли;
	
	Псевдоним = Источник.Источник.Псевдоним;
	ОписаниеВТ = ОписаниеВТДляЗамены(
		Источник.Источник.ИмяТаблицы, 
		Контекст.СчетчикИсполняемыхПредставлений,
		ИспользуемыеПоляПредставления);
	ОписаниеВТ.Имя = Псевдоним;
	
	Контекст.ИспользуемыеПоляПредставлений.Вставить(Псевдоним, ИспользуемыеПоляПредставления);
	Контекст.ИменаПредставленийПоИменамВТ.Вставить(ОписаниеВТ.Имя, Источник.Источник.ИмяТаблицы);
	
	Источник.Источник = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица();
	Источник.Источник.ИмяТаблицы = Псевдоним;
	Источник.Источник.Псевдоним = Псевдоним;
	Источник.Источник.ОписаниеВТ = ОписаниеВТ;
	
	Если ОписаниеФильтра <>  Неопределено Тогда
		Построитель = МодельЗапросаУтилиты.СоздатьПостроительМодели(
			МодельЗапроса, 
			ИндексЗапроса, 
			ИндексОператора);
		
		ПсевдонимТаблицыФильтра = Псевдоним + "_Фильтр";		
		Построитель.ДобавитьВложенныйЗапрос(ОписаниеФильтра.ЗапросВыбора, ПсевдонимТаблицыФильтра);
		
		Построитель.ДобавитьСоединение(ПсевдонимТаблицыФильтра, Источник.Источник.Псевдоним, "Левое");
		ЧастиУсловия = Новый Массив();
		ИндексПоля = 0;
		Для Каждого Поле Из ОписаниеФильтра.Поля Цикл
			ЧастиУсловия.Добавить(Источник.Источник.Псевдоним + "." + Поле + "=" 
				+ ПсевдонимТаблицыФильтра + "." + ОписаниеФильтра.ЗапросВыбора.Колонки[ИндексПоля].Имя);
			ИндексПоля = ИндексПоля + 1;
		КонецЦикла;
		Построитель.УстановитьУсловиеСоединения(
			ПсевдонимТаблицыФильтра, 
			Источник.Источник.Псевдоним, 
			СтрСоединить(ЧастиУсловия, " И "));	
			
		МодельЗапроса = Построитель.ПолучитьМодель();
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеВТДляЗамены(ИмяТаблицыПредставления, СчетчикИсполняемыхПредставлений, ИспользуемыеПоляПредставления)
	Если СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления) = Неопределено Тогда
		Номер = 0;
	Иначе
		Номер = СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления);
	КонецЕсли;
	
	Номер = Номер + 1;
	СчетчикИсполняемыхПредставлений.Вставить(ИмяТаблицыПредставления, Номер);
	
	ИмяВТ =  СтрЗаменить(ИмяТаблицыПредставления, ".", "_") + "_" + Формат(Номер, "ЧГ=;");
	ОписаниеПредставления = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениТаблицы(ИмяТаблицыПредставления);
	
	ОписаниеВТ = ЭлементыМоделиЗапроса.НовыйОписаниеВременнойТаблицы();
	ОписаниеВТ.Имя = ИмяВТ;
	ОписаниеВТ.СозданаВЭтомПакете = Ложь;
	
	Для Каждого Поле Из ОписаниеПредставления.Поля Цикл
		Если ИспользуемыеПоляПредставления.Получить(ВРег(Поле.Имя)) <> Неопределено Тогда
			ОписаниеВТ.Колонки.Вставить(ВРег(Поле.Имя), Поле.ТипЗначения);
			ОписаниеВТ.ПорядокКолонок.Добавить(Поле.Имя);
		КонецЕсли;
	КонецЦикла;
	
	Если ОписаниеПредставления.ОписаниеВТФильтр <> Неопределено Тогда
		Для Каждого ПолеФильтра Из ОписаниеПредставления.ОписаниеВТФильтр.ПоляФильтра Цикл
			Если ОписаниеВТ.Колонки.Получить(ВРег(ПолеФильтра.Имя)) = Неопределено Тогда
				Если ПолеФильтра.ТипЗначения = Неопределено Тогда
					ОписаниеВТ.Колонки.Вставить(
						ВРег(ПолеФильтра.Имя), 
						МодельЗапросаТипы.ПроизвольныйТип());
				Иначе
					ОписаниеВТ.Колонки.Вставить(ВРег(ПолеФильтра.Имя), ПолеФильтра.ТипЗначения);
				КонецЕсли;
				ОписаниеВТ.ПорядокКолонок.Добавить(ПолеФильтра.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ОписаниеВТ;
КонецФункции

Процедура ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Запрос, ИсполняемыеПредставления, ИменаВТКУдалению)
	Для Каждого Оператор Из Запрос.Операторы Цикл
		ЗаменитьВТИсполняемымиПредставленямиВОператоре(Оператор, ИсполняемыеПредставления, ИменаВТКУдалению);	
	КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьВТИсполняемымиПредставленямиВОператоре(Оператор, ИсполняемыеПредставления, ИменаВТКУдалению)
	ИсточникиПоИдентификаторам = МодельЗапросаУтилиты.ИсточникиОператораПоИдентификаторма(Оператор);
	УдаляемыеИсточники = Новый Массив;
	ИсточникиВременныеТаблицы = Новый Массив();
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаменитьВТИсполняемымиПредставленямиВЗапросе(Источник.Источник.ЗапросВыбора, ИсполняемыеПредставления, ИменаВТКУдалению);
		ИначеЕсли Источник.Источник.Тип = "ИсточникДанныхВременнаяТаблица" Тогда 	
			ИсточникиВременныеТаблицы.Добавить(Источник);
		КонецЕсли;
	КонецЦикла;	
	
	Для Каждого Источник Из ИсточникиВременныеТаблицы Цикл
		ЗаменитьВТИсполняемымПредставлением(
			Источник, 
			ИсполняемыеПредставления, 
			ИсточникиПоИдентификаторам,
			УдаляемыеИсточники,
			ИменаВТКУдалению);	
	КонецЦикла;
	
	Для Каждого Источник Из УдаляемыеИсточники Цикл
		Оператор.Источники.Элементы.Удалить(Оператор.Источники.Элементы.Найти(Источник));
	КонецЦикла;
КонецПроцедуры

Процедура ЗаменитьВТИсполняемымПредставлением(Источник, ИсполняемыеПредставления, ИсточникиПоИдентификаторам, 
	УдаляемыеИсточники, ИменаВТКУдалению)
	
	ИсполняемоеПредставление = ИсполняемыеПредставления.Получить(Источник.Источник.Псевдоним);
	Если ИсполняемоеПредставление = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИменаВТКУдалению.Вставить(Источник.Источник.ИмяТаблицы, Истина);
	Если ИсполняемоеПредставление.ВТФильтр <> Неопределено Тогда
		ЗаменитьПрисоединяемыйЗапросНаВТФильтр(
			ИсполняемоеПредставление,
			Источник, 
			Источник.Источник.Псевдоним,
			ИсточникиПоИдентификаторам,
			УдаляемыеИсточники,
			ИменаВТКУдалению);	
	КонецЕсли;
	
	Источник.Источник = ИсполняемоеПредставление;
КонецПроцедуры

Процедура ЗаменитьПрисоединяемыйЗапросНаВТФильтр(ИсполняемоеПредставление, Источник, Псевдоним, 
	ИсточникиПоИдентификаторам, УдаляемыеИсточники, ИменаВТКУдалению)
	
	Индекс = 0;
	Для Каждого Соединение Из Источник.Соединения Цикл
		ПрисоединясыйИсточник = ИсточникиПоИдентификаторам[Соединение.Источник];
		Если ПрисоединясыйИсточник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос"
			И Источник.Источник.Псевдоним + "_Фильтр" = ПрисоединясыйИсточник.Источник.Псевдоним Тогда
				
			ИсполняемоеПредставление.ВТФильтр = ЭлементыМоделиЗапроса.НовыйПараметрИсполняемогоПредставленияВТФильтр();
			ИсполняемоеПредставление.ВТФильтр.ЗапросВыбора = ПрисоединясыйИсточник.Источник.ЗапросВыбора;
			
			Условия = МодельЗапросаУтилиты.УсловиеВМассивВыраженийПоИ(Соединение.Условие.Значение);
			Для Каждого Условие Из Условия Цикл
				ИсполняемоеПредставление.ВТФильтр.Поля.Добавить(Условие.ЛеваяЧасть.Элементы[0].ИмяПоля);			
			КонецЦикла;	
			
			Источник.Соединения.Удалить(Индекс);
			УдаляемыеИсточники.Добавить(ПрисоединясыйИсточник);
			
			Возврат;
		КонецЕсли;
		Индекс = Индекс + 1;
	КонецЦикла;	
КонецПроцедуры

Процедура УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Запрос, Счетчик) 
	Для Каждого Оператор Из Запрос.Операторы Цикл
		УстановитьПрефиксыПсевдонимамПредставленийВОператоре(Оператор, Счетчик);
	КонецЦикла;
КонецПроцедуры

Процедура УстановитьПрефиксыПсевдонимамПредставленийВОператоре(Оператор, Счетчик) 
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Источник.Источник.ЗапросВыбора, Счетчик);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			Если Источник.Источник.ВТФильтр <> Неопределено Тогда
				УстановитьПрефиксыПсевдонимамПредставленийВЗапросе(Источник.Источник.ВТФильтр.ЗапросВыбора, Счетчик);
			КонецЕсли;	
			Источник.Источник.Псевдоним = НовыйПсевдонимИсполняемогоПредтсавления(Источник.Источник.Псевдоним, Счетчик);
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаполнитьИсполняемыеПредставленияИзЗапроса(Запрос, ИсполняемыеПредставления) 
	Для Каждого Оператор Из Запрос.Операторы Цикл
		ЗаполнитьИсполняемыеПредставленияИзОператора(Оператор, ИсполняемыеПредставления);
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьИсполняемыеПредставленияИзОператора(Оператор, ИсполняемыеПредставления) 
	Для Каждого Источник Из Оператор.Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаполнитьИсполняемыеПредставленияИзЗапроса(Источник.Источник.ЗапросВыбора, ИсполняемыеПредставления);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			Если Источник.Источник.ВТФильтр <> Неопределено Тогда
				ЗаполнитьИсполняемыеПредставленияИзЗапроса(Источник.Источник.ВТФильтр.ЗапросВыбора, ИсполняемыеПредставления);
			КонецЕсли;	
			ИсполняемыеПредставления.Вставить(Источник.Источник.Псевдоним, Источник.Источник)
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Функция НовыйПсевдонимИсполняемогоПредтсавления(ТекущийПсевдоним, Счетчик)
	Номер = Счетчик.Получить(ТекущийПсевдоним);
	Если Номер = Неопределено Тогда
		Номер = 0;
	КонецЕсли;
	
	Номер = Номер + 1;
	Счетчик.Вставить(ТекущийПсевдоним, Номер);
	
	Возврат ТекущийПсевдоним + Формат(Номер, "ЧГ=;");
КонецФункции

Процедура ДобавитьДекларациюВТВПакет(МодельЗапроса, ИмяТаблицыПредставления, ИмяВТ, ИспользуемыеПоля)
	ОписаниеПредставления = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениТаблицы(ИмяТаблицыПредставления);
	Построитель = МодельЗапросаУтилиты.СоздатьПостроительМодели(МодельЗапроса);
	
	Построитель.ВставитьЗапросВыбора(0);
	
	Для Каждого Поле Из ОписаниеПредставления.Поля Цикл
		Если ИспользуемыеПоля.Получить(ВРег(Поле.Имя)) <> Неопределено Тогда
			ГенерацияИсполняемогоКодаПредставленийУтилиты.ДобавитьПустоеПолеВЗапрос(
				Построитель, 
				Поле.Имя, 
				Поле.ТипЗначения.Типы());
		КонецЕсли;
	КонецЦикла;
	Построитель.УстановитьИмяВременнойТаблицы(ИмяВТ);
	
	ТипыСтрока = Новый Массив();
	ТипыСтрока.Добавить(Тип("Строка"));
	Если ОписаниеПредставления.ОписаниеВТФильтр <> Неопределено Тогда
		Для Каждого Поле Из ОписаниеПредставления.ОписаниеВТФильтр.ПоляФильтра Цикл
			Если ИспользуемыеПоля.Получить(ВРег(Поле.Имя)) = Неопределено Тогда
				ГенерацияИсполняемогоКодаПредставленийУтилиты.ДобавитьПустоеПолеВЗапрос(
					Построитель, 
					Поле.Имя, 
					ТипыСтрока);
			КонецЕсли;	
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры


Функция КонтекстЗаменыИсполняемыхПредставлений()
	Контекст = Новый Структура();
	Контекст.Вставить("ИменаПредставленийПоИменамВТ", Новый Соответствие());
	Контекст.Вставить("ИспользуемыеПоляПредставлений", Новый Соответствие());
	Контекст.Вставить("СчетчикИсполняемыхПредставлений", Новый Соответствие());
	
	Возврат Контекст;
КонецФункции


#КонецОбласти