#Область СлужебныеПроцедурыИФункции

Функция ЗаменитьИсполняемыеПредставленияВременнымиТаблицами(МодельЗапроса) Экспорт
//	Модель = ОбработкаМоделиЗапроса.РазобратьЗапрос(ТекстЗапроса);
	
	СчетчикИсполняемыхПредставлений = Новый Соответствие();
	ИндексЗапроса = 0;
	Для ИндексЗапроса = 0 По МодельЗапроса.Элементы.ВГраница() Цикл
		Если МодельЗапроса.Элементы[ИндексЗапроса].Тип = "ЗапросУничтожения" Тогда
			Продолжить;
		КонецЕсли;
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса);
	КонецЦикла;
	
	Возврат ГенерацияТекстовЗапросов.ТекстПакетаЗапросов(МодельЗапроса);
КонецФункции

Процедура ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса)
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	Для ИндексОператора = 0 По МодельТекущегоЗапроса.Операторы.ВГраница() Цикл
		ЗаменитьИсполняемыеПредставленияВМоделиОператора(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора);
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемыеПредставленияВМоделиОператора(МодельЗапроса, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора)
	Если ИндексЗапроса = -1 Тогда
		МодельТекущегоЗапроса = МодельЗапроса;
	Иначе
		МодельТекущегоЗапроса = МодельЗапроса.Элементы[ИндексЗапроса];
	КонецЕсли;
	
	Для Каждого Источник Из МодельТекущегоЗапроса.Операторы[ИндексОператора].Источники.Элементы Цикл
		Если Источник.Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
			ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(Источник.Источник.ЗапросВыбора, СчетчикИсполняемыхПредставлений, -1);
		ИначеЕсли Источник.Источник.Тип = "ИсполняемоеПредставление" Тогда 	
			ЗаменитьИсполняемоеПредставлениеНаВТ(МодельЗапроса, Источник, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора);	
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры

Процедура ЗаменитьИсполняемоеПредставлениеНаВТ(МодельЗапроса, Источник, СчетчикИсполняемыхПредставлений, ИндексЗапроса, ИндексОператора)
	ОписаниеФильтра = Неопределено;
	Если Источник.Источник.ВТФильтр <> Неопределено Тогда
		ОписаниеФильтра = МодельЗапросаУтилиты.СкопироватьЭлементМоделиЗапроса(Источник.Источник.ВТФильтр);
		ЗаменитьИсполняемыеПредставленияВМоделиЗапроса(
			Источник.Источник.ВТФильтр.ЗапросВыбора, 
			СчетчикИсполняемыхПредставлений, 
			-1);	
	КонецЕсли;
	
	ОписаниеВТ = ОписаниеВТДляЗамены(Источник.Источник.ИмяТаблицы, СчетчикИсполняемыхПредставлений);
	
	Псевдоним = Источник.Источник.Псевдоним;
	Источник.Источник = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица();
	Источник.Источник.ИмяТаблицы = ОписаниеВТ.Имя;
	Источник.Источник.Псевдоним = Псевдоним;
	Источник.Источник.ОписаниеВТ = ОписаниеВТ;
	
	Если ОписаниеФильтра <>  Неопределено Тогда
		Построитель = МодельЗапросаУтилиты.СоздатьПостроительМодели(
			МодельЗапроса, 
			ИндексЗапроса, 
			ИндексОператора);
		
		ПсевдонимТаблицыФильтра = ОписаниеВТ.Имя + "_Фильтр";		
		Построитель.ДобавитьВложенныйЗапрос(ОписаниеФильтра.ЗапросВыбора, ПсевдонимТаблицыФильтра);
		
		Построитель.ДобавитьСоединение(ПсевдонимТаблицыФильтра, Источник.Источник.Псевдоним, "Левое");
		ЧастиУсловия = Новый Массив();
		ИндексПоля = 0;
		Для Каждого Поле Из ОписаниеФильтра.Поля Цикл
			ЧастиУсловия.Добавить(Источник.Источник.Псевдоним + "." + Поле + "=" 
				+ ПсевдонимТаблицыФильтра + "." + ОписаниеФильтра.ЗапросВыбора.Колонки[ИндексПоля].Имя);
			ИндексПоля = ИндексПоля + 1;
		КонецЦикла;
		Построитель.УстановитьУсловиеСоединения(
			ПсевдонимТаблицыФильтра, 
			Источник.Источник.Псевдоним, 
			СтрСоединить(ЧастиУсловия, " И "));	
			
		МодельЗапроса = Построитель.ПолучитьМодель();
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеВТДляЗамены(ИмяТаблицыПредставления, СчетчикИсполняемыхПредставлений)
	Если СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления) = Неопределено Тогда
		Номер = 0;
	Иначе
		Номер = СчетчикИсполняемыхПредставлений.Получить(ИмяТаблицыПредставления);
	КонецЕсли;
	
	Номер = Номер + 1;
	СчетчикИсполняемыхПредставлений.Вставить(ИмяТаблицыПредставления, Номер);
	
	ИмяВТ =  СтрЗаменить(ИмяТаблицыПредставления, ".", "_") + "_" + Формат(Номер, "ЧГ=;");
	ОписаниеПредставления = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениТаблицы(ИмяТаблицыПредставления);
	
	ОписаниеВТ = ЭлементыМоделиЗапроса.НовыйОписаниеВременнойТаблицы();
	ОписаниеВТ.Имя = ИмяВТ;
	ОписаниеВТ.СозданаВЭтомПакете = Ложь;
	
	Для Каждого Поле Из ОписаниеПредставления.Поля Цикл
		ОписаниеВТ.Колонки.Вставить(ВРег(Поле.Имя), Поле.ТипЗначения);
		ОписаниеВТ.ПорядокКолонок.Добавить(Поле.Имя);
	КонецЦикла;
	
	Если ОписаниеПредставления.ОписаниеВТФильтр <> Неопределено Тогда
		Для Каждого ПолеФильтра Из ОписаниеПредставления.ОписаниеВТФильтр.ПоляФильтра Цикл
			Если ОписаниеВТ.Колонки.Получить(ВРег(ПолеФильтра.Имя)) = Неопределено Тогда
				Если ПолеФильтра.ТипЗначения = Неопределено Тогда
					ОписаниеВТ.Колонки.Вставить(
						ВРег(ПолеФильтра.Имя), 
						МодельЗапросаТипы.ПроизвольныйТип());
				Иначе
					ОписаниеВТ.Колонки.Вставить(ВРег(ПолеФильтра.Имя), ПолеФильтра.ТипЗначения);
				КонецЕсли;
				ОписаниеВТ.ПорядокКолонок.Добавить(ПолеФильтра.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Возврат ОписаниеВТ;
КонецФункции


#КонецОбласти