#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Разобрать(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);
	УстановитьБуферТокенов();
	Возврат РезультатРазбора();
КонецФункции

Функция РазобратьВыражение(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);
	УстановитьБуферТокенов();
	Возврат РезультатРазбораВыражения();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Инициализировать();
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентификатор");
КонецПроцедуры

Функция НовыйБуферТокенов()
	Буфер = Новый Структура("ИндексТекущегоЭлемента, Токены");
	Буфер.ИндексТекущегоЭлемента = -1;
	Буфер.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	Возврат Буфер;
КонецФункции

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();
КонецПроцедуры

Процедура ЗаполнитьБуферТокенов()
	МаксимальныйИндекс = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для Индекс = Сдвиг По МаксимальныйИндекс Цикл
			БуферТокенов.Токены[Индекс - Сдвиг] = БуферТокенов.Токены[Индекс];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КоличествоДочитываемых = МаксимальныйИндекс - БуферТокенов.ИндексТекущегоЭлемента;
	Для Сч = 1 По КоличествоДочитываемых Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();
	КонецЦикла;
КонецПроцедуры

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = -1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		Возврат БуферТокенов.Токены[0];
	КонецЕсли;
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	ЗаполнитьБуферТокенов();
	Возврат Токен;
КонецФункции

Процедура УстановитьТекущийТокен()
	ТекущийТокен = СледующийТокенИзБуфера();
КонецПроцедуры

Функция ТипТокенаПросмотра(Смещение)
	Индекс = БуферТокенов.ИндексТекущегоЭлемента + Смещение;
	Если Индекс < 0 Или Индекс >= БуферТокенов.Токены.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Токен = БуферТокенов.Токены[Индекс];
	Если Токен = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Токен.Тип;
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТипТокенаПросмотра(0) <> ТипТерминала Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипТерминала, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Тип;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Лексема(ТипЛексемы)
	Возврат Терминал(ТипЛексемы);
КонецФункции

Функция Идентификатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентификатор", ТипИдентификатора, ТипТокенаПросмотра(0));
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипИдентификатора, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Лексема;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТипТокенаПросмотра(0) <> ТипКонстанты Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипКонстанты, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Значение;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция РезультатРазбора()
	УстановитьТекущийТокен();
	Результат = НеТерминалПакетЗапросов();
	Если ТипТокенаПросмотра(0) <> Неопределено Тогда
		ВызватьИсключениеСинтаксическаяОшибка("ПакетЗапросов");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатРазбораВыражения()
	УстановитьТекущийТокен();
	Результат = НеТерминалВыражение();
	Если ТипТокенаПросмотра(0) <> Неопределено Тогда
		ВызватьИсключениеСинтаксическаяОшибка("Выражение");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ВызватьИсключениеСинтаксическаяОшибка(Ожидаемое, ОжидаетсяКонкретныйТокен = Ложь)
	Если ТекущийТокен = Неопределено Тогда
		Если ОжидаетсяКонкретныйТокен Тогда
			ВызватьИсключение "Синтаксическая ошибка. Ожидается """ + Ожидаемое + """";
		Иначе
			ВызватьИсключение "Синтаксическая ошибка. Ожидается следующий токен";
		КонецЕсли;
	ИначеЕсли ОжидаетсяКонкретныйТокен Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, Ожидаемое);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ТипТокенаПросмотра(0) = Неопределено Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается следующий токен";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола);
		ВызватьИсключение ТекстОшибки;
	Иначе
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Неожиданный токен ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТекущийТокен.Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

Процедура ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(ОжидаемыеТокены)
	Если ТекущийТокен = Неопределено Тогда
		ВызватьИсключение "Синтаксическая ошибка. Ожидается один из токенов: " + ОжидаемыеТокены;
	КонецЕсли;

	ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается один из токенов: %3";
	ТекстОшибки = СтрШаблон(
		ШаблонОшибки,
		ТекущийТокен.НомерСтроки,
		ТекущийТокен.НомерСимвола,
		ОжидаемыеТокены);
	ВызватьИсключение ТекстОшибки;
КонецПроцедуры

Функция НеТерминалПакетЗапросов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПакетЗапросов(ТекущийТокен);
	Значение1 = НеТерминалЗапросПакета();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = Неопределено Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = ";" Тогда
			ТокенРешения1 = ТипТокенаПросмотра(1);
			Если ТокенРешения1 = Неопределено Тогда
				Прервать;
			ИначеЕсли (ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "УНИЧТОЖИТЬ") Тогда
				Лексема(";");
				Значение2 = НеТерминалЗапросПакета();
				ЭтотУзел.Элементы.Добавить(Значение2);
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("конец ввода, ""ВЫБРАТЬ"", ""УНИЧТОЖИТЬ""");
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("конец ввода, "";""");
		КонецЕсли;
	КонецЦикла;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = Неопределено Тогда
	ИначеЕсли ТокенРешения0 = ";" Тогда
		Лексема(";");
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("конец ввода, "";""");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросПакета()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ВЫБРАТЬ" Тогда
		Значение1 = НеТерминалЗапросВыбора();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "УНИЧТОЖИТЬ" Тогда
		Значение2 = НеТерминалЗапросУничтожения();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ВЫБРАТЬ"", ""УНИЧТОЖИТЬ""");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросУничтожения()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросУничтожения(ТекущийТокен);
	Терминал("УНИЧТОЖИТЬ");
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросВыбора()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросВыбора(ТекущийТокен);
	Значение1 = НеТерминалОбъединяемыйЗапрос();
	ЭтотУзел.Операторы.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "ОБЪЕДИНИТЬ" Тогда
			Значение2 = НеТерминалОператорОбъединения();
			ЭтотУзел.Операторы.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ЗапросВыбора");
		КонецЕсли;
	КонецЦикла;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ") Тогда
	ИначеЕсли ТокенРешения0 = "УПОРЯДОЧИТЬ" Тогда
		Терминал("УПОРЯДОЧИТЬ");
		Терминал("ПО");
		Значение3 = НеТерминалСписокЭлементовУпорядочивания();
		ЭтотУзел.Порядок = Значение3;
		Значение4 = НеТерминалРасширениеСКД();
		Если Значение4 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение4 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЗапросВыбора");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИТОГИ") Тогда
	ИначеЕсли ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Тогда
		Терминал("ИНДЕКСИРОВАТЬ");
		Терминал("ПО");
		Значение5 = НеТерминалСписокВыражений();
		ЭтотУзел.Индекс = Значение5;
		Значение6 = НеТерминалРасширениеСКД();
		Если Значение6 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение6 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЗапросВыбора");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ") Тогда
	ИначеЕсли ТокенРешения0 = "ИТОГИ" Тогда
		Терминал("ИТОГИ");
		Значение7 = НеТерминалПоляИтогов();
		ЭтотУзел.ВыраженияИтогов = Значение7;
		Терминал("ПО");
		Значение8 = НеТерминалКонтрольныеТочкиИтогов();
		ЭтотУзел.КонтрольныеТочкиИтогов = Значение8;
		Значение9 = НеТерминалРасширениеСКД();
		Если Значение9 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение9 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЗапросВыбора");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";") Тогда
	ИначеЕсли ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Тогда
		Терминал("АВТОУПОРЯДОЧИВАНИЕ");
		ЭтотУзел.Автопорядок = Истина;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЗапросВыбора");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОбъединяемыйЗапрос()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорЗапроса(ТекущийТокен);
	Терминал("ВЫБРАТЬ");
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
	ИначеЕсли ТокенРешения0 = "ПЕРВЫЕ" Тогда
		Терминал("ПЕРВЫЕ");
		Значение1 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение1;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.ВыбиратьРазличные = Истина;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "РАЗРЕШЕННЫЕ" Тогда
				Терминал("РАЗРЕШЕННЫЕ");
				ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		ИначеЕсли ТокенРешения0 = "РАЗРЕШЕННЫЕ" Тогда
			Терминал("РАЗРЕШЕННЫЕ");
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
				Терминал("РАЗЛИЧНЫЕ");
				ЭтотУзел.ВыбиратьРазличные = Истина;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
		КонецЕсли;
	ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
		Терминал("РАЗЛИЧНЫЕ");
		ЭтотУзел.ВыбиратьРазличные = Истина;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ИначеЕсли ТокенРешения0 = "ПЕРВЫЕ" Тогда
			Терминал("ПЕРВЫЕ");
			Значение2 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение2;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "РАЗРЕШЕННЫЕ" Тогда
				Терминал("РАЗРЕШЕННЫЕ");
				ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		ИначеЕсли ТокенРешения0 = "РАЗРЕШЕННЫЕ" Тогда
			Терминал("РАЗРЕШЕННЫЕ");
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "ПЕРВЫЕ" Тогда
				Терминал("ПЕРВЫЕ");
				Значение3 = Константа("ЧисловаяКонстанта");
				ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение3;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
		КонецЕсли;
	ИначеЕсли ТокенРешения0 = "РАЗРЕШЕННЫЕ" Тогда
		Терминал("РАЗРЕШЕННЫЕ");
		ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ИначеЕсли ТокенРешения0 = "ПЕРВЫЕ" Тогда
			Терминал("ПЕРВЫЕ");
			Значение4 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение4;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
				Терминал("РАЗЛИЧНЫЕ");
				ЭтотУзел.ВыбиратьРазличные = Истина;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.ВыбиратьРазличные = Истина;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "{" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			ИначеЕсли ТокенРешения0 = "ПЕРВЫЕ" Тогда
				Терминал("ПЕРВЫЕ");
				Значение5 = Константа("ЧисловаяКонстанта");
				ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение5;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	Значение6 = НеТерминалРасширениеСКД();
	Если Значение6 <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из Значение6 Цикл
			ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
		КонецЦикла;
	КонецЕсли;
	Значение7 = НеТерминалПолеВыборки();
	ЭтотУзел.ВыбираемыеПоля.Добавить(Значение7);
	Значение8 = НеТерминалРасширениеСКД();
	Если Значение8 <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из Значение8 Цикл
			ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
		КонецЦикла;
	КонецЕсли;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение9 = НеТерминалПолеВыборки();
			ЭтотУзел.ВыбираемыеПоля.Добавить(Значение9);
			Значение10 = НеТерминалРасширениеСКД();
			Если Значение10 <> Неопределено Тогда
				Для Каждого ЭлементКоллекции Из Значение10 Цикл
					ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
				КонецЦикла;
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
		КонецЕсли;
	КонецЦикла;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли ТокенРешения0 = "ПОМЕСТИТЬ" Тогда
		Терминал("ПОМЕСТИТЬ");
		Значение11 = Идентификатор("ID_ИмяТаблицы");
		ЭтотУзел.__ТаблицаДляПомещения = Значение11;
		Значение12 = НеТерминалРасширениеСКД();
		Если Значение12 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение12 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли ТокенРешения0 = "ИЗ" Тогда
		Терминал("ИЗ");
		Значение13 = НеТерминалБлокИз();
		ЭтотУзел.Источники = Значение13;
		Значение14 = НеТерминалРасширениеСКД();
		Если Значение14 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение14 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли ТокенРешения0 = "ГДЕ" Тогда
		Терминал("ГДЕ");
		Значение15 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Отбор = Значение15;
		Значение16 = НеТерминалРасширениеСКД();
		Если Значение16 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение16 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли ТокенРешения0 = "СГРУППИРОВАТЬ" Тогда
		Терминал("СГРУППИРОВАТЬ");
		Терминал("ПО");
		Значение17 = НеТерминалСписокВыраженийМодели();
		ЭтотУзел.Группировка = Значение17;
		Значение18 = НеТерминалРасширениеСКД();
		Если Значение18 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение18 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли ТокенРешения0 = "ИМЕЮЩИЕ" Тогда
		Терминал("ИМЕЮЩИЕ");
		Значение19 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.ОтборСгруппированных = Значение19;
		Значение20 = НеТерминалРасширениеСКД();
		Если Значение20 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение20 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОбъединяемыйЗапрос");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОператорОбъединения()
	РезультатПродукции = Неопределено;
	Терминал("ОБЪЕДИНИТЬ");
	Значение1 = НеТерминалТипОбъединенияЗапроса();
	Значение2 = НеТерминалОбъединяемыйЗапрос();
	Значение2.ТипОбъединения = Значение1;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипОбъединенияЗапроса()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ВСЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединениеВсе(ТекущийТокен);
		Терминал("ВСЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ВЫБРАТЬ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединение(ТекущийТокен);
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ВСЕ"", ""ВЫБРАТЬ""");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляВыборки()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
	Значение1 = НеТерминалПолеВыборки();
	ЭтотУзел.Добавить(Значение1);
	НеТерминалРасширениеСКД();
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = ")" Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалПолеВыборки();
			ЭтотУзел.Добавить(Значение2);
			НеТерминалРасширениеСКД();
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПолеВыборки()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Выражение = Значение1;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
		ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Значение2 = НеТерминалПсевдоним();
			ЭтотУзел.Псевдоним = Значение2;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ПолеВыборки");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "*" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		Значение3 = НеТерминалВыражениеВсеПоляВыборки();
		ЭтотУзел.Выражение = Значение3;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПолеВыборки");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоляВыборки()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалВыражениеВсеПоля();
	ЭтотУзел.Значение = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоля()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоля(ТекущийТокен);
	Лексема("*");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПсевдоним()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "ID" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		Значение1 = Идентификатор("ID_Псевдоним");
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "КАК" Тогда
		Терминал("КАК");
		Значение2 = Идентификатор("ID_ПсевдонимРасширенный");
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Псевдоним");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалБлокИз()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалИсточникДанныхЗапроса();
	ЭтотУзел.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалИсточникДанныхЗапроса();
			ЭтотУзел.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("БлокИз");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхЗапроса()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Значение1 = НеТерминалИсточникДанных();
	ЭтотУзел.Источник = Значение1;
	Значение2 = НеТерминалСписокСоединений();
	ЭтотУзел.Соединения = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокСоединений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокСоединений(ТекущийТокен);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "{" Тогда
			ТокенРешения1 = ТипТокенаПросмотра(1);
			Если (ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПРАВОЕ") Тогда
				Значение1 = НеТерминалПраваяЧастьСоединения();
				ЭтотУзел.Добавить(Значение1);
			ИначеЕсли (ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ") Тогда
				Прервать;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("СписокСоединений");
			КонецЕсли;
		ИначеЕсли (ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ") Тогда
			Значение2 = НеТерминалПраваяЧастьСоединения();
			ЭтотУзел.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("СписокСоединений");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПраваяЧастьСоединения()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "{" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
		ЭтотУзел.Опционально = Истина;
		Лексема("{");
		Значение1 = НеТерминалТипСоединения();
		ЭтотУзел.ТипСоединения = Значение1;
		Терминал("СОЕДИНЕНИЕ");
		Значение2 = НеТерминалИсточникДанныхСоединения();
		ЭтотУзел.Источник = Значение2;
		Терминал("ПО");
		Значение3 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Условие = Значение3;
		Лексема("}");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
		Значение4 = НеТерминалТипСоединения();
		ЭтотУзел.ТипСоединения = Значение4;
		Терминал("СОЕДИНЕНИЕ");
		Значение5 = НеТерминалИсточникДанныхСоединения();
		ЭтотУзел.Источник = Значение5;
		Терминал("ПО");
		Значение6 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Условие = Значение6;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПраваяЧастьСоединения");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхСоединения()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Значение1 = НеТерминалПрисоединяемаяТаблица();
	ЭтотУзел.Источник = Значение1;
	Значение2 = НеТерминалСписокСоединений();
	ЭтотУзел.Соединения = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипСоединения()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ВНУТРЕННЕЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияВнутреннее(ТекущийТокен);
		Терминал("ВНУТРЕННЕЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЛЕВОЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияЛевое(ТекущийТокен);
		Терминал("ЛЕВОЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ПОЛНОЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПолное(ТекущийТокен);
		Терминал("ПОЛНОЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ПРАВОЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПравое(ТекущийТокен);
		Терминал("ПРАВОЕ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ТипСоединения");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанных()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "&" Тогда
		Значение1 = НеТерминалИсточникДанныхТаблицаЗначений();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "(" Тогда
		Значение2 = НеТерминалИсточникДанныхВложенныйЗапрос();
		РезультатПродукции = Значение2;
	ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "ID_СРешеткой" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = ")" Или ТокенРешения1 = "," Или ТокенРешения1 = ";" Или ТокенРешения1 = "ID" Или ТокенРешения1 = "{" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			Значение3 = НеТерминалИсточникДанныхВременнаяТаблица();
			РезультатПродукции = Значение3;
		ИначеЕсли ТокенРешения1 = "." Тогда
			Значение4 = НеТерминалИсточникДанныхТаблица();
			РезультатПродукции = Значение4;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанных");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанных");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПрисоединяемаяТаблица()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "(" Тогда
		Значение1 = НеТерминалИсточникДанныхВложенныйЗапрос();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "ID_СРешеткой" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если ТокенРешения1 = "." Тогда
			Значение2 = НеТерминалИсточникДанныхТаблица();
			РезультатПродукции = Значение2;
		ИначеЕсли (ТокенРешения1 = "ID" Или ТокенРешения1 = "{" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			Значение3 = НеТерминалИсточникДанныхВременнаяТаблица();
			РезультатПродукции = Значение3;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ПрисоединяемаяТаблица");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПрисоединяемаяТаблица");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхТаблицаЗначений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблицаЗначений(ТекущийТокен);
	Лексема("&");
	Значение1 = Идентификатор("ID_Полный");
	ЭтотУзел.ИмяТаблицы = Значение1;
	Значение2 = НеТерминалПсевдоним();
	ЭтотУзел.Псевдоним = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхВременнаяТаблица()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица(ТекущийТокен);
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = Значение1;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		Значение2 = НеТерминалПсевдоним();
		ЭтотУзел.Псевдоним = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанныхВременнаяТаблица");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхТаблица()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблица(ТекущийТокен);
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение1;
	Значение2 = Лексема(".");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение2;
	Значение3 = Идентификатор("ID_Полный");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение3;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "(" Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "." Тогда
			Значение4 = Лексема(".");
			ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение4;
			Значение5 = Идентификатор("ID_Полный");
			ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение5;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанныхТаблица");
		КонецЕсли;
	КонецЦикла;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
	ИначеЕсли ТокенРешения0 = "(" Тогда
		Лексема("(");
		Значение6 = НеТерминалСписокПараметров();
		ЭтотУзел.Параметры = Значение6;
		Лексема(")");
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанныхТаблица");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
	ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		Значение7 = НеТерминалПсевдоним();
		ЭтотУзел.Псевдоним = Значение7;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанныхТаблица");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхВложенныйЗапрос()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВложенныйЗапрос(ТекущийТокен);
	Лексема("(");
	Значение1 = НеТерминалЗапросВыбора();
	ЭтотУзел.ЗапросВыбора = Значение1;
	Лексема(")");
	Значение2 = НеТерминалПсевдоним();
	ЭтотУзел.Псевдоним = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокПараметров()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокПараметров(ТекущийТокен);
	Значение1 = НеТерминалПараметрТаблицы();
	ЭтотУзел.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = ")" Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалПараметрТаблицы();
			ЭтотУзел.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПараметрТаблицы()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТокенРешения0 = ")" Или ТокенРешения0 = ",") Тогда
		РезультатПродукции = Неопределено;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПараметрТаблицы");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокЭлементовУпорядочивания()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементыПорядка(ТекущийТокен);
	Значение1 = НеТерминалЭлементУпорядочивания();
	ЭтотУзел.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалЭлементУпорядочивания();
			ЭтотУзел.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("СписокЭлементовУпорядочивания");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЭлементУпорядочивания()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементПорядка(ТекущийТокен);
	Значение1 = НеТерминалВыражениеМоделиЗапроса();
	ЭтотУзел.Выражение = Значение1;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "УБЫВ") Тогда
	ИначеЕсли ТокенРешения0 = "ИЕРАРХИЯ" Тогда
		Терминал("ИЕРАРХИЯ");
		ЭтотУзел.Иерархия = Истина;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЭлементУпорядочивания");
	КонецЕсли;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ") Тогда
	ИначеЕсли (ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "УБЫВ") Тогда
		Значение2 = НеТерминалНаправлениеУпорядочивания();
		ЭтотУзел.Направление = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЭлементУпорядочивания");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалНаправлениеУпорядочивания()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ВОЗР" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеВозрастание(ТекущийТокен);
		Терминал("ВОЗР");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "УБЫВ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеУбывание(ТекущийТокен);
		Терминал("УБЫВ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ВОЗР"", ""УБЫВ""");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляИтогов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыраженияИтогов(ТекущийТокен);
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалПолеВыборки();
		ЭтотУзел.Добавить(Значение1);
		Пока Истина Цикл
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "," Тогда
				Лексема(",");
				Значение2 = НеТерминалПолеВыборки();
				ЭтотУзел.Добавить(Значение2);
				НеТерминалРасширениеСКД();
			ИначеЕсли ТокенРешения0 = "ПО" Тогда
				Прервать;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""","", ""ПО""");
			КонецЕсли;
		КонецЦикла;
	ИначеЕсли ТокенРешения0 = "ПО" Тогда
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПоляИтогов");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонтрольныеТочкиИтогов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольныеТочкиИтогов(ТекущийТокен);
	Значение1 = НеТерминалКонтрольнаяТочкаИтогов();
	ЭтотУзел.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалКонтрольнаяТочкаИтогов();
			ЭтотУзел.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("КонтрольныеТочкиИтогов");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонтрольнаяТочкаИтогов()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольнаяТочкаИтогов(ТекущийТокен);
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Выражение = Значение1;
		Значение2 = НеТерминалТипКонтрольнойТочки();
		ЭтотУзел.ТипКонтрольнойТочки = Значение2;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		ИначеЕсли ТокенРешения0 = "ПЕРИОДАМИ" Тогда
			Терминал("ПЕРИОДАМИ");
			Лексема("(");
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "ГОД" Тогда
				Значение4 = Терминал("ГОД");
				Значение3 = Значение4;
			ИначеЕсли ТокенРешения0 = "ДЕКАДА" Тогда
				Значение5 = Терминал("ДЕКАДА");
				Значение3 = Значение5;
			ИначеЕсли ТокенРешения0 = "ДЕНЬ" Тогда
				Значение6 = Терминал("ДЕНЬ");
				Значение3 = Значение6;
			ИначеЕсли ТокенРешения0 = "МЕСЯЦ" Тогда
				Значение7 = Терминал("МЕСЯЦ");
				Значение3 = Значение7;
			ИначеЕсли ТокенРешения0 = "МИНУТА" Тогда
				Значение8 = Терминал("МИНУТА");
				Значение3 = Значение8;
			ИначеЕсли ТокенРешения0 = "НЕДЕЛЯ" Тогда
				Значение9 = Терминал("НЕДЕЛЯ");
				Значение3 = Значение9;
			ИначеЕсли ТокенРешения0 = "ПОЛУГОДИЕ" Тогда
				Значение10 = Терминал("ПОЛУГОДИЕ");
				Значение3 = Значение10;
			ИначеЕсли ТокенРешения0 = "СЕКУНДА" Тогда
				Значение11 = Терминал("СЕКУНДА");
				Значение3 = Значение11;
			ИначеЕсли ТокенРешения0 = "ЧАС" Тогда
				Значение12 = Терминал("ЧАС");
				Значение3 = Значение12;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
			КонецЕсли;
			ЭтотУзел.ТипДополненияПериодами = Значение3;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = ")" Тогда
			ИначеЕсли ТокенРешения0 = "," Тогда
				Лексема(",");
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
					Значение13 = НеТерминалВыражение();
					ЭтотУзел.НачалоПериодаДополнения = Значение13;
				ИначеЕсли (ТокенРешения0 = ")" Или ТокенРешения0 = ",") Тогда
					ЭтотУзел.НачалоПериодаДополнения = Неопределено;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
				КонецЕсли;
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если ТокенРешения0 = ")" Тогда
				ИначеЕсли ТокенРешения0 = "," Тогда
					Лексема(",");
					ТокенРешения0 = ТипТокенаПросмотра(0);
					Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
						Значение14 = НеТерминалВыражение();
						ЭтотУзел.КонецПериодаДополнения = Значение14;
					ИначеЕсли ТокенРешения0 = ")" Тогда
						ЭтотУзел.КонецПериодаДополнения = Неопределено;
					Иначе
						ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
					КонецЕсли;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
				КонецЕсли;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
			КонецЕсли;
			Лексема(")");
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
		КонецЕсли;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ") Тогда
		ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Значение15 = Идентификатор("ID_ПсевдонимКонтрольнойТочкиИтогов");
			ЭтотУзел.ИмяКолонки = Значение15;
		ИначеЕсли ТокенРешения0 = "КАК" Тогда
			Терминал("КАК");
			Значение16 = Идентификатор("ID_ПсевдонимРасширенный");
			ЭтотУзел.ИмяКолонки = Значение16;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ОБЩИЕ" Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = ")" Или ТокенРешения1 = "," Или ТокенРешения1 = ";" Или ТокенРешения1 = "{" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
			Терминал("ОБЩИЕ");
			РезультатПродукции = ЭтотУзел;
		ИначеЕсли (ТокенРешения1 = "ID" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
			Терминал("ОБЩИЕ");
			Идентификатор("ID_Псевдоним");
			РезультатПродукции = ЭтотУзел;
		ИначеЕсли ТокенРешения1 = "КАК" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
			Терминал("ОБЩИЕ");
			Терминал("КАК");
			Идентификатор("ID_ПсевдонимРасширенный");
			РезультатПродукции = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипКонтрольнойТочки()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
	ИначеЕсли ТокенРешения0 = "ИЕРАРХИЯ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиИерархия(ТекущийТокен);
		Терминал("ИЕРАРХИЯ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ТОЛЬКО" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиТолькоИерархия(ТекущийТокен);
		Терминал("ТОЛЬКО");
		Терминал("ИЕРАРХИЯ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ТипКонтрольнойТочки");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалРасширениеСКД()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		РезультатПродукции = Неопределено;
	ИначеЕсли ТокенРешения0 = "{" Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ") Тогда
			Лексема("{");
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "ВЫБРАТЬ" Тогда
				Терминал("ВЫБРАТЬ");
			ИначеЕсли ТокенРешения0 = "ИТОГИ" Тогда
				Терминал("ИТОГИ");
				Терминал("ПО");
			ИначеЕсли ТокенРешения0 = "УПОРЯДОЧИТЬ" Тогда
				Терминал("УПОРЯДОЧИТЬ");
				Терминал("ПО");
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ВЫБРАТЬ"", ""ИТОГИ"", ""УПОРЯДОЧИТЬ""");
			КонецЕсли;
			НеТерминалПолеВыборки();
			Пока Истина Цикл
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если ТокенРешения0 = "," Тогда
					Лексема(",");
					НеТерминалПолеВыборки();
				ИначеЕсли ТокенРешения0 = "}" Тогда
					Прервать;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""","", ""}""");
				КонецЕсли;
			КонецЦикла;
			Лексема("}");
			РезультатПродукции = Неопределено;
		ИначеЕсли ТокенРешения1 = "ГДЕ" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
			Лексема("{");
			Терминал("ГДЕ");
			Значение1 = НеТерминалПолеВыборки();
			ЭтотУзел.Добавить(Значение1);
			Пока Истина Цикл
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если ТокенРешения0 = "," Тогда
					Лексема(",");
					Значение2 = НеТерминалПолеВыборки();
					ЭтотУзел.Добавить(Значение2);
				ИначеЕсли ТокенРешения0 = "}" Тогда
					Прервать;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""","", ""}""");
				КонецЕсли;
			КонецЦикла;
			Лексема("}");
			РезультатПродукции = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("РасширениеСКД");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("РасширениеСКД");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражение()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалЛогическоеСлагаемое();
	Значение1 = Значение2;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "ИЛИ" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Терминал("ИЛИ");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалЛогическоеСлагаемое();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Выражение");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическоеСлагаемое()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалЛогическийМножитель();
	Значение1 = Значение2;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "И" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Терминал("И");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалЛогическийМножитель();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ЛогическоеСлагаемое");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическийМножитель()
	РезультатПродукции = Неопределено;
	Значение1 = НеТерминалЛогическаяОперация();
	Значение2 = Значение1;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		Значение3 = 0;
	ИначеЕсли ТокенРешения0 = "В" Тогда
		Значение3 = 4;
	ИначеЕсли ТокенРешения0 = "ЕСТЬ" Тогда
		Значение3 = 3;
	ИначеЕсли ТокенРешения0 = "МЕЖДУ" Тогда
		Значение3 = 1;
	ИначеЕсли ТокенРешения0 = "НЕ" Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если ТокенРешения1 = "В" Тогда
			Значение3 = 4;
		ИначеЕсли ТокенРешения1 = "МЕЖДУ" Тогда
			Значение3 = 1;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""В"", ""МЕЖДУ""");
		КонецЕсли;
	ИначеЕсли ТокенРешения0 = "ССЫЛКА" Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = ")" Или ТокенРешения1 = "," Или ТокенРешения1 = ";" Или ТокенРешения1 = "{" Или ТокенРешения1 = "}" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ") Тогда
			Значение3 = 0;
		ИначеЕсли ТокенРешения1 = "ID" Тогда
			Значение3 = 2;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ЛогическийМножитель");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЛогическийМножитель");
	КонецЕсли;
	Если Значение3 = 1 Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорМежду(ТекущийТокен);
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "МЕЖДУ" Тогда
		ИначеЕсли ТокенРешения0 = "НЕ" Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""МЕЖДУ"", ""НЕ""");
		КонецЕсли;
		Терминал("МЕЖДУ");
		Значение5 = НеТерминалОперандСравнения();
		ЭтотУзел.НачалоИнтервала = Значение5;
		Терминал("И");
		Значение6 = НеТерминалОперандСравнения();
		ЭтотУзел.КонецИнтервала = Значение6;
		Значение4 = ЭтотУзел;
	ИначеЕсли Значение3 = 2 Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиТипа(ТекущийТокен);
		Терминал("ССЫЛКА");
		Значение7 = НеТерминалТипСсылочногоПоля();
		ЭтотУзел.ТипСсылочногоПоля = Значение7;
		Значение4 = ЭтотУзел;
	ИначеЕсли Значение3 = 3 Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиНаNULL(ТекущийТокен);
		Терминал("ЕСТЬ");
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "NULL" Тогда
		ИначеЕсли ТокенРешения0 = "НЕ" Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""NULL"", ""НЕ""");
		КонецЕсли;
		Терминал("NULL");
		Значение4 = ЭтотУзел;
	ИначеЕсли Значение3 = 4 Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорВ(ТекущийТокен);
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "В" Тогда
		ИначеЕсли ТокенРешения0 = "НЕ" Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""В"", ""НЕ""");
		КонецЕсли;
		Терминал("В");
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "(" Тогда
		ИначеЕсли ТокенРешения0 = "ИЕРАРХИИ" Тогда
			Терминал("ИЕРАРХИИ");
			ЭтотУзел.Иерархия = Истина;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", ""ИЕРАРХИИ""");
		КонецЕсли;
		Лексема("(");
		Значение8 = НеТерминалОперандВ();
		ЭтотУзел.Список = Значение8;
		Лексема(")");
		Значение4 = ЭтотУзел;
	КонецЕсли;
	Если Значение3 <> 0 Тогда
		Значение4.Операнд = Значение2;
		Значение2 = Значение4;
	КонецЕсли;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипСсылочногоПоля()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСсылочногоПоля(ТекущийТокен);
	Значение1 = Идентификатор("ID_ГруппаТипаСсылки");
	ЭтотУзел.Группа = Значение1;
	Лексема(".");
	Значение2 = Идентификатор("ID_ИмяТипа");
	ЭтотУзел.Таблица = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперандВ()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалСписокВыражений();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "ВЫБРАТЬ" Тогда
		Значение2 = НеТерминалЗапросВыбора();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОперандВ");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическаяОперация()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалЛогическаяОперацияБезОтрицания();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "НЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЛогическоеОтрицание(ТекущийТокен);
		Терминал("НЕ");
		Пока Истина Цикл
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
				Прервать;
			ИначеЕсли ТокенРешения0 = "НЕ" Тогда
				Терминал("НЕ");
				ЭтотУзел.Количество = ЭтотУзел.Количество + 1;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперация");
			КонецЕсли;
		КонецЦикла;
		Значение2 = НеТерминалЛогическаяОперацияБезОтрицания();
		ЭтотУзел.Выражение = Значение2;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперация");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическаяОперацияБезОтрицания()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалОперандСравнения();
	Значение1 = Значение2;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли (ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "<" Тогда
				Значение4 = Лексема("<");
				Значение3 = Значение4;
			ИначеЕсли ТокенРешения0 = "<=" Тогда
				Значение5 = Лексема("<=");
				Значение3 = Значение5;
			ИначеЕсли ТокенРешения0 = "<>" Тогда
				Значение6 = Лексема("<>");
				Значение3 = Значение6;
			ИначеЕсли ТокенРешения0 = "=" Тогда
				Значение7 = Лексема("=");
				Значение3 = Значение7;
			ИначеЕсли ТокенРешения0 = ">" Тогда
				Значение8 = Лексема(">");
				Значение3 = Значение8;
			ИначеЕсли ТокенРешения0 = ">=" Тогда
				Значение9 = Лексема(">=");
				Значение3 = Значение9;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперацияБезОтрицания");
			КонецЕсли;
			ЭтотУзел.Операция = Значение3;
			Значение10 = НеТерминалОперандСравнения();
			ЭтотУзел.ПраваяЧасть = Значение10;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперацияБезОтрицания");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперандСравнения()
	РезультатПродукции = Неопределено;
	Значение1 = НеТерминалАрифметическоеВыражение();
	Значение2 = Значение1;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		Значение3 = 0;
	ИначеЕсли ТокенРешения0 = "НЕ" Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = "В" Или ТокенРешения1 = "МЕЖДУ") Тогда
			Значение3 = 0;
		ИначеЕсли ТокенРешения1 = "ПОДОБНО" Тогда
			Значение3 = 1;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""В"", ""МЕЖДУ"", ""ПОДОБНО""");
		КонецЕсли;
	ИначеЕсли ТокенРешения0 = "ПОДОБНО" Тогда
		Значение3 = 1;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОперандСравнения");
	КонецЕсли;
	Если Значение3 = 1 Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПодобно(ТекущийТокен);
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "НЕ" Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		ИначеЕсли ТокенРешения0 = "ПОДОБНО" Тогда
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""НЕ"", ""ПОДОБНО""");
		КонецЕсли;
		Терминал("ПОДОБНО");
		Значение5 = НеТерминалШаблонПодобия();
		ЭтотУзел.Шаблон = Значение5;
		Значение4 = ЭтотУзел;
	КонецЕсли;
	Если Значение3 <> 0 Тогда
		Значение4.Операнд = Значение2;
		Значение2 = Значение4;
	КонецЕсли;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалШаблонПодобия()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "&" Тогда
		Значение1 = НеТерминалПараметр();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "СтроковаяКонстанта" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение2 = Константа("СтроковаяКонстанта");
		ЭтотУзел.Значение = Значение2;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""&"", ""СтроковаяКонстанта""");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалАрифметическоеВыражение()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалСлагаемое();
	Значение1 = Значение2;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "," Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "+" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Лексема("+");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалСлагаемое();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		ИначеЕсли ТокенРешения0 = "-" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение5 = Лексема("-");
			ЭтотУзел.Операция = Значение5;
			Значение6 = НеТерминалСлагаемое();
			ЭтотУзел.ПраваяЧасть = Значение6;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("АрифметическоеВыражение");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСлагаемое()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалМножитель();
	Значение1 = Значение2;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "%" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Лексема("%");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		ИначеЕсли ТокенРешения0 = "*" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение5 = Лексема("*");
			ЭтотУзел.Операция = Значение5;
			Значение6 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение6;
			Значение1 = ЭтотУзел;
		ИначеЕсли ТокенРешения0 = "/" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение7 = Лексема("/");
			ЭтотУзел.Операция = Значение7;
			Значение8 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение8;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Слагаемое");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалУнарнаяОперация()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйУнарнаяОперация(ТекущийТокен);
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "+" Тогда
		Значение1 = Лексема("+");
		ЭтотУзел.Знаки.Добавить(Значение1);
	ИначеЕсли ТокенРешения0 = "-" Тогда
		Значение2 = Лексема("-");
		ЭтотУзел.Знаки.Добавить(Значение2);
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""+"", ""-""");
	КонецЕсли;
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "+" Тогда
			Значение3 = Лексема("+");
			ЭтотУзел.Знаки.Добавить(Значение3);
		ИначеЕсли ТокенРешения0 = "-" Тогда
			Значение4 = Лексема("-");
			ЭтотУзел.Знаки.Добавить(Значение4);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("УнарнаяОперация");
		КонецЕсли;
	КонецЦикла;
	Значение5 = НеТерминалОперанд();
	ЭтотУзел.Выражение = Значение5;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалМножитель()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалОперанд();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТокенРешения0 = "+" Или ТокенРешения0 = "-") Тогда
		Значение2 = НеТерминалУнарнаяОперация();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Множитель");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперанд()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "&" Тогда
		Значение1 = НеТерминалПараметр();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТокенРешения0 = "(" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ССЫЛКА") Тогда
		Значение2 = НеТерминалПоле();
		РезультатПродукции = Значение2;
	ИначеЕсли (ТокенРешения0 = "NULL" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение3 = НеТерминалКонстанта();
		РезультатПродукции = Значение3;
	ИначеЕсли ТокенРешения0 = "ВЫБОР" Тогда
		Значение4 = НеТерминалВыбор();
		РезультатПродукции = Значение4;
	ИначеЕсли (ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС") Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = "%" Или ТокенРешения1 = ")" Или ТокенРешения1 = "*" Или ТокенРешения1 = "+" Или ТокенРешения1 = "," Или ТокенРешения1 = "-" Или ТокенРешения1 = "." Или ТокенРешения1 = "/" Или ТокенРешения1 = ";" Или ТокенРешения1 = "<" Или ТокенРешения1 = "<=" Или ТокенРешения1 = "<>" Или ТокенРешения1 = "=" Или ТокенРешения1 = ">" Или ТокенРешения1 = ">=" Или ТокенРешения1 = "ID" Или ТокенРешения1 = "{" Или ТокенРешения1 = "}" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРИОДАМИ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			Значение5 = НеТерминалПоле();
			РезультатПродукции = Значение5;
		ИначеЕсли ТокенРешения1 = "(" Тогда
			Значение6 = НеТерминалФункция();
			РезультатПродукции = Значение6;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Операнд");
		КонецЕсли;
	ИначеЕсли (ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "СУММА") Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = "%" Или ТокенРешения1 = ")" Или ТокенРешения1 = "*" Или ТокенРешения1 = "+" Или ТокенРешения1 = "," Или ТокенРешения1 = "-" Или ТокенРешения1 = "." Или ТокенРешения1 = "/" Или ТокенРешения1 = ";" Или ТокенРешения1 = "<" Или ТокенРешения1 = "<=" Или ТокенРешения1 = "<>" Или ТокенРешения1 = "=" Или ТокенРешения1 = ">" Или ТокенРешения1 = ">=" Или ТокенРешения1 = "ID" Или ТокенРешения1 = "{" Или ТокенРешения1 = "}" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРИОДАМИ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			Значение7 = НеТерминалПоле();
			РезультатПродукции = Значение7;
		ИначеЕсли ТокенРешения1 = "(" Тогда
			Значение8 = НеТерминалАгрегатнаяФункция();
			РезультатПродукции = Значение8;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Операнд");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Операнд");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоле()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "(" Тогда
		Лексема("(");
		Значение2 = НеТерминалСписокВыражений();
		Лексема(")");
		Значение1 = Значение2;
		Значение3 = Значение1;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "%" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = "/" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		ИначеЕсли ТокенРешения0 = "." Тогда
			Значение4 = НеТерминалРазыменованиеПослеСкобок();
			Значение4.Элементы.Вставить(0, Значение3);
			Значение3 = Значение4;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Поле");
		КонецЕсли;
		РезультатПродукции = Значение3;
	ИначеЕсли (ТокенРешения0 = "ID" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "ID" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС") Тогда
			Значение6 = Идентификатор("ID_ПолеБезРазыменования");
			Значение5 = Значение6;
		ИначеЕсли ТокенРешения0 = "ВЫРАЗИТЬ" Тогда
			ТокенРешения1 = ТипТокенаПросмотра(1);
			Если (ТокенРешения1 = Неопределено Или ТокенРешения1 = "%" Или ТокенРешения1 = ")" Или ТокенРешения1 = "*" Или ТокенРешения1 = "+" Или ТокенРешения1 = "," Или ТокенРешения1 = "-" Или ТокенРешения1 = "." Или ТокенРешения1 = "/" Или ТокенРешения1 = ";" Или ТокенРешения1 = "<" Или ТокенРешения1 = "<=" Или ТокенРешения1 = "<>" Или ТокенРешения1 = "=" Или ТокенРешения1 = ">" Или ТокенРешения1 = ">=" Или ТокенРешения1 = "ID" Или ТокенРешения1 = "{" Или ТокенРешения1 = "}" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРИОДАМИ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
				Значение7 = Идентификатор("ID_ПолеБезРазыменования");
				Значение5 = Значение7;
			ИначеЕсли ТокенРешения1 = "(" Тогда
				Значение8 = НеТерминалПриведениеТипа();
				Значение5 = Значение8;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("Поле");
			КонецЕсли;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Поле");
		КонецЕсли;
		ЭтотУзел.Элементы.Добавить(Значение5);
		Пока Истина Цикл
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "%" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = "/" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
				Прервать;
			ИначеЕсли ТокенРешения0 = "." Тогда
				ТокенРешения1 = ТипТокенаПросмотра(1);
				Если (ТокенРешения1 = "(" Или ТокенРешения1 = "*") Тогда
					Прервать;
				ИначеЕсли (ТокенРешения1 = "ID" Или ТокенРешения1 = "NULL" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБОР" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ВЫРАЗИТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИСТИНА" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "ЛОЖЬ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРВЫЕ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗЛИЧНЫЕ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "РАЗРЕШЕННЫЕ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
					Лексема(".");
					Значение9 = Идентификатор("ID_Полный");
					ЭтотУзел.Элементы.Добавить(Значение9);
				Иначе
					ВызватьИсключениеСинтаксическаяОшибка("Поле");
				КонецЕсли;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("Поле");
			КонецЕсли;
		КонецЦикла;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "%" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = "/" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
		ИначеЕсли ТокенРешения0 = "." Тогда
			Лексема(".");
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "(" Тогда
				Значение11 = НеТерминалПоляВложеннойТаблицы();
				Значение10 = Значение11;
			ИначеЕсли ТокенРешения0 = "*" Тогда
				Значение12 = НеТерминалВыражениеВсеПоляИсточника();
				Значение10 = Значение12;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", ""*""");
			КонецЕсли;
			ЭтотУзел.Элементы.Добавить(Значение10);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Поле");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Поле");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалРазыменованиеПослеСкобок()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "." Тогда
		ТокенРешения1 = ТипТокенаПросмотра(1);
		Если (ТокенРешения1 = "(" Или ТокенРешения1 = "*") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
			Лексема(".");
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = "(" Тогда
				Значение2 = НеТерминалПоляВложеннойТаблицы();
				Значение1 = Значение2;
			ИначеЕсли ТокенРешения0 = "*" Тогда
				Значение3 = НеТерминалВыражениеВсеПоляИсточника();
				Значение1 = Значение3;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", ""*""");
			КонецЕсли;
			ЭтотУзел.Элементы.Добавить(Значение1);
			РезультатПродукции = ЭтотУзел;
		ИначеЕсли (ТокенРешения1 = "ID" Или ТокенРешения1 = "NULL" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБОР" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ВЫРАЗИТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИСТИНА" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "ЛОЖЬ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРВЫЕ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗЛИЧНЫЕ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "РАЗРЕШЕННЫЕ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
			Лексема(".");
			Значение4 = Идентификатор("ID_Полный");
			ЭтотУзел.Элементы.Добавить(Значение4);
			Пока Истина Цикл
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "%" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = "/" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
					Прервать;
				ИначеЕсли ТокенРешения0 = "." Тогда
					ТокенРешения1 = ТипТокенаПросмотра(1);
					Если (ТокенРешения1 = "(" Или ТокенРешения1 = "*") Тогда
						Прервать;
					ИначеЕсли (ТокенРешения1 = "ID" Или ТокенРешения1 = "NULL" Или ТокенРешения1 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения1 = "БУЛЕВО" Или ТокенРешения1 = "В" Или ТокенРешения1 = "ВНУТРЕННЕЕ" Или ТокенРешения1 = "ВОЗР" Или ТокенРешения1 = "ВСЕ" Или ТокенРешения1 = "ВЫБОР" Или ТокенРешения1 = "ВЫБРАТЬ" Или ТокенРешения1 = "ВЫРАЗИТЬ" Или ТокенРешения1 = "ГДЕ" Или ТокенРешения1 = "ГОД" Или ТокенРешения1 = "ДАТА" Или ТокенРешения1 = "ДАТАВРЕМЯ" Или ТокенРешения1 = "ДЕНЬ" Или ТокенРешения1 = "ДЕНЬГОДА" Или ТокенРешения1 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения1 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения1 = "ЕСТЬ" Или ТокенРешения1 = "ЕСТЬNULL" Или ТокенРешения1 = "ЗНАЧЕНИЕ" Или ТокенРешения1 = "И" Или ТокенРешения1 = "ИЕРАРХИИ" Или ТокенРешения1 = "ИЕРАРХИЯ" Или ТокенРешения1 = "ИЗ" Или ТокенРешения1 = "ИЛИ" Или ТокенРешения1 = "ИМЕЮЩИЕ" Или ТокенРешения1 = "ИНАЧЕ" Или ТокенРешения1 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения1 = "ИСТИНА" Или ТокенРешения1 = "ИТОГИ" Или ТокенРешения1 = "КАК" Или ТокенРешения1 = "КВАРТАЛ" Или ТокенРешения1 = "КОГДА" Или ТокенРешения1 = "КОЛИЧЕСТВО" Или ТокенРешения1 = "КОНЕЦ" Или ТокенРешения1 = "КОНЕЦПЕРИОДА" Или ТокенРешения1 = "ЛЕВОЕ" Или ТокенРешения1 = "ЛОЖЬ" Или ТокенРешения1 = "МАКСИМУМ" Или ТокенРешения1 = "МЕЖДУ" Или ТокенРешения1 = "МЕСЯЦ" Или ТокенРешения1 = "МИНИМУМ" Или ТокенРешения1 = "МИНУТА" Или ТокенРешения1 = "НАЧАЛОПЕРИОДА" Или ТокенРешения1 = "НЕ" Или ТокенРешения1 = "НЕДЕЛЯ" Или ТокенРешения1 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения1 = "ОБЪЕДИНИТЬ" Или ТокенРешения1 = "ПЕРВЫЕ" Или ТокенРешения1 = "ПО" Или ТокенРешения1 = "ПОДОБНО" Или ТокенРешения1 = "ПОДСТРОКА" Или ТокенРешения1 = "ПОЛНОЕ" Или ТокенРешения1 = "ПОМЕСТИТЬ" Или ТокенРешения1 = "ПРАВОЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения1 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения1 = "РАЗЛИЧНЫЕ" Или ТокенРешения1 = "РАЗНОСТЬДАТ" Или ТокенРешения1 = "РАЗРЕШЕННЫЕ" Или ТокенРешения1 = "СГРУППИРОВАТЬ" Или ТокенРешения1 = "СЕКУНДА" Или ТокенРешения1 = "СОЕДИНЕНИЕ" Или ТокенРешения1 = "СРЕДНЕЕ" Или ТокенРешения1 = "ССЫЛКА" Или ТокенРешения1 = "СТРОКА" Или ТокенРешения1 = "СУММА" Или ТокенРешения1 = "ТИП" Или ТокенРешения1 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения1 = "ТОГДА" Или ТокенРешения1 = "ТОЛЬКО" Или ТокенРешения1 = "УБЫВ" Или ТокенРешения1 = "УНИЧТОЖИТЬ" Или ТокенРешения1 = "УПОРЯДОЧИТЬ" Или ТокенРешения1 = "ЧАС" Или ТокенРешения1 = "ЧИСЛО") Тогда
						Лексема(".");
						Значение5 = Идентификатор("ID_Полный");
						ЭтотУзел.Элементы.Добавить(Значение5);
					Иначе
						ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
					КонецЕсли;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
				КонецЕсли;
			КонецЦикла;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = "%" Или ТокенРешения0 = ")" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "," Или ТокенРешения0 = "-" Или ТокенРешения0 = "/" Или ТокенРешения0 = ";" Или ТокенРешения0 = "<" Или ТокенРешения0 = "<=" Или ТокенРешения0 = "<>" Или ТокенРешения0 = "=" Или ТокенРешения0 = ">" Или ТокенРешения0 = ">=" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "{" Или ТокенРешения0 = "}" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "БУЛЕВО" Или ТокенРешения0 = "В" Или ТокенРешения0 = "ВНУТРЕННЕЕ" Или ТокенРешения0 = "ВОЗР" Или ТокенРешения0 = "ВСЕ" Или ТокенРешения0 = "ВЫБРАТЬ" Или ТокенРешения0 = "ГДЕ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "И" Или ТокенРешения0 = "ИЕРАРХИИ" Или ТокенРешения0 = "ИЕРАРХИЯ" Или ТокенРешения0 = "ИЗ" Или ТокенРешения0 = "ИЛИ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "КАК" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОГДА" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦ" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛЕВОЕ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕЖДУ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "ПЕРИОДАМИ" Или ТокенРешения0 = "ПО" Или ТокенРешения0 = "ПОДОБНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПОЛНОЕ" Или ТокенРешения0 = "ПОМЕСТИТЬ" Или ТокенРешения0 = "ПРАВОЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СГРУППИРОВАТЬ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СОЕДИНЕНИЕ" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СТРОКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ТОГДА" Или ТокенРешения0 = "ТОЛЬКО" Или ТокенРешения0 = "УБЫВ" Или ТокенРешения0 = "УНИЧТОЖИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧИСЛО") Тогда
			ИначеЕсли ТокенРешения0 = "." Тогда
				Лексема(".");
				ТокенРешения0 = ТипТокенаПросмотра(0);
				Если ТокенРешения0 = "(" Тогда
					Значение7 = НеТерминалПоляВложеннойТаблицы();
					Значение6 = Значение7;
				ИначеЕсли ТокенРешения0 = "*" Тогда
					Значение8 = НеТерминалВыражениеВсеПоляИсточника();
					Значение6 = Значение8;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", ""*""");
				КонецЕсли;
				ЭтотУзел.Элементы.Добавить(Значение6);
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
			КонецЕсли;
			РезультатПродукции = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
		КонецЕсли;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка(".", Истина);
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоляИсточника()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоляИсточника(ТекущийТокен);
	Лексема("*");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляВложеннойТаблицы()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПоляВложеннойТаблицы(ТекущийТокен);
	Лексема("(");
	Значение1 = НеТерминалПоляВыборки();
	ЭтотУзел.Элементы = Значение1;
	Лексема(")");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокВыражений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИТОГИ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалВыражение();
			ЭтотУзел.Элементы.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("СписокВыражений");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеМоделиЗапроса()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Значение = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокВыраженийМодели()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	Значение1 = НеТерминалВыражениеМоделиЗапроса();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = Неопределено Или ТокенРешения0 = ")" Или ТокенРешения0 = ";" Или ТокенРешения0 = "{" Или ТокенРешения0 = "АВТОУПОРЯДОЧИВАНИЕ" Или ТокенРешения0 = "ИМЕЮЩИЕ" Или ТокенРешения0 = "ИНДЕКСИРОВАТЬ" Или ТокенРешения0 = "ИТОГИ" Или ТокенРешения0 = "ОБЪЕДИНИТЬ" Или ТокенРешения0 = "УПОРЯДОЧИТЬ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "," Тогда
			Лексема(",");
			Значение2 = НеТерминалВыражениеМоделиЗапроса();
			ЭтотУзел.Элементы.Добавить(Значение2);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("СписокВыраженийМодели");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПриведениеТипа()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПриведениеТипа(ТекущийТокен);
	Терминал("ВЫРАЗИТЬ");
	Лексема("(");
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Выражение = Значение1;
	Терминал("КАК");
	Значение2 = НеТерминалОписаниеТипа();
	ЭтотУзел.ОписаниеТипа = Значение2;
	Лексема(")");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОписаниеТипа()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ID" Тогда
		Значение1 = НеТерминалТипСсылочногоПоля();
		РезультатПродукции = Значение1;
	ИначеЕсли ТокенРешения0 = "БУЛЕВО" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаБулево(ТекущийТокен);
		Терминал("БУЛЕВО");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДАТА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаДата(ТекущийТокен);
		Терминал("ДАТА");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "СТРОКА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаСтрока(ТекущийТокен);
		Терминал("СТРОКА");
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "(" Тогда
			Лексема("(");
			Значение2 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.Длина = Значение2;
			Лексема(")");
		ИначеЕсли ТокенРешения0 = ")" Тогда
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", "")""");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЧИСЛО" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаЧисло(ТекущийТокен);
		Терминал("ЧИСЛО");
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = "(" Тогда
			Лексема("(");
			Значение3 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.Длина = Значение3;
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = ")" Тогда
			ИначеЕсли ТокенРешения0 = "," Тогда
				ТокенРешения1 = ТипТокенаПросмотра(1);
				Если ТокенРешения1 = ")" Тогда
					Лексема(",");
				ИначеЕсли ТокенРешения1 = "ЧисловаяКонстанта" Тогда
					Лексема(",");
					Значение4 = Константа("ЧисловаяКонстанта");
					ЭтотУзел.Точность = Значение4;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", ""ЧисловаяКонстанта""");
				КонецЕсли;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
			КонецЕсли;
			Лексема(")");
		ИначеЕсли ТокенРешения0 = ")" Тогда
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""("", "")""");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОписаниеТипа");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыбор()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбор(ТекущийТокен);
	Терминал("ВЫБОР");
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		Значение1 = НеТерминалВыражение();
		ЭтотУзел.ВыражениеВыбора = Значение1;
	ИначеЕсли ТокенРешения0 = "КОГДА" Тогда
		ЭтотУзел.ВыражениеВыбора = Неопределено;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Выбор");
	КонецЕсли;
	Значение2 = НеТерминалКогдаТогда();
	ЭтотУзел.АльтернативыВыбора.Добавить(Значение2);
	Пока Истина Цикл
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "ИНАЧЕ" Или ТокенРешения0 = "КОНЕЦ") Тогда
			Прервать;
		ИначеЕсли ТокенРешения0 = "КОГДА" Тогда
			Значение3 = НеТерминалКогдаТогда();
			ЭтотУзел.АльтернативыВыбора.Добавить(Значение3);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ИНАЧЕ"", ""КОГДА"", ""КОНЕЦ""");
		КонецЕсли;
	КонецЦикла;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ИНАЧЕ" Тогда
		Терминал("ИНАЧЕ");
		Значение4 = НеТерминалВыражение();
		ЭтотУзел.Иначе = Значение4;
	ИначеЕсли ТокенРешения0 = "КОНЕЦ" Тогда
		ЭтотУзел.Иначе = Неопределено;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены("""ИНАЧЕ"", ""КОНЕЦ""");
	КонецЕсли;
	Терминал("КОНЕЦ");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКогдаТогда()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативаВыбора(ТекущийТокен);
	Терминал("КОГДА");
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Условие = Значение1;
	Терминал("ТОГДА");
	Значение2 = НеТерминалВыражение();
	ЭтотУзел.Действие = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонстанта()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "NULL" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("NULL");
		ЭтотУзел.Значение = Null;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ИСТИНА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("ИСТИНА");
		ЭтотУзел.Значение = Истина;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЛОЖЬ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("ЛОЖЬ");
		ЭтотУзел.Значение = Ложь;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("НЕОПРЕДЕЛЕНО");
		ЭтотУзел.Значение = Неопределено;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "СтроковаяКонстанта" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение1 = Константа("СтроковаяКонстанта");
		ЭтотУзел.Значение = Значение1;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЧисловаяКонстанта" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение2 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.Значение = Значение2;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Константа");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПараметр()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПараметрЗапроса(ТекущийТокен);
	Лексема("&");
	Значение1 = Идентификатор("ID_Полный");
	ЭтотУзел.Имя = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалАгрегатнаяФункция()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "КОЛИЧЕСТВО" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункцияКоличество(ТекущийТокен);
		Терминал("КОЛИЧЕСТВО");
		Лексема("(");
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "*" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
		ИначеЕсли ТокенРешения0 = "РАЗЛИЧНЫЕ" Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.Различные = Истина;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("АгрегатнаяФункция");
		КонецЕсли;
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если (ТокенРешения0 = "&" Или ТокенРешения0 = "(" Или ТокенРешения0 = "+" Или ТокенРешения0 = "-" Или ТокенРешения0 = "ID" Или ТокенРешения0 = "NULL" Или ТокенРешения0 = "ВЫБОР" Или ТокенРешения0 = "ВЫРАЗИТЬ" Или ТокенРешения0 = "ГОД" Или ТокенРешения0 = "ДАТА" Или ТокенРешения0 = "ДАТАВРЕМЯ" Или ТокенРешения0 = "ДЕНЬ" Или ТокенРешения0 = "ДЕНЬГОДА" Или ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Или ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Или ТокенРешения0 = "ЕСТЬNULL" Или ТокенРешения0 = "ЗНАЧЕНИЕ" Или ТокенРешения0 = "ИСТИНА" Или ТокенРешения0 = "КВАРТАЛ" Или ТокенРешения0 = "КОЛИЧЕСТВО" Или ТокенРешения0 = "КОНЕЦПЕРИОДА" Или ТокенРешения0 = "ЛОЖЬ" Или ТокенРешения0 = "МАКСИМУМ" Или ТокенРешения0 = "МЕСЯЦ" Или ТокенРешения0 = "МИНИМУМ" Или ТокенРешения0 = "МИНУТА" Или ТокенРешения0 = "НАЧАЛОПЕРИОДА" Или ТокенРешения0 = "НЕ" Или ТокенРешения0 = "НЕДЕЛЯ" Или ТокенРешения0 = "НЕОПРЕДЕЛЕНО" Или ТокенРешения0 = "ПОДСТРОКА" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Или ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТокенРешения0 = "РАЗНОСТЬДАТ" Или ТокенРешения0 = "СЕКУНДА" Или ТокенРешения0 = "СРЕДНЕЕ" Или ТокенРешения0 = "ССЫЛКА" Или ТокенРешения0 = "СУММА" Или ТокенРешения0 = "СтроковаяКонстанта" Или ТокенРешения0 = "ТИП" Или ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Или ТокенРешения0 = "ЧАС" Или ТокенРешения0 = "ЧисловаяКонстанта") Тогда
			Значение2 = НеТерминалВыражение();
			Значение1 = Значение2;
		ИначеЕсли ТокенРешения0 = "*" Тогда
			Значение3 = Лексема("*");
			Значение1 = Значение3;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("АгрегатнаяФункция");
		КонецЕсли;
		ЭтотУзел.Аргумент = Значение1;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "МАКСИМУМ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение4 = Терминал("МАКСИМУМ");
		ЭтотУзел.ИмяФункции = Значение4;
		Лексема("(");
		Значение5 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение5;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "МИНИМУМ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение6 = Терминал("МИНИМУМ");
		ЭтотУзел.ИмяФункции = Значение6;
		Лексема("(");
		Значение7 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение7;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "СРЕДНЕЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение8 = Терминал("СРЕДНЕЕ");
		ЭтотУзел.ИмяФункции = Значение8;
		Лексема("(");
		Значение9 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение9;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "СУММА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение10 = Терминал("СУММА");
		ЭтотУзел.ИмяФункции = Значение10;
		Лексема("(");
		Значение11 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение11;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("АгрегатнаяФункция");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалФункция()
	РезультатПродукции = Неопределено;
	ТокенРешения0 = ТипТокенаПросмотра(0);
	Если ТокенРешения0 = "ГОД" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияГод(ТекущийТокен);
		Терминал("ГОД");
		Лексема("(");
		Значение1 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение1;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДАТАВРЕМЯ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДатаВремя(ТекущийТокен);
		Терминал("ДАТАВРЕМЯ");
		Лексема("(");
		Значение2 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.Аргументы.Добавить(Значение2);
		Пока Истина Цикл
			ТокенРешения0 = ТипТокенаПросмотра(0);
			Если ТокенРешения0 = ")" Тогда
				Прервать;
			ИначеЕсли ТокенРешения0 = "," Тогда
				Лексема(",");
				Значение3 = Константа("ЧисловаяКонстанта");
				ЭтотУзел.Аргументы.Добавить(Значение3);
			Иначе
				ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "",""");
			КонецЕсли;
		КонецЦикла;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДЕНЬ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДень(ТекущийТокен);
		Терминал("ДЕНЬ");
		Лексема("(");
		Значение4 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение4;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДЕНЬГОДА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньГода(ТекущийТокен);
		Терминал("ДЕНЬГОДА");
		Лексема("(");
		Значение5 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение5;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДЕНЬНЕДЕЛИ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньНедели(ТекущийТокен);
		Терминал("ДЕНЬНЕДЕЛИ");
		Лексема("(");
		Значение6 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение6;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ДОБАВИТЬКДАТЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДобавитьКДате(ТекущийТокен);
		Терминал("ДОБАВИТЬКДАТЕ");
		Лексема("(");
		Значение7 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение7;
		Лексема(",");
		Значение8 = Идентификатор("ID_Полный");
		ЭтотУзел.ТипПериода = Значение8;
		Лексема(",");
		Значение9 = НеТерминалВыражение();
		ЭтотУзел.Сдвиг = Значение9;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЕСТЬNULL" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияIsNull(ТекущийТокен);
		Терминал("ЕСТЬNULL");
		Лексема("(");
		Значение10 = НеТерминалВыражение();
		ЭтотУзел.ПроверяемоеЗначение = Значение10;
		Лексема(",");
		Значение11 = НеТерминалВыражение();
		ЭтотУзел.Действие = Значение11;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЗНАЧЕНИЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЗначение(ТекущийТокен);
		Терминал("ЗНАЧЕНИЕ");
		Лексема("(");
		Значение12 = Идентификатор("ID_Полный");
		ЭтотУзел.ЧастиПути.Добавить(Значение12);
		Лексема(".");
		Значение13 = Идентификатор("ID_Полный");
		ЭтотУзел.ЧастиПути.Добавить(Значение13);
		ТокенРешения0 = ТипТокенаПросмотра(0);
		Если ТокенРешения0 = ")" Тогда
		ИначеЕсли ТокенРешения0 = "." Тогда
			Лексема(".");
			Значение14 = Идентификатор("ID_Полный");
			ЭтотУзел.ЧастиПути.Добавить(Значение14);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(""")"", "".""");
		КонецЕсли;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "КВАРТАЛ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКвартал(ТекущийТокен);
		Терминал("КВАРТАЛ");
		Лексема("(");
		Значение15 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение15;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "КОНЕЦПЕРИОДА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКонецПериода(ТекущийТокен);
		Терминал("КОНЕЦПЕРИОДА");
		Лексема("(");
		Значение16 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение16;
		Лексема(",");
		Значение17 = Идентификатор("ID_Полный");
		ЭтотУзел.ТипПериода = Значение17;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "МЕСЯЦ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМесяц(ТекущийТокен);
		Терминал("МЕСЯЦ");
		Лексема("(");
		Значение18 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение18;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "МИНУТА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМинута(ТекущийТокен);
		Терминал("МИНУТА");
		Лексема("(");
		Значение19 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение19;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "НАЧАЛОПЕРИОДА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияНачалоПериода(ТекущийТокен);
		Терминал("НАЧАЛОПЕРИОДА");
		Лексема("(");
		Значение20 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение20;
		Лексема(",");
		Значение21 = Идентификатор("ID_Полный");
		ЭтотУзел.ТипПериода = Значение21;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "НЕДЕЛЯ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньМесяца(ТекущийТокен);
		Терминал("НЕДЕЛЯ");
		Лексема("(");
		Значение22 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение22;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ПОДСТРОКА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПодстрока(ТекущийТокен);
		Терминал("ПОДСТРОКА");
		Лексема("(");
		Значение23 = НеТерминалВыражение();
		ЭтотУзел.Строка = Значение23;
		Лексема(",");
		Значение24 = НеТерминалВыражение();
		ЭтотУзел.НачальнаяПозиция = Значение24;
		Лексема(",");
		Значение25 = НеТерминалВыражение();
		ЭтотУзел.КоличествоСимволов = Значение25;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ПРЕДСТАВЛЕНИЕ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставление(ТекущийТокен);
		Терминал("ПРЕДСТАВЛЕНИЕ");
		Лексема("(");
		Значение26 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение26;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставлениеСсылки(ТекущийТокен);
		Терминал("ПРЕДСТАВЛЕНИЕССЫЛКИ");
		Лексема("(");
		Значение27 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение27;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "РАЗНОСТЬДАТ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияРазностьДат(ТекущийТокен);
		Терминал("РАЗНОСТЬДАТ");
		Лексема("(");
		Значение28 = НеТерминалВыражение();
		ЭтотУзел.Дата1 = Значение28;
		Лексема(",");
		Значение29 = НеТерминалВыражение();
		ЭтотУзел.Дата2 = Значение29;
		Лексема(",");
		Значение30 = Идентификатор("ID_Полный");
		ЭтотУзел.ТипПериода = Значение30;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "СЕКУНДА" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияСекунда(ТекущийТокен);
		Терминал("СЕКУНДА");
		Лексема("(");
		Значение31 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение31;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ТИП" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТип(ТекущийТокен);
		Терминал("ТИП");
		Лексема("(");
		Значение32 = НеТерминалОписаниеТипа();
		ЭтотУзел.Аргумент = Значение32;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ТИПЗНАЧЕНИЯ" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТипЗначения(ТекущийТокен);
		Терминал("ТИПЗНАЧЕНИЯ");
		Лексема("(");
		Значение33 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение33;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли ТокенРешения0 = "ЧАС" Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЧас(ТекущийТокен);
		Терминал("ЧАС");
		Лексема("(");
		Значение34 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение34;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Функция");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

#КонецОбласти

#Область Инициализация

КоличествоПросматриваемыхСимволов = 2;
Инициализировать();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
