
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ТаблицаПервыхСимволовВариантов;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Иницализировать();
	ТаблицаПервыхСимволовВариантов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ТаблицаПервыхСимволовВариантов").ПолучитьТекст());
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентифкатор");
	//ТаблицаПервыхСимволовВариантов.Индексы.Добавить("Продукция, КоличествоЭлементов");
	
	ИндексируемыеПоля = Новый Массив;
	ИндексируемыеПоля.Добавить("Продукция");
	//ИндексируемыеПоля.Добавить("НомерВарианта");
	ИндексируемыеПоля.Добавить("КоличествоЭлементов");
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		ИндексируемыеПоля.Добавить("Элемент" + Сч);
		ТаблицаПервыхСимволовВариантов.Индексы.Добавить(СтрСоединить(ИндексируемыеПоля, ","));
	КонецЦикла;		
КонецПроцедуры	

Функция НовыйБуферТокенов()
	БуферТокенов = Новый Структура("ИндексТекущегоЭлемента, Токены");
	БуферТокенов.ИндексТекущегоЭлемента = -1;
	БуферТокенов.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	
	Возврат БуферТокенов;
КонецФункции	

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();	
КонецПроцедуры	

Процедура ЗаполнитьБуферТокенов()	
	МаксимальныйИндексБуфера = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента По МаксимальныйИндексБуфера Цикл
			БуферТокенов.Токены[ИндексТекущегоЭлемента - Сдвиг] = БуферТокенов.Токены[ИндексТекущегоЭлемента];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;	
	КонецЕсли;	
	
	КоличествоДочитываемыхЭлементов = МаксимальныйИндексБуфера - БуферТокенов.ИндексТекущегоЭлемента;
	
	Для Сч = 1 По КоличествоДочитываемыхЭлементов Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();;
	КонецЦикла;	
КонецПроцедуры	

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = - 1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		
		Возврат БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	КонецЕсли;
	
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
		
	ЗаполнитьБуферТокенов();
	
	Возврат Токен;
КонецФункции	

Процедура УстановитьТекущйТокен()
	ТекущийТокен = СледующийТокенИзБуфера();	
КонецПроцедуры	

Функция НомерВаринатаПродукции(Продукция)
	СтруктураПоиска = Новый Структура("Продукция, КоличествоЭлементов", Продукция, 0);
	
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч - 1];
		Если Токен <> Неопределено И Токен.Тип <> Неопределено  Тогда
			СтруктураПоиска.Вставить("Элемент" + Сч, Токен.Тип);
			СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов + 1;
		КонецЕсли;
	КонецЦикла;		

	Для Сч = 0 По Макс(СтруктураПоиска.КоличествоЭлементов - 1, 0) Цикл
		СтрокиПервыхСимволов = ТаблицаПервыхСимволовВариантов.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПервыхСимволов.Количество() > 0 Тогда
			Возврат СтрокиПервыхСимволов[0].НомерВарианта;
		КонецЕсли;	
		
		СтруктураПоиска.Удалить("Элемент" + (СтруктураПоиска.КоличествоЭлементов - Сч));
		СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов - 1;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТекущийТокен.Тип <> ТипТерминала Тогда
		ВызватьИсключение "Ожидается " + ТипТерминала;
	КонецЕсли;	
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущйТокен();
	
	Возврат Тип;
КонецФункции

Функция Лексема(ТипЛексемы)
	Если ТекущийТокен.Тип <> ТипЛексемы Тогда
		ВызватьИсключение "Ожидается " + ТипЛексемы;
	КонецЕсли;		
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущйТокен();
	
	Возврат Тип;
КонецФункции

Функция Идентифкатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентифкатор", ТипИдентификатора, ТекущийТокен.Тип);
	
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ВызватьИсключение "Ожидается " + ТипИдентификатора;
	КонецЕсли;		
	
	Лексема = ТекущийТокен.Лексема; 
	
	УстановитьТекущйТокен();
	
	Возврат Лексема;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТекущийТокен.Тип <> ТипКонстанты Тогда
		ВызватьИсключение "Ожидается " + ТипКонстанты;
	КонецЕсли;	
	
	Значение = ТекущийТокен.Значение; 
	
	УстановитьТекущйТокен();
	
	Возврат Значение;
КонецФункции

Функция Разобрать(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);	
	УстановитьБуферТокенов();
	
	Возврат РезультатРазбора();
КонецФункции	

Функция РазобратьВыражение(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);	
	УстановитьБуферТокенов();
	
	Возврат РезультатРазбораВыражения();
КонецФункции     

Функция РезультатРазбора()
	УстановитьТекущйТокен();

	Результат = НеТерминалПакетЗапросов();
		
	Если ТекущийТокен.Тип <> Неопределено Тогда
		ВызватьИсключение "Остался не разобранный кусок";
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции   

Функция РезультатРазбораВыражения()
	УстановитьТекущйТокен();

	Результат = НеТерминалВыражение(Неопределено, Неопределено);
		
	Если ТекущийТокен.Тип <> Неопределено Тогда
		ВызватьИсключение "Остался не разобранный кусок";
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Функция НеТерминалПакетЗапросов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПакетЗапрсов(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЗапросПакета(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеПакетаЗапросов(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеПакетаЗапросов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеПакетаЗапросов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(";");
		ТекущийЭлемент = НеТерминалЗапросПакета(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеПакетаЗапросов(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(";");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросПакета(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЗапросПакета");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросУничтожения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросУничтожения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросУничтожения(ТекущийТокен);
	ТекущийЭлемент = Терминал("УНИЧТОЖИТЬ");
	ТекущийЭлемент = Идентифкатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросВыбора(ТекущийТокен);
	ТекущийЭлемент = НеТерминалОбъединяемыйЗапрос(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Операторы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокОбъединить(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалБлокУпорядочить(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Порядок = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИндексировать(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Индекс = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИтоги(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалАвтоупорядовачиваниеОпционально(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОбъединяемыйЗапрос(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорЗапроса(ТекущийТокен);
	ТекущийЭлемент = НеТерминалБлокВыбрать(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПоляВыборки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ВыбираемыеПоля = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокПоместить(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.__ТаблицаДляПомещения = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИз(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источники = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокГде(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Отбор = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокСгруппировать(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Группировка = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИмеющие(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ОтборСгруппированных = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокОбъединить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокОбъединить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ОБЪЕДИНИТЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТипОбъединения = ЭлементыМоделиЗапроса.НовыйТипОбъединение(ТекущийТокен);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалВсеОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТипОбъединения = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОбъединяемыйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТекущийЭлемент.ТипОбъединения = ТипОбъединения;
			ЭтотУзел.Операторы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалБлокОбъединить(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВсеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ВсеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединениеВсе(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВСЕ");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокВыбрать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Терминал("ВЫБРАТЬ");
	ТекущийЭлемент = НеТерминалМодификаторыВыборки(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалМодификаторыВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("МодификаторыВыборки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазлчиныеРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеРазличныеОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазлчиныеРазрешенныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("РазлчиныеРазрешенныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазрешенныеОпциоанально(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазлчиныеОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазрешенныеОпциоанально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("РазрешенныеОпциоанально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.ВыбиратьРазрешенные = Истина;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеРазрешенныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПервыеРазрешенныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазрешенныеОпциоанально(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПервыеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеРазличныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПервыеРазличныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеОпционально(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазлчиныеОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоляВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
	ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокПолейОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("СписокПолейОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПолеВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПолеВыборки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Псевдоним = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдоним(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Псевдоним");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("КАК");
		ТекущийЭлемент = Идентифкатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Идентифкатор("ID_Псевдоним");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдонимОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПсевдонимОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокПоместить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокПоместить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПОМЕСТИТЬ");
		ТекущийЭлемент = Идентифкатор("ID_ИмяТаблицы");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИз(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокИз");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИстчоникиЗапроса(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИЗ");
		ТекущийЭлемент = НеТерминалИсточникДанныхЗапроса(ЭтотУзел, ТекущийЭлемент, ЭтотУзел);
		ТекущийЭлемент = НеТерминалСписокТаблиц(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокТаблиц(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("СписокТаблиц");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалИсточникДанныхЗапроса(ЭтотУзел, ТекущийЭлемент, ЭтотУзел);
		ТекущийЭлемент = НеТерминалСписокТаблиц(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхЗапроса(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Источники.Элементы.Добавить(ЭтотУзел);
	ТекущийЭлемент = НеТерминалИсточникДанных(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент;
		;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСоединение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Соединение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = НеТерминалПраваяЧастьСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Соединения.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалПраваяЧастьСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Соединения.Добавить(ТекущийЭлемент);
			ТекущийЭлемент.Опционально = Истина;
		КонецЕсли;
		ТекущийЭлемент = Лексема("}");
		ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПраваяЧастьСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
	ТекущийЭлемент = НеТерминалТипСоединения(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ТипСоединения = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("СОЕДИНЕНИЕ");
	ТекущийЭлемент = НеТерминалИсточникДанныхСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент.ИдентификаторИсточника;
		;
	КонецЕсли;
	ТекущийЭлемент = Терминал("ПО");
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Условие = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Источники.Элементы.Добавить(ЭтотУзел);
	ТекущийЭлемент = НеТерминалПрисоединяемаяТаблица(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент;
		;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ТипСоединения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияЛевое(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЛЕВОЕ");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПравое(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРАВОЕ");

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияВнутреннее(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВНУТРЕННЕЕ");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПолное(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПОЛНОЕ");

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанных(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ИсточникДанных");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблицаЗначений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВложенныйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВременнаяТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПрисоединяемаяТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПрисоединяемаяТаблица");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВложенныйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВременнаяТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхТаблицаЗначений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблицаЗначений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент.Имя;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхВременнаяТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица(ТекущийТокен);
	ТекущийЭлемент = Идентифкатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблица(ТекущийТокен);
	ТекущийЭлемент = Идентифкатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалРазыменованиеТаблицы(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПараметрыТаблицыОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Параметры = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхВложенныйЗапрос(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВложенныйЗапрос(ТекущийТокен);
	ТекущийЭлемент = Лексема("(");
	ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ЗапросВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(")");
	ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазыменованиеТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Лексема(".");
	ТекущийЭлемент = Идентифкатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы+"."+ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеРазыменованияТаблицы(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеРазыменованияТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеРазыменованияТаблицы");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентифкатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы+"."+ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеРазыменованияТаблицы(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметрыТаблицыОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПараметрыТаблицыОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокПараметров(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокПараметров(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокПараметров(ТекущийТокен);
	ЭтотУзел.Добавить(Неопределено);
	ТекущийЭлемент = НеТерминалПараметрТаблицы(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел[ЭтотУзел.Количество()-1] = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеСпискаПараметров(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеСпискаПараметров(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеСпискаПараметров");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ЭтотУзел.Добавить(Неопределено);
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПараметрТаблицы(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел[ЭтотУзел.Количество()-1] = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеСпискаПараметров(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметрТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПараметрТаблицы");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражениеСКДПараметр(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ВыражениеСКДПараметр");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема("}");
		ТекущийЭлемент = НеТерминалВыражениеСКДПараметр(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокГде(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокГде");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ГДЕ");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокСгруппировать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокСгруппировать");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("СГРУППИРОВАТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокВыраженийМодели(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИмеющие(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокИмеющие");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИМЕЮЩИЕ");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокУпорядочить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокУпорядочить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УПОРЯДОЧИТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокЭлементовУпорядовачивания(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАвтоупорядовачиваниеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("АвтоупорядовачиваниеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		Родитель.Автопорядок = Истина;
		ТекущийЭлемент = Терминал("АВТОУПОРЯДОЧИВАНИЕ");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокЭлементовУпорядовачивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементыПорядка(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЭлементУпорядовачивания(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеСпискаЭлементовУпорядовачивания(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеСпискаЭлементовУпорядовачивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеСпискаЭлементовУпорядовачивания");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалЭлементУпорядовачивания(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеСпискаЭлементовУпорядовачивания(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЭлементУпорядовачивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементПорядка(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалИерархияОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Иерахия = Истина;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалНаправлениеУпорядовачивания(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Направеление = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалНаправлениеУпорядовачивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("НаправлениеУпорядовачивания");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеВозрастание(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВОЗР");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УБЫВ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеУбывание(ТекущийТокен);
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИерархияОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ИерархияОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Истина;
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИтоги(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокИтоги");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ИТОГИ");
		ТекущийЭлемент = НеТерминалПоляИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыраженияИтогов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалКонтрольныеТочкиИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонтрольныеТочкиИтогов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоляИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПоляИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыраженияИтогов(ТекущийТокен);
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонтрольныеТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольныеТочкиИтогов(ТекущийТокен);
	ТекущийЭлемент = НеТерминалКонтролнаяТочкаИтогов(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСписокКонтрольныхТочекОпциональное(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокКонтрольныхТочекОпциональное(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("СписокКонтрольныхТочекОпциональное");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалКонтролнаяТочкаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСписокКонтрольныхТочекОпциональное(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонтролнаяТочкаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("КонтролнаяТочкаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольнаяТочкаИтогов(ТекущийТокен);
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеКонтрольнойТочкиИтогов(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
		ТекущийЭлемент = Терминал("ОБЩИЕ");
		ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеКонтрольнойТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = НеТерминалТипКонтрольнойТочки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ТипКонтрольнойТочки = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалДополнениеПериодамиИтогов(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПсевдонимКонтролльнойТочкиИтогов(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяКолонки = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалДополнениеПериодамиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ДополнениеПериодамиИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРИОДАМИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалТипПериодаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипДополненияПериодами = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПериодДополненияИтогов(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипКонтрольнойТочки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ТипКонтрольнойТочки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиТолькоИерархия(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТОЛЬКО");
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиИерархия(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдонимКонтролльнойТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПсевдонимКонтролльнойТочкиИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("КАК");
		ТекущийЭлемент = Идентифкатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Идентифкатор("ID_ПсевдонимКотнольнойТочикИтогов");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипПериодаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ТипПериодаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("СЕКУНДА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("МИНУТА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ЧАС");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ДЕНЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("НЕДЕЛЯ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("МЕСЯЦ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 7 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ГОД");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 8 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ДЕКАДА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 9 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПОЛУГОДИЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПериодДополненияИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПериодДополненияИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПериодИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачалоПериодаДополнения = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОкончаниеПериодаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонецПериодаДополнения = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОкончаниеПериодаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОкончаниеПериодаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПериодИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПериодИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПериодИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИндексировать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("БлокИндексировать");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИНДЕКСИРОВАТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРасширениеСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("РасширениеСКД");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалТелоБлокаСКД(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема("}");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТелоБлокаСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
	ТекущийЭлемент = НеТерминалТипБлокаСКД(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипБлокаСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ТипБлокаСКД");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ГДЕ");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ВЫБРАТЬ");

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УПОРЯДОЧИТЬ");
		ТекущийЭлемент = Терминал("ПО");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИТОГИ");
		ТекущийЭлемент = Терминал("ПО");

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическоеСлогаемое(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическоеИли(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеИли(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЛогическоеИли");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ИЛИ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "ИЛИ";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеСлогаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеИли(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеСлогаемое(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическийМножитель(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическоеИ(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеИ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЛогическоеИ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("И");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "И";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическийМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеИ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическийМножитель(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическаяОперация(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическийОператор(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическийОператор(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЛогическийОператор");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорМежду(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("МЕЖДУ");
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачалоИнтервала = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Терминал("И");
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонецИнтервала = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиТипа(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ССЫЛКА");
		ТекущийЭлемент = НеТерминалТипСсылочногоПоля(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипСсылочногоПоля = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиНаNULL(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ЕСТЬ");
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("NULL");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорВ(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("В");
		ТекущийЭлемент = НеТерминалОпциоальноеВИрархии(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Иерахия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалОперандВ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Список = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипСсылочногоПоля(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСсылочногоПоля(ТекущийТокен);
	;
	ТекущийЭлемент = Идентифкатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Группа = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(".");
	ТекущийЭлемент = Идентифкатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Таблица = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперандВ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОперандВ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЛогическаяОперация");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОтрицание(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОперацияСравнения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОператорСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОператорСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОператорСравнения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<>");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(">");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(">=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперандСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалАрифметическоеВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОператорПодобно(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОтрицание(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЛогическоеОтрицание(ТекущийТокен);
	ТекущийЭлемент = Терминал("НЕ");
	ТекущийЭлемент = НеТерминалОтрицаниеПродолжение(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОтрицаниеПродолжение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОтрицаниеПродолжение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("НЕ");
		ТекущийЭлемент = НеТерминалОтрицаниеПродолжение(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОператорПодобно(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОператорПодобно");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПодобно(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("ПОДОБНО");
		ТекущийЭлемент = НеТерминалШаблонПодобия(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Шаблон = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалШаблонПодобия(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ШаблонПодобия");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("СтроковаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеНЕ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОпциональноеНЕ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("НЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциоальноеВИрархии(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОпциоальноеВИрархии");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИЕРАРХИИ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАрифметическоеВыражение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалСлогаемое(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАрифметическаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("АрифметическаяОперация");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("+");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "+";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСлогаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("-");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "-";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСлогаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСлогаемое(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияУмножения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОперацияУмножения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "*";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("/");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "/";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("%");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "%";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалУнарнаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйУнарнаяОперация(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЗнакУнарнойОперации(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Знаки.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалУнарнаяОперацияПродолжение(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалОперанд(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалУнарнаяОперацияПродолжение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("УнарнаяОперацияПродолжение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		Родитель = ТекущийЭлемент;
		ТекущийЭлемент = НеТерминалЗнакУнарнойОперации(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Знаки.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалУнарнаяОперацияПродолжение(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗнакУнарнойОперации(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ЗнакУнарнойОперации");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("-");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("+");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалМножитель(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Множитель");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОперанд(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалУнарнаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперанд(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Операнд");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыбор(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПоле(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалКонстанта(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалАгрегатнаяФункция(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалФункция(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоле(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Поле");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТекущийЭлемент = Идентифкатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТекущийЭлемент = НеТерминалПриведениеТипа(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент);

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияРазыменования(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОперацияРазыменования");
	Если НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентифкатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПоляВложеннойТаблицы(ТекущийТокен);
		Родитель.Элементы.Добавить(ЭтотУзел);
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалПоляВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокВыражений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыражений(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеСпискаВыражений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОпциональноеПродолжениеСпискаВыражений");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыражений(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражениеМоделиЗапроса(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Значение = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокВыраженийМодели(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОпциональноеПродолжениеСпискаВыраженийМодели");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПриведениеТипа(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПриведениеТипа(ТекущийТокен);
	ТекущийЭлемент = Терминал("ВЫРАЗИТЬ");
	ТекущийЭлемент = Лексема("(");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("КАК");
	ТекущийЭлемент = НеТерминалОписаниеТипа(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ОписаниеТипа = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(")");


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеТипа(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОписаниеТипа");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалТипСсылочногоПоля(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаБулево(ТекущийТокен);
		ТекущийЭлемент = Терминал("БУЛЕВО");

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаДата(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДАТА");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаЧисло(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЧИСЛО");
		ТекущийЭлемент = НеТерминалОписаниеЧисла(ЭтотУзел, ТекущийЭлемент);

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаСтрока(ТекущийТокен);
		ТекущийЭлемент = Терминал("СТРОКА");
		ТекущийЭлемент = НеТерминалОписаниеСтроки(ЭтотУзел, ТекущийЭлемент);

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеЧисла(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОписаниеЧисла");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Длина = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалТочностьЧисла(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТочностьЧисла(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ТочностьЧисла");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Точность = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Точность = 0;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеСтроки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОписаниеСтроки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Длина = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыбор(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбор(ТекущийТокен);
	ТекущийЭлемент = Терминал("ВЫБОР");
	ТекущийЭлемент = НеТерминалВырожениеВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ВыражениеВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалАльтернативыВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.АльтернативыВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалИначе(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Иначе = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("КОНЕЦ");


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВырожениеВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ВырожениеВыбора");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАльтернативыВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативыВыбора(ТекущийТокен);
	ТекущийЭлемент = НеТерминалКогдаТогда(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеАльтернативВыбора(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеАльтернативВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеАльтернативВыбора");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = НеТерминалКогдаТогда(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеАльтернативВыбора(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКогдаТогда(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативаВыбора(ТекущийТокен);
	ТекущийЭлемент = Терминал("КОГДА");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Условие = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("ТОГДА");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Действие = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИначе(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Иначе");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИНАЧЕ");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонстанта(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Константа");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("СтроковаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИСТИНА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Истина;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЛОЖЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Ложь;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("NULL");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Null;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("НЕОПРЕДЕЛЕНО");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Неопределено;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметр(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПараметрЗапроса(ТекущийТокен);
	ТекущийЭлемент = Лексема("&");
	ТекущийЭлемент = Идентифкатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Имя = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАгрегатнаяФункция(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("АгрегатнаяФункция");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "Сумма";
		ТекущийЭлемент = Терминал("СУММА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "Максимум";
		ТекущийЭлемент = Терминал("МАКСИМУМ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "Минимум";
		ТекущийЭлемент = Терминал("МИНИМУМ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "Среднее";
		ТекущийЭлемент = Терминал("СРЕДНЕЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункцияКоличество(ТекущийТокен);
		ТекущийЭлемент = Терминал("КОЛИЧЕСТВО");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалРазлчиныеОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Различные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАргументКоличество(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазлчиныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("РазлчиныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАргументКоличество(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("АргументКоличество");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалФункция(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("Функция");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПодстрока(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПОДСТРОКА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Строка = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачальнаяПозиция = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоСимволов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияГод(ТекущийТокен);
		ТекущийЭлемент = Терминал("ГОД");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКвартал(ТекущийТокен);
		ТекущийЭлемент = Терминал("КВАРТАЛ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМесяц(ТекущийТокен);
		ТекущийЭлемент = Терминал("МЕСЯЦ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньГода(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬГОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДень(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 7 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньМесяца(ТекущийТокен);
		ТекущийЭлемент = Терминал("НЕДЕЛЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 8 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньНедели(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬНЕДЕЛИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 9 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЧас(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЧАС");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 10 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМинута(ТекущийТокен);
		ТекущийЭлемент = Терминал("МИНУТА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 11 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияСекунда(ТекущийТокен);
		ТекущийЭлемент = Терминал("СЕКУНДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 12 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияНачалоПериода(ТекущийТокен);
		ТекущийЭлемент = Терминал("НАЧАЛОПЕРИОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 13 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКонецПериода(ТекущийТокен);
		ТекущийЭлемент = Терминал("КОНЕЦПЕРИОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 14 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДобавитьКДате(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДОБАВИТЬКДАТЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Сдвиг = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 15 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияРазностьДат(ТекущийТокен);
		ТекущийЭлемент = Терминал("РАЗНОСТЬДАТ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата1 = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата2 = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 16 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияIsNull(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЕСТЬNULL");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПроверяемоеЗначение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Действие = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 17 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставление(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРЕДСТАВЛЕНИЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 18 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияредставлениеСсылки(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРЕДСТАВЛЕНИЕССЫЛКИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 19 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТипЗначения(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТИПЗНАЧЕНИЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 20 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДатаВремя(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДАТАВРЕМЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 21 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЗначение(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЗНАЧЕНИЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Идентифкатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентифкатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеАргументаЗначение(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");

	ИначеЕсли НомерВариантаПродукции = 22 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТип(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТИП");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалОписаниеТипа(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");

	Иначе
		ВызватьИсключение "Не удалось выполнить разбор"
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокАргументовДатаВремя(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Константа("ЧисловаяКонстанта");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Аргументы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеАргументовДатаВремя(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ПродолжениеАргументовДатаВремя");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргументы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипПериода(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = Идентифкатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;


	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеАргументаЗначение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВаринатаПродукции("ОпциональноеПродолжениеАргументаЗначение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентифкатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;

	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции


КоличествоПросматриваемыхСимволов = 2;
Инициализировать();

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
