#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Разобрать(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);
	УстановитьБуферТокенов();
	Возврат РезультатРазбора();
КонецФункции

Функция РазобратьВыражение(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);
	УстановитьБуферТокенов();
	Возврат РезультатРазбораВыражения();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Инициализировать();
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентификатор");
КонецПроцедуры

Функция НовыйБуферТокенов()
	Буфер = Новый Структура("ИндексТекущегоЭлемента, Токены");
	Буфер.ИндексТекущегоЭлемента = -1;
	Буфер.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	Возврат Буфер;
КонецФункции

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();
КонецПроцедуры

Процедура ЗаполнитьБуферТокенов()
	МаксимальныйИндекс = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для Индекс = Сдвиг По МаксимальныйИндекс Цикл
			БуферТокенов.Токены[Индекс - Сдвиг] = БуферТокенов.Токены[Индекс];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КоличествоДочитываемых = МаксимальныйИндекс - БуферТокенов.ИндексТекущегоЭлемента;
	Для Сч = 1 По КоличествоДочитываемых Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();
	КонецЦикла;
КонецПроцедуры

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = -1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		Возврат БуферТокенов.Токены[0];
	КонецЕсли;
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	ЗаполнитьБуферТокенов();
	Возврат Токен;
КонецФункции

Процедура УстановитьТекущийТокен()
	ТекущийТокен = СледующийТокенИзБуфера();
КонецПроцедуры

Функция ТипТокенаПросмотра(Смещение)
	Индекс = БуферТокенов.ИндексТекущегоЭлемента + Смещение;
	Если Индекс < 0 Или Индекс >= БуферТокенов.Токены.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Токен = БуферТокенов.Токены[Индекс];
	Если Токен = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Токен.Тип;
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТипТокенаПросмотра(0) <> ТипТерминала Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипТерминала, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Тип;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Лексема(ТипЛексемы)
	Возврат Терминал(ТипЛексемы);
КонецФункции

Функция Идентификатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентификатор", ТипИдентификатора, ТипТокенаПросмотра(0));
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипИдентификатора, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Лексема;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТипТокенаПросмотра(0) <> ТипКонстанты Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипКонстанты, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Значение;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция РезультатРазбора()
	УстановитьТекущийТокен();
	Результат = НеТерминалПакетЗапросов();
	Если ТипТокенаПросмотра(0) <> Неопределено Тогда
		ВызватьИсключениеСинтаксическаяОшибка("ПакетЗапросов");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РезультатРазбораВыражения()
	УстановитьТекущийТокен();
	Результат = НеТерминалВыражение();
	Если ТипТокенаПросмотра(0) <> Неопределено Тогда
		ВызватьИсключениеСинтаксическаяОшибка("Выражение");
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура ВызватьИсключениеСинтаксическаяОшибка(Ожидаемое, ОжидаетсяКонкретныйТокен = Ложь)
	Если ТекущийТокен = Неопределено Тогда
		Если ОжидаетсяКонкретныйТокен Тогда
			ВызватьИсключение "Синтаксическая ошибка. Ожидается """ + Ожидаемое + """";
		Иначе
			ВызватьИсключение "Синтаксическая ошибка. Ожидается следующий токен";
		КонецЕсли;
	ИначеЕсли ОжидаетсяКонкретныйТокен Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, Ожидаемое);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ТипТокенаПросмотра(0) = Неопределено Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается следующий токен";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола);
		ВызватьИсключение ТекстОшибки;
	Иначе
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Неожиданный токен ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТекущийТокен.Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

Функция НеТерминалПакетЗапросов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПакетЗапросов(ТекущийТокен);
	Значение1 = НеТерминалЗапросПакета();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ";" И (ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ")) Цикл
		Лексема(";");
		Значение2 = НеТерминалЗапросПакета();
		ЭтотУзел.Элементы.Добавить(Значение2);
	КонецЦикла;
	Если (ТипТокенаПросмотра(0) = ";") Тогда
		Лексема(";");
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросПакета()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ВЫБРАТЬ") Тогда
		Значение1 = НеТерминалЗапросВыбора();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ") Тогда
		Значение2 = НеТерминалЗапросУничтожения();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЗапросПакета");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросУничтожения()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросУничтожения(ТекущийТокен);
	Терминал("УНИЧТОЖИТЬ");
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЗапросВыбора()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросВыбора(ТекущийТокен);
	Значение1 = НеТерминалОбъединяемыйЗапрос();
	ЭтотУзел.Операторы.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = "ОБЪЕДИНИТЬ") Цикл
		Значение2 = НеТерминалОператорОбъединения();
		ЭтотУзел.Операторы.Добавить(Значение2);
	КонецЦикла;
	Если (ТипТокенаПросмотра(0) = "УПОРЯДОЧИТЬ") Тогда
		Терминал("УПОРЯДОЧИТЬ");
		Терминал("ПО");
		Значение3 = НеТерминалСписокЭлементовУпорядочивания();
		ЭтотУзел.Порядок = Значение3;
		Значение4 = НеТерминалРасширениеСКД();
		Если Значение4 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение4 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ИНДЕКСИРОВАТЬ") Тогда
		Терминал("ИНДЕКСИРОВАТЬ");
		Терминал("ПО");
		Значение5 = НеТерминалСписокВыражений();
		ЭтотУзел.Индекс = Значение5;
		Значение6 = НеТерминалРасширениеСКД();
		Если Значение6 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение6 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ИТОГИ") Тогда
		Терминал("ИТОГИ");
		Значение7 = НеТерминалПоляИтогов();
		ЭтотУзел.ВыраженияИтогов = Значение7;
		Терминал("ПО");
		Значение8 = НеТерминалКонтрольныеТочкиИтогов();
		ЭтотУзел.КонтрольныеТочкиИтогов = Значение8;
		Значение9 = НеТерминалРасширениеСКД();
		Если Значение9 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение9 Цикл
				ЭтотУзел.Операторы[0].ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "АВТОУПОРЯДОЧИВАНИЕ") Тогда
		Терминал("АВТОУПОРЯДОЧИВАНИЕ");
		ЭтотУзел.Автопорядок = Истина;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОбъединяемыйЗапрос()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорЗапроса(ТекущийТокен);
	Терминал("ВЫБРАТЬ");
	Если (ТипТокенаПросмотра(0) = "ПЕРВЫЕ") Тогда
		Терминал("ПЕРВЫЕ");
		Значение1 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение1;
		Если (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.ВыбиратьРазличные = Истина;
			Если (ТипТокенаПросмотра(0) = "РАЗРЕШЕННЫЕ") Тогда
				Терминал("РАЗРЕШЕННЫЕ");
				ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			КонецЕсли;
		ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗРЕШЕННЫЕ") Тогда
			Терминал("РАЗРЕШЕННЫЕ");
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			Если (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
				Терминал("РАЗЛИЧНЫЕ");
				ЭтотУзел.ВыбиратьРазличные = Истина;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
		Терминал("РАЗЛИЧНЫЕ");
		ЭтотУзел.ВыбиратьРазличные = Истина;
		Если (ТипТокенаПросмотра(0) = "ПЕРВЫЕ") Тогда
			Терминал("ПЕРВЫЕ");
			Значение2 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение2;
			Если (ТипТокенаПросмотра(0) = "РАЗРЕШЕННЫЕ") Тогда
				Терминал("РАЗРЕШЕННЫЕ");
				ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			КонецЕсли;
		ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗРЕШЕННЫЕ") Тогда
			Терминал("РАЗРЕШЕННЫЕ");
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
			Если (ТипТокенаПросмотра(0) = "ПЕРВЫЕ") Тогда
				Терминал("ПЕРВЫЕ");
				Значение3 = Константа("ЧисловаяКонстанта");
				ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение3;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗРЕШЕННЫЕ") Тогда
		Терминал("РАЗРЕШЕННЫЕ");
		ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		Если (ТипТокенаПросмотра(0) = "ПЕРВЫЕ") Тогда
			Терминал("ПЕРВЫЕ");
			Значение4 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение4;
			Если (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
				Терминал("РАЗЛИЧНЫЕ");
				ЭтотУзел.ВыбиратьРазличные = Истина;
			КонецЕсли;
		ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.ВыбиратьРазличные = Истина;
			Если (ТипТокенаПросмотра(0) = "ПЕРВЫЕ") Тогда
				Терминал("ПЕРВЫЕ");
				Значение5 = Константа("ЧисловаяКонстанта");
				ЭтотУзел.КоличествоПолучаемыхЗаписей = Значение5;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Значение6 = НеТерминалРасширениеСКД();
	Если Значение6 <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из Значение6 Цикл
			ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
		КонецЦикла;
	КонецЕсли;
	Значение7 = НеТерминалПолеВыборки();
	ЭтотУзел.ВыбираемыеПоля.Добавить(Значение7);
	Значение8 = НеТерминалРасширениеСКД();
	Если Значение8 <> Неопределено Тогда
		Для Каждого ЭлементКоллекции Из Значение8 Цикл
			ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
		КонецЦикла;
	КонецЕсли;
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение9 = НеТерминалПолеВыборки();
		ЭтотУзел.ВыбираемыеПоля.Добавить(Значение9);
		Значение10 = НеТерминалРасширениеСКД();
		Если Значение10 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение10 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если (ТипТокенаПросмотра(0) = "ПОМЕСТИТЬ") Тогда
		Терминал("ПОМЕСТИТЬ");
		Значение11 = Идентификатор("ID_ИмяТаблицы");
		ЭтотУзел.__ТаблицаДляПомещения = Значение11;
		Значение12 = НеТерминалРасширениеСКД();
		Если Значение12 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение12 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ИЗ") Тогда
		Терминал("ИЗ");
		Значение13 = НеТерминалБлокИз();
		ЭтотУзел.Источники = Значение13;
		Значение14 = НеТерминалРасширениеСКД();
		Если Значение14 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение14 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ГДЕ") Тогда
		Терминал("ГДЕ");
		Значение15 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Отбор = Значение15;
		Значение16 = НеТерминалРасширениеСКД();
		Если Значение16 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение16 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "СГРУППИРОВАТЬ") Тогда
		Терминал("СГРУППИРОВАТЬ");
		Терминал("ПО");
		Значение17 = НеТерминалСписокВыраженийМодели();
		ЭтотУзел.Группировка = Значение17;
		Значение18 = НеТерминалРасширениеСКД();
		Если Значение18 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение18 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ИМЕЮЩИЕ") Тогда
		Терминал("ИМЕЮЩИЕ");
		Значение19 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.ОтборСгруппированных = Значение19;
		Значение20 = НеТерминалРасширениеСКД();
		Если Значение20 <> Неопределено Тогда
			Для Каждого ЭлементКоллекции Из Значение20 Цикл
				ЭтотУзел.ОтборыСКД.Добавить(ЭлементКоллекции);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОператорОбъединения()
	РезультатПродукции = Неопределено;
	Терминал("ОБЪЕДИНИТЬ");
	Значение1 = НеТерминалТипОбъединенияЗапроса();
	Значение2 = НеТерминалОбъединяемыйЗапрос();
	Значение2.ТипОбъединения = Значение1;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипОбъединенияЗапроса()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ВСЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединениеВсе(ТекущийТокен);
		Терминал("ВСЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ВЫБРАТЬ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединение(ТекущийТокен);
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ТипОбъединенияЗапроса");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляВыборки()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
	Значение1 = НеТерминалПолеВыборки();
	ЭтотУзел.Добавить(Значение1);
	НеТерминалРасширениеСКД();
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалПолеВыборки();
		ЭтотУзел.Добавить(Значение2);
		НеТерминалРасширениеСКД();
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПолеВыборки()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Выражение = Значение1;
		Если (ТипТокенаПросмотра(0) = "КАК" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
			Значение2 = НеТерминалПсевдоним();
			ЭтотУзел.Псевдоним = Значение2;
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "*") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		Значение3 = НеТерминалВыражениеВсеПоляВыборки();
		ЭтотУзел.Выражение = Значение3;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПолеВыборки");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоляВыборки()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалВыражениеВсеПоля();
	ЭтотУзел.Значение = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоля()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоля(ТекущийТокен);
	Лексема("*");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПсевдоним()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "КАК") Тогда
		Терминал("КАК");
		Значение1 = Идентификатор("ID_ПсевдонимРасширенный");
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
		Значение2 = Идентификатор("ID_Псевдоним");
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Псевдоним");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалБлокИз()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалИсточникДанныхЗапроса();
	ЭтотУзел.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалИсточникДанныхЗапроса();
		ЭтотУзел.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхЗапроса()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Значение1 = НеТерминалИсточникДанных();
	ЭтотУзел.Источник = Значение1;
	Значение2 = НеТерминалСписокСоединений();
	ЭтотУзел.Соединения = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокСоединений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокСоединений(ТекущийТокен);
	Пока (((ТипТокенаПросмотра(0) = "{" И (ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ")) Или ((ТипТокенаПросмотра(0) = "ЛЕВОЕ" Или ТипТокенаПросмотра(0) = "ПРАВОЕ" Или ТипТокенаПросмотра(0) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(0) = "ПОЛНОЕ") И (ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ"))) Или (ТипТокенаПросмотра(0) = "ЛЕВОЕ" Или ТипТокенаПросмотра(0) = "ПРАВОЕ" Или ТипТокенаПросмотра(0) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(0) = "ПОЛНОЕ")) Цикл
		Значение1 = НеТерминалПраваяЧастьСоединения();
		ЭтотУзел.Добавить(Значение1);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПраваяЧастьСоединения()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ЛЕВОЕ" Или ТипТокенаПросмотра(0) = "ПРАВОЕ" Или ТипТокенаПросмотра(0) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(0) = "ПОЛНОЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
		Значение1 = НеТерминалТипСоединения();
		ЭтотУзел.ТипСоединения = Значение1;
		Терминал("СОЕДИНЕНИЕ");
		Значение2 = НеТерминалИсточникДанныхСоединения();
		ЭтотУзел.Источник = Значение2;
		Терминал("ПО");
		Значение3 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Условие = Значение3;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "{") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
		ЭтотУзел.Опционально = Истина;
		Лексема("{");
		Значение4 = НеТерминалТипСоединения();
		ЭтотУзел.ТипСоединения = Значение4;
		Терминал("СОЕДИНЕНИЕ");
		Значение5 = НеТерминалИсточникДанныхСоединения();
		ЭтотУзел.Источник = Значение5;
		Терминал("ПО");
		Значение6 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Условие = Значение6;
		Лексема("}");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПраваяЧастьСоединения");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхСоединения()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Значение1 = НеТерминалПрисоединяемаяТаблица();
	ЭтотУзел.Источник = Значение1;
	Значение2 = НеТерминалСписокСоединений();
	ЭтотУзел.Соединения = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипСоединения()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ЛЕВОЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияЛевое(ТекущийТокен);
		Терминал("ЛЕВОЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ПРАВОЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПравое(ТекущийТокен);
		Терминал("ПРАВОЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ВНУТРЕННЕЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияВнутреннее(ТекущийТокен);
		Терминал("ВНУТРЕННЕЕ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ПОЛНОЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПолное(ТекущийТокен);
		Терминал("ПОЛНОЕ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ТипСоединения");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанных()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&") Тогда
		Значение1 = НеТерминалИсточникДанныхТаблицаЗначений();
		РезультатПродукции = Значение1;
	ИначеЕсли ((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ID_СРешеткой" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") И (ТипТокенаПросмотра(1) = ".")) Тогда
		Значение2 = НеТерминалИсточникДанныхТаблица();
		РезультатПродукции = Значение2;
	ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
		Значение3 = НеТерминалИсточникДанныхВложенныйЗапрос();
		РезультатПродукции = Значение3;
	ИначеЕсли ((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ID_СРешеткой" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") И (ТипТокенаПросмотра(1) = Неопределено Или ТипТокенаПросмотра(1) = ")" Или ТипТокенаПросмотра(1) = "," Или ТипТокенаПросмотра(1) = ";" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО" Или ТипТокенаПросмотра(1) = "{" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ")) Тогда
		Значение4 = НеТерминалИсточникДанныхВременнаяТаблица();
		РезультатПродукции = Значение4;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ИсточникДанных");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПрисоединяемаяТаблица()
	РезультатПродукции = Неопределено;
	Если ((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ID_СРешеткой" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") И (ТипТокенаПросмотра(1) = ".")) Тогда
		Значение1 = НеТерминалИсточникДанныхТаблица();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
		Значение2 = НеТерминалИсточникДанныхВложенныйЗапрос();
		РезультатПродукции = Значение2;
	ИначеЕсли ((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ID_СРешеткой" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") И (ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО" Или ТипТокенаПросмотра(1) = "{" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ")) Тогда
		Значение3 = НеТерминалИсточникДанныхВременнаяТаблица();
		РезультатПродукции = Значение3;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПрисоединяемаяТаблица");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхТаблицаЗначений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблицаЗначений(ТекущийТокен);
	Лексема("&");
	Значение1 = Идентификатор("ID_Полный");
	ЭтотУзел.ИмяТаблицы = Значение1;
	Значение2 = НеТерминалПсевдоним();
	ЭтотУзел.Псевдоним = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхВременнаяТаблица()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица(ТекущийТокен);
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = Значение1;
	Если (ТипТокенаПросмотра(0) = "КАК" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
		Значение2 = НеТерминалПсевдоним();
		ЭтотУзел.Псевдоним = Значение2;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхТаблица()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблица(ТекущийТокен);
	Значение1 = Идентификатор("ID_ИмяТаблицы");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение1;
	Значение2 = Лексема(".");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение2;
	Значение3 = Идентификатор("ID_Полный");
	ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение3;
	Пока (ТипТокенаПросмотра(0) = ".") Цикл
		Значение4 = Лексема(".");
		ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение4;
		Значение5 = Идентификатор("ID_Полный");
		ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + Значение5;
	КонецЦикла;
	Если (ТипТокенаПросмотра(0) = "(") Тогда
		Лексема("(");
		Значение6 = НеТерминалСписокПараметров();
		ЭтотУзел.Параметры = Значение6;
		Лексема(")");
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "КАК" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
		Значение7 = НеТерминалПсевдоним();
		ЭтотУзел.Псевдоним = Значение7;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалИсточникДанныхВложенныйЗапрос()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВложенныйЗапрос(ТекущийТокен);
	Лексема("(");
	Значение1 = НеТерминалЗапросВыбора();
	ЭтотУзел.ЗапросВыбора = Значение1;
	Лексема(")");
	Значение2 = НеТерминалПсевдоним();
	ЭтотУзел.Псевдоним = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокПараметров()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокПараметров(ТекущийТокен);
	Значение1 = НеТерминалПараметрТаблицы();
	ЭтотУзел.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалПараметрТаблицы();
		ЭтотУзел.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПараметрТаблицы()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = ")" Или ТипТокенаПросмотра(0) = ",") Тогда
		РезультатПродукции = Неопределено;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ПараметрТаблицы");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокЭлементовУпорядочивания()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементыПорядка(ТекущийТокен);
	Значение1 = НеТерминалЭлементУпорядочивания();
	ЭтотУзел.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалЭлементУпорядочивания();
		ЭтотУзел.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЭлементУпорядочивания()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементПорядка(ТекущийТокен);
	Значение1 = НеТерминалВыражениеМоделиЗапроса();
	ЭтотУзел.Выражение = Значение1;
	Если (ТипТокенаПросмотра(0) = "ИЕРАРХИЯ") Тогда
		Терминал("ИЕРАРХИЯ");
		ЭтотУзел.Иерархия = Истина;
	КонецЕсли;
	Если (ТипТокенаПросмотра(0) = "ВОЗР" Или ТипТокенаПросмотра(0) = "УБЫВ") Тогда
		Значение2 = НеТерминалНаправлениеУпорядочивания();
		ЭтотУзел.Направление = Значение2;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалНаправлениеУпорядочивания()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ВОЗР") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеВозрастание(ТекущийТокен);
		Терминал("ВОЗР");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "УБЫВ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеУбывание(ТекущийТокен);
		Терминал("УБЫВ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("НаправлениеУпорядочивания");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляИтогов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыраженияИтогов(ТекущийТокен);
	Если (ТипТокенаПросмотра(0) = "*" Или ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение1 = НеТерминалПолеВыборки();
		ЭтотУзел.Добавить(Значение1);
		Пока (ТипТокенаПросмотра(0) = ",") Цикл
			Лексема(",");
			Значение2 = НеТерминалПолеВыборки();
			ЭтотУзел.Добавить(Значение2);
			НеТерминалРасширениеСКД();
		КонецЦикла;
	КонецЕсли;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонтрольныеТочкиИтогов()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольныеТочкиИтогов(ТекущийТокен);
	Значение1 = НеТерминалКонтрольнаяТочкаИтогов();
	ЭтотУзел.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалКонтрольнаяТочкаИтогов();
		ЭтотУзел.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонтрольнаяТочкаИтогов()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольнаяТочкаИтогов(ТекущийТокен);
		Значение1 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Выражение = Значение1;
		Значение2 = НеТерминалТипКонтрольнойТочки();
		ЭтотУзел.ТипКонтрольнойТочки = Значение2;
		Если (ТипТокенаПросмотра(0) = "ПЕРИОДАМИ") Тогда
			Терминал("ПЕРИОДАМИ");
			Лексема("(");
			Если (ТипТокенаПросмотра(0) = "СЕКУНДА") Тогда
				Значение3 = Терминал("СЕКУНДА");
				Значение4 = Значение3;
			ИначеЕсли (ТипТокенаПросмотра(0) = "МИНУТА") Тогда
				Значение5 = Терминал("МИНУТА");
				Значение4 = Значение5;
			ИначеЕсли (ТипТокенаПросмотра(0) = "ЧАС") Тогда
				Значение6 = Терминал("ЧАС");
				Значение4 = Значение6;
			ИначеЕсли (ТипТокенаПросмотра(0) = "ДЕНЬ") Тогда
				Значение7 = Терминал("ДЕНЬ");
				Значение4 = Значение7;
			ИначеЕсли (ТипТокенаПросмотра(0) = "НЕДЕЛЯ") Тогда
				Значение8 = Терминал("НЕДЕЛЯ");
				Значение4 = Значение8;
			ИначеЕсли (ТипТокенаПросмотра(0) = "МЕСЯЦ") Тогда
				Значение9 = Терминал("МЕСЯЦ");
				Значение4 = Значение9;
			ИначеЕсли (ТипТокенаПросмотра(0) = "ГОД") Тогда
				Значение10 = Терминал("ГОД");
				Значение4 = Значение10;
			ИначеЕсли (ТипТокенаПросмотра(0) = "ДЕКАДА") Тогда
				Значение11 = Терминал("ДЕКАДА");
				Значение4 = Значение11;
			ИначеЕсли (ТипТокенаПросмотра(0) = "ПОЛУГОДИЕ") Тогда
				Значение12 = Терминал("ПОЛУГОДИЕ");
				Значение4 = Значение12;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
			КонецЕсли;
			ЭтотУзел.ТипДополненияПериодами = Значение4;
			Если (ТипТокенаПросмотра(0) = ",") Тогда
				Лексема(",");
				Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
					Значение13 = НеТерминалВыражение();
					ЭтотУзел.НачалоПериодаДополнения = Значение13;
				Иначе
					ЭтотУзел.НачалоПериодаДополнения = Неопределено;
				КонецЕсли;
				Если (ТипТокенаПросмотра(0) = ",") Тогда
					Лексема(",");
					Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
						Значение14 = НеТерминалВыражение();
						ЭтотУзел.КонецПериодаДополнения = Значение14;
					Иначе
						ЭтотУзел.КонецПериодаДополнения = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Лексема(")");
		КонецЕсли;
		Если (ТипТокенаПросмотра(0) = "КАК") Тогда
			Если (ТипТокенаПросмотра(0) = "КАК") Тогда
				Терминал("КАК");
				Значение15 = Идентификатор("ID_ПсевдонимРасширенный");
				ЭтотУзел.ИмяКолонки = Значение15;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
			КонецЕсли;
		ИначеЕсли (ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИТОГИ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ЛЕВОЕ" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПОЛНОЕ" Или ТипТокенаПросмотра(0) = "ПРАВОЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
			Значение16 = Идентификатор("ID_ПсевдонимКонтрольнойТочкиИтогов");
			ЭтотУзел.ИмяКолонки = Значение16;
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ОБЩИЕ" И (ТипТокенаПросмотра(1) = "КАК")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
		Терминал("ОБЩИЕ");
		Терминал("КАК");
		Идентификатор("ID_ПсевдонимРасширенный");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ОБЩИЕ" И (ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
		Терминал("ОБЩИЕ");
		Идентификатор("ID_Псевдоним");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ОБЩИЕ" И (ТипТокенаПросмотра(1) = Неопределено Или ТипТокенаПросмотра(1) = ")" Или ТипТокенаПросмотра(1) = "," Или ТипТокенаПросмотра(1) = ";" Или ТипТокенаПросмотра(1) = "{" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
		Терминал("ОБЩИЕ");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("КонтрольнаяТочкаИтогов");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипКонтрольнойТочки()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ТОЛЬКО") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиТолькоИерархия(ТекущийТокен);
		Терминал("ТОЛЬКО");
		Терминал("ИЕРАРХИЯ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ИЕРАРХИЯ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиИерархия(ТекущийТокен);
		Терминал("ИЕРАРХИЯ");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "КАК" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "БУЛЕВО" Или ТипТокенаПросмотра(0) = "ВСЕ" Или ТипТокенаПросмотра(0) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(0) = "ИТОГИ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦ" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ЛЕВОЕ" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПОЛНОЕ" Или ТипТокенаПросмотра(0) = "ПРАВОЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СТРОКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(0) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "ЧИСЛО" Или ТипТокенаПросмотра(0) = "{" Или ТипТокенаПросмотра(0) = ")" Или ТипТокенаПросмотра(0) = "," Или ТипТокенаПросмотра(0) = ";" Или ТипТокенаПросмотра(0) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(0) = "ПЕРИОДАМИ" Или ТипТокенаПросмотра(0) = Неопределено) Тогда
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ТипКонтрольнойТочки");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалРасширениеСКД()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "{" И (ТипТокенаПросмотра(1) = "ГДЕ")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
		Лексема("{");
		Терминал("ГДЕ");
		Значение1 = НеТерминалПолеВыборки();
		ЭтотУзел.Добавить(Значение1);
		Пока (ТипТокенаПросмотра(0) = ",") Цикл
			Лексема(",");
			Значение2 = НеТерминалПолеВыборки();
			ЭтотУзел.Добавить(Значение2);
		КонецЦикла;
		Лексема("}");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "{" И (ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ")) Тогда
		Лексема("{");
		Если (ТипТокенаПросмотра(0) = "ВЫБРАТЬ") Тогда
			Терминал("ВЫБРАТЬ");
		ИначеЕсли (ТипТокенаПросмотра(0) = "УПОРЯДОЧИТЬ") Тогда
			Терминал("УПОРЯДОЧИТЬ");
			Терминал("ПО");
		ИначеЕсли (ТипТокенаПросмотра(0) = "ИТОГИ") Тогда
			Терминал("ИТОГИ");
			Терминал("ПО");
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("РасширениеСКД");
		КонецЕсли;
		НеТерминалПолеВыборки();
		Пока (ТипТокенаПросмотра(0) = ",") Цикл
			Лексема(",");
			НеТерминалПолеВыборки();
		КонецЦикла;
		Лексема("}");
		РезультатПродукции = Неопределено;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(0) = "*" Или ТипТокенаПросмотра(0) = "ПО" Или ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = ")" Или ТипТокенаПросмотра(0) = "ГДЕ" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "," Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = ";" Или ТипТокенаПросмотра(0) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(0) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(0) = "ИТОГИ" Или ТипТокенаПросмотра(0) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(0) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(0) = "ИЗ" Или ТипТокенаПросмотра(0) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(0) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = Неопределено) Тогда
		РезультатПродукции = Неопределено;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("РасширениеСКД");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражение()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалЛогическоеСлагаемое();
	Значение1 = Значение2;
	Пока (ТипТокенаПросмотра(0) = "ИЛИ") Цикл
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = Значение1;
		Значение3 = Терминал("ИЛИ");
		ЭтотУзел.Операция = Значение3;
		Значение4 = НеТерминалЛогическоеСлагаемое();
		ЭтотУзел.ПраваяЧасть = Значение4;
		Значение1 = ЭтотУзел;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическоеСлагаемое()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалЛогическийМножитель();
	Значение1 = Значение2;
	Пока (ТипТокенаПросмотра(0) = "И") Цикл
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = Значение1;
		Значение3 = Терминал("И");
		ЭтотУзел.Операция = Значение3;
		Значение4 = НеТерминалЛогическийМножитель();
		ЭтотУзел.ПраваяЧасть = Значение4;
		Значение1 = ЭтотУзел;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическийМножитель()
	РезультатПродукции = Неопределено;
	Значение1 = НеТерминалЛогическаяОперация();
	Значение2 = Значение1;
	Если (((ТипТокенаПросмотра(0) = "МЕЖДУ" И (ТипТокенаПросмотра(1) = "&" Или ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "+" Или ТипТокенаПросмотра(1) = "-" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(1) = "ЧисловаяКонстанта")) Или (ТипТокенаПросмотра(0) = "ССЫЛКА" И (ТипТокенаПросмотра(1) = "ID")) Или (ТипТокенаПросмотра(0) = "ЕСТЬ" И (ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "НЕ")) Или (ТипТокенаПросмотра(0) = "В" И (ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ")) Или (ТипТокенаПросмотра(0) = "НЕ" И (ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "МЕЖДУ"))) Или (ТипТокенаПросмотра(0) = "МЕЖДУ" Или ТипТокенаПросмотра(0) = "ЕСТЬ" Или ТипТокенаПросмотра(0) = "В" Или ТипТокенаПросмотра(0) = "НЕ")) Тогда
		Значение3 = НеТерминалЛогическийОператор();
		Значение3.Операнд = Значение2;
		Значение2 = Значение3;
	КонецЕсли;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическийОператор()
	РезультатПродукции = Неопределено;
	Если (((ТипТокенаПросмотра(0) = "МЕЖДУ" И (ТипТокенаПросмотра(1) = "&" Или ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "+" Или ТипТокенаПросмотра(1) = "-" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(1) = "ЧисловаяКонстанта")) Или (ТипТокенаПросмотра(0) = "НЕ" И (ТипТокенаПросмотра(1) = "МЕЖДУ"))) Или ТипТокенаПросмотра(0) = "МЕЖДУ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорМежду(ТекущийТокен);
		Если (ТипТокенаПросмотра(0) = "НЕ") Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		Терминал("МЕЖДУ");
		Значение1 = НеТерминалОперандСравнения();
		ЭтотУзел.НачалоИнтервала = Значение1;
		Терминал("И");
		Значение2 = НеТерминалОперандСравнения();
		ЭтотУзел.КонецИнтервала = Значение2;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиТипа(ТекущийТокен);
		Терминал("ССЫЛКА");
		Значение3 = НеТерминалТипСсылочногоПоля();
		ЭтотУзел.ТипСсылочногоПоля = Значение3;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЕСТЬ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиНаNULL(ТекущийТокен);
		Терминал("ЕСТЬ");
		Если (ТипТокенаПросмотра(0) = "НЕ") Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		Терминал("NULL");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (((ТипТокенаПросмотра(0) = "В" И (ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ")) Или (ТипТокенаПросмотра(0) = "НЕ" И (ТипТокенаПросмотра(1) = "В"))) Или ТипТокенаПросмотра(0) = "В") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорВ(ТекущийТокен);
		Если (ТипТокенаПросмотра(0) = "НЕ") Тогда
			Терминал("НЕ");
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		Терминал("В");
		Если (ТипТокенаПросмотра(0) = "ИЕРАРХИИ") Тогда
			Терминал("ИЕРАРХИИ");
			ЭтотУзел.Иерархия = Истина;
		КонецЕсли;
		Лексема("(");
		Значение4 = НеТерминалОперандВ();
		ЭтотУзел.Список = Значение4;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЛогическийОператор");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипСсылочногоПоля()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСсылочногоПоля(ТекущийТокен);
	Значение1 = Идентификатор("ID_ГруппаТипаСсылки");
	ЭтотУзел.Группа = Значение1;
	Лексема(".");
	Значение2 = Идентификатор("ID_ИмяТипа");
	ЭтотУзел.Таблица = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперандВ()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение1 = НеТерминалСписокВыражений();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ВЫБРАТЬ") Тогда
		Значение2 = НеТерминалЗапросВыбора();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОперандВ");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическаяОперация()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "НЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЛогическоеОтрицание(ТекущийТокен);
		Терминал("НЕ");
		Пока (ТипТокенаПросмотра(0) = "НЕ") Цикл
			Терминал("НЕ");
			ЭтотУзел.Количество = ЭтотУзел.Количество + 1;
		КонецЦикла;
		Значение1 = НеТерминалЛогическаяОперацияБезОтрицания();
		ЭтотУзел.Выражение = Значение1;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение2 = НеТерминалЛогическаяОперацияБезОтрицания();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперация");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалЛогическаяОперацияБезОтрицания()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалОперандСравнения();
	Значение1 = Значение2;
	Пока (ТипТокенаПросмотра(0) = "=" Или ТипТокенаПросмотра(0) = "<>" Или ТипТокенаПросмотра(0) = ">" Или ТипТокенаПросмотра(0) = "<" Или ТипТокенаПросмотра(0) = ">=" Или ТипТокенаПросмотра(0) = "<=") Цикл
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = Значение1;
		Если (ТипТокенаПросмотра(0) = "=") Тогда
			Значение3 = Лексема("=");
			Значение4 = Значение3;
		ИначеЕсли (ТипТокенаПросмотра(0) = "<>") Тогда
			Значение5 = Лексема("<>");
			Значение4 = Значение5;
		ИначеЕсли (ТипТокенаПросмотра(0) = ">") Тогда
			Значение6 = Лексема(">");
			Значение4 = Значение6;
		ИначеЕсли (ТипТокенаПросмотра(0) = "<") Тогда
			Значение7 = Лексема("<");
			Значение4 = Значение7;
		ИначеЕсли (ТипТокенаПросмотра(0) = ">=") Тогда
			Значение8 = Лексема(">=");
			Значение4 = Значение8;
		ИначеЕсли (ТипТокенаПросмотра(0) = "<=") Тогда
			Значение9 = Лексема("<=");
			Значение4 = Значение9;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("ЛогическаяОперацияБезОтрицания");
		КонецЕсли;
		ЭтотУзел.Операция = Значение4;
		Значение10 = НеТерминалОперандСравнения();
		ЭтотУзел.ПраваяЧасть = Значение10;
		Значение1 = ЭтотУзел;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперандСравнения()
	РезультатПродукции = Неопределено;
	Значение1 = НеТерминалАрифметическоеВыражение();
	Значение2 = Значение1;
	Если (((ТипТокенаПросмотра(0) = "НЕ" И (ТипТокенаПросмотра(1) = "ПОДОБНО")) Или (ТипТокенаПросмотра(0) = "ПОДОБНО" И (ТипТокенаПросмотра(1) = "&" Или ТипТокенаПросмотра(1) = "СтроковаяКонстанта"))) Или ТипТокенаПросмотра(0) = "ПОДОБНО") Тогда
		Значение3 = НеТерминалОператорПодобно();
		Значение3.Операнд = Значение2;
		Значение2 = Значение3;
	КонецЕсли;
	РезультатПродукции = Значение2;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОператорПодобно()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПодобно(ТекущийТокен);
	Если (ТипТокенаПросмотра(0) = "НЕ") Тогда
		Терминал("НЕ");
		ЭтотУзел.Инверсия = Истина;
	КонецЕсли;
	Терминал("ПОДОБНО");
	Значение1 = НеТерминалШаблонПодобия();
	ЭтотУзел.Шаблон = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалШаблонПодобия()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "СтроковаяКонстанта") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение1 = Константа("СтроковаяКонстанта");
		ЭтотУзел.Значение = Значение1;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "&") Тогда
		Значение2 = НеТерминалПараметр();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ШаблонПодобия");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалАрифметическоеВыражение()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалСлагаемое();
	Значение1 = Значение2;
	Пока (ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-") Цикл
		Если (ТипТокенаПросмотра(0) = "+") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Лексема("+");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалСлагаемое();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		ИначеЕсли (ТипТокенаПросмотра(0) = "-") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение5 = Лексема("-");
			ЭтотУзел.Операция = Значение5;
			Значение6 = НеТерминалСлагаемое();
			ЭтотУзел.ПраваяЧасть = Значение6;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("АрифметическоеВыражение");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСлагаемое()
	РезультатПродукции = Неопределено;
	Значение2 = НеТерминалМножитель();
	Значение1 = Значение2;
	Пока (ТипТокенаПросмотра(0) = "*" Или ТипТокенаПросмотра(0) = "/" Или ТипТокенаПросмотра(0) = "%") Цикл
		Если (ТипТокенаПросмотра(0) = "*") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение3 = Лексема("*");
			ЭтотУзел.Операция = Значение3;
			Значение4 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение4;
			Значение1 = ЭтотУзел;
		ИначеЕсли (ТипТокенаПросмотра(0) = "/") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение5 = Лексема("/");
			ЭтотУзел.Операция = Значение5;
			Значение6 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение6;
			Значение1 = ЭтотУзел;
		ИначеЕсли (ТипТокенаПросмотра(0) = "%") Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
			ЭтотУзел.ЛеваяЧасть = Значение1;
			Значение7 = Лексема("%");
			ЭтотУзел.Операция = Значение7;
			Значение8 = НеТерминалМножитель();
			ЭтотУзел.ПраваяЧасть = Значение8;
			Значение1 = ЭтотУзел;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Слагаемое");
		КонецЕсли;
	КонецЦикла;
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалУнарнаяОперация()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйУнарнаяОперация(ТекущийТокен);
	Если (ТипТокенаПросмотра(0) = "-") Тогда
		Значение1 = Лексема("-");
		ЭтотУзел.Знаки.Добавить(Значение1);
	ИначеЕсли (ТипТокенаПросмотра(0) = "+") Тогда
		Значение2 = Лексема("+");
		ЭтотУзел.Знаки.Добавить(Значение2);
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("УнарнаяОперация");
	КонецЕсли;
	Пока (ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "+") Цикл
		Если (ТипТокенаПросмотра(0) = "-") Тогда
			Значение3 = Лексема("-");
			ЭтотУзел.Знаки.Добавить(Значение3);
		ИначеЕсли (ТипТокенаПросмотра(0) = "+") Тогда
			Значение4 = Лексема("+");
			ЭтотУзел.Знаки.Добавить(Значение4);
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("УнарнаяОперация");
		КонецЕсли;
	КонецЦикла;
	Значение5 = НеТерминалОперанд();
	ЭтотУзел.Выражение = Значение5;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалМножитель()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение1 = НеТерминалОперанд();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-") Тогда
		Значение2 = НеТерминалУнарнаяОперация();
		РезультатПродукции = Значение2;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Множитель");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОперанд()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ВЫБОР") Тогда
		Значение1 = НеТерминалВыбор();
		РезультатПродукции = Значение1;
	ИначеЕсли (((ТипТокенаПросмотра(0) = "(" И (ТипТокенаПросмотра(1) = "&" Или ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "+" Или ТипТокенаПросмотра(1) = "-" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(1) = "ЧисловаяКонстанта")) Или (ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" И (ТипТокенаПросмотра(1) = "(")) Или ((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ЧАС") И (ТипТокенаПросмотра(1) = Неопределено Или ТипТокенаПросмотра(1) = "%" Или ТипТокенаПросмотра(1) = ")" Или ТипТокенаПросмотра(1) = "*" Или ТипТокенаПросмотра(1) = "+" Или ТипТокенаПросмотра(1) = "," Или ТипТокенаПросмотра(1) = "-" Или ТипТокенаПросмотра(1) = "." Или ТипТокенаПросмотра(1) = "/" Или ТипТокенаПросмотра(1) = ";" Или ТипТокенаПросмотра(1) = "<" Или ТипТокенаПросмотра(1) = "<=" Или ТипТокенаПросмотра(1) = "<>" Или ТипТокенаПросмотра(1) = "=" Или ТипТокенаПросмотра(1) = ">" Или ТипТокенаПросмотра(1) = ">=" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(1) = "{" Или ТипТокенаПросмотра(1) = "}" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ВОЗР" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬ" Или ТипТокенаПросмотра(1) = "И" Или ТипТокенаПросмотра(1) = "ИЗ" Или ТипТокенаПросмотра(1) = "ИЛИ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНАЧЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "КОГДА" Или ТипТокенаПросмотра(1) = "МЕЖДУ" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "ПЕРИОДАМИ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОДОБНО" Или ТипТокенаПросмотра(1) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ТОГДА" Или ТипТокенаПросмотра(1) = "ТОЛЬКО" Или ТипТокенаПросмотра(1) = "УБЫВ"))) Или (ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА")) Тогда
		Значение2 = НеТерминалПоле();
		РезультатПродукции = Значение2;
	ИначеЕсли (ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО") Тогда
		Значение3 = НеТерминалКонстанта();
		РезультатПродукции = Значение3;
	ИначеЕсли (ТипТокенаПросмотра(0) = "&") Тогда
		Значение4 = НеТерминалПараметр();
		РезультатПродукции = Значение4;
	ИначеЕсли ((ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО") И (ТипТокенаПросмотра(1) = "(")) Тогда
		Значение5 = НеТерминалАгрегатнаяФункция();
		РезультатПродукции = Значение5;
	ИначеЕсли ((ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП") И (ТипТокенаПросмотра(1) = "(")) Тогда
		Значение6 = НеТерминалФункция();
		РезультатПродукции = Значение6;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Операнд");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоле()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ЧАС") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		Если (((ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ЧАС") И (ТипТокенаПросмотра(1) = Неопределено Или ТипТокенаПросмотра(1) = "%" Или ТипТокенаПросмотра(1) = ")" Или ТипТокенаПросмотра(1) = "*" Или ТипТокенаПросмотра(1) = "+" Или ТипТокенаПросмотра(1) = "," Или ТипТокенаПросмотра(1) = "-" Или ТипТокенаПросмотра(1) = "." Или ТипТокенаПросмотра(1) = "/" Или ТипТокенаПросмотра(1) = ";" Или ТипТокенаПросмотра(1) = "<" Или ТипТокенаПросмотра(1) = "<=" Или ТипТокенаПросмотра(1) = "<>" Или ТипТокенаПросмотра(1) = "=" Или ТипТокенаПросмотра(1) = ">" Или ТипТокенаПросмотра(1) = ">=" Или ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(1) = "{" Или ТипТокенаПросмотра(1) = "}" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ВОЗР" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬ" Или ТипТокенаПросмотра(1) = "И" Или ТипТокенаПросмотра(1) = "ИЗ" Или ТипТокенаПросмотра(1) = "ИЛИ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНАЧЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "КОГДА" Или ТипТокенаПросмотра(1) = "МЕЖДУ" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "ПЕРИОДАМИ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОДОБНО" Или ТипТокенаПросмотра(1) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ТОГДА" Или ТипТокенаПросмотра(1) = "ТОЛЬКО" Или ТипТокенаПросмотра(1) = "УБЫВ")) Или (ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "ССЫЛКА" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ЧАС")) Тогда
			Значение1 = Идентификатор("ID_ПолеБезРазыменования");
			Значение2 = Значение1;
		ИначеЕсли (ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" И (ТипТокенаПросмотра(1) = "(")) Тогда
			Значение3 = НеТерминалПриведениеТипа();
			Значение2 = Значение3;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Поле");
		КонецЕсли;
		ЭтотУзел.Элементы.Добавить(Значение2);
		Пока (ТипТокенаПросмотра(0) = "." И (ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ВОЗР" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "И" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "ИЗ" Или ТипТокенаПросмотра(1) = "ИЛИ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНАЧЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОГДА" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕЖДУ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПЕРВЫЕ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОДОБНО" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗЛИЧНЫЕ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "РАЗРЕШЕННЫЕ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ТОГДА" Или ТипТокенаПросмотра(1) = "ТОЛЬКО" Или ТипТокенаПросмотра(1) = "УБЫВ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО")) Цикл
			Лексема(".");
			Значение4 = Идентификатор("ID_Полный");
			ЭтотУзел.Элементы.Добавить(Значение4);
		КонецЦикла;
		Если (ТипТокенаПросмотра(0) = ".") Тогда
			Лексема(".");
			Если (ТипТокенаПросмотра(0) = "*") Тогда
				Значение5 = НеТерминалВыражениеВсеПоляИсточника();
				Значение6 = Значение5;
			ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
				Значение7 = НеТерминалПоляВложеннойТаблицы();
				Значение6 = Значение7;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("Поле");
			КонецЕсли;
			ЭтотУзел.Элементы.Добавить(Значение6);
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
		Если (ТипТокенаПросмотра(0) = "(") Тогда
			Лексема("(");
			Значение9 = НеТерминалСписокВыражений();
			Лексема(")");
			Значение8 = Значение9;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("Поле");
		КонецЕсли;
		Значение10 = Значение8;
		Если (ТипТокенаПросмотра(0) = ".") Тогда
			Значение11 = НеТерминалРазыменованиеПослеСкобок();
			Значение11.Элементы.Вставить(0, Значение10);
			Значение10 = Значение11;
		КонецЕсли;
		РезультатПродукции = Значение10;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Поле");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалРазыменованиеПослеСкобок()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "." И (ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ВОЗР" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "И" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "ИЗ" Или ТипТокенаПросмотра(1) = "ИЛИ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНАЧЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОГДА" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕЖДУ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПЕРВЫЕ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОДОБНО" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗЛИЧНЫЕ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "РАЗРЕШЕННЫЕ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ТОГДА" Или ТипТокенаПросмотра(1) = "ТОЛЬКО" Или ТипТокенаПросмотра(1) = "УБЫВ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		Лексема(".");
		Значение1 = Идентификатор("ID_Полный");
		ЭтотУзел.Элементы.Добавить(Значение1);
		Пока (ТипТокенаПросмотра(0) = "." И (ТипТокенаПросмотра(1) = "ID" Или ТипТокенаПросмотра(1) = "NULL" Или ТипТокенаПросмотра(1) = "АВТОУПОРЯДОЧИВАНИЕ" Или ТипТокенаПросмотра(1) = "БУЛЕВО" Или ТипТокенаПросмотра(1) = "В" Или ТипТокенаПросмотра(1) = "ВНУТРЕННЕЕ" Или ТипТокенаПросмотра(1) = "ВОЗР" Или ТипТокенаПросмотра(1) = "ВСЕ" Или ТипТокенаПросмотра(1) = "ВЫБОР" Или ТипТокенаПросмотра(1) = "ВЫБРАТЬ" Или ТипТокенаПросмотра(1) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(1) = "ГДЕ" Или ТипТокенаПросмотра(1) = "ГОД" Или ТипТокенаПросмотра(1) = "ДАТА" Или ТипТокенаПросмотра(1) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(1) = "ДЕНЬ" Или ТипТокенаПросмотра(1) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(1) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(1) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(1) = "ЕСТЬ" Или ТипТокенаПросмотра(1) = "ЕСТЬNULL" Или ТипТокенаПросмотра(1) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(1) = "И" Или ТипТокенаПросмотра(1) = "ИЕРАРХИИ" Или ТипТокенаПросмотра(1) = "ИЕРАРХИЯ" Или ТипТокенаПросмотра(1) = "ИЗ" Или ТипТокенаПросмотра(1) = "ИЛИ" Или ТипТокенаПросмотра(1) = "ИМЕЮЩИЕ" Или ТипТокенаПросмотра(1) = "ИНАЧЕ" Или ТипТокенаПросмотра(1) = "ИНДЕКСИРОВАТЬ" Или ТипТокенаПросмотра(1) = "ИСТИНА" Или ТипТокенаПросмотра(1) = "ИТОГИ" Или ТипТокенаПросмотра(1) = "КАК" Или ТипТокенаПросмотра(1) = "КВАРТАЛ" Или ТипТокенаПросмотра(1) = "КОГДА" Или ТипТокенаПросмотра(1) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(1) = "КОНЕЦ" Или ТипТокенаПросмотра(1) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(1) = "ЛЕВОЕ" Или ТипТокенаПросмотра(1) = "ЛОЖЬ" Или ТипТокенаПросмотра(1) = "МАКСИМУМ" Или ТипТокенаПросмотра(1) = "МЕЖДУ" Или ТипТокенаПросмотра(1) = "МЕСЯЦ" Или ТипТокенаПросмотра(1) = "МИНИМУМ" Или ТипТокенаПросмотра(1) = "МИНУТА" Или ТипТокенаПросмотра(1) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(1) = "НЕ" Или ТипТокенаПросмотра(1) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(1) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(1) = "ОБЪЕДИНИТЬ" Или ТипТокенаПросмотра(1) = "ПЕРВЫЕ" Или ТипТокенаПросмотра(1) = "ПО" Или ТипТокенаПросмотра(1) = "ПОДОБНО" Или ТипТокенаПросмотра(1) = "ПОДСТРОКА" Или ТипТокенаПросмотра(1) = "ПОЛНОЕ" Или ТипТокенаПросмотра(1) = "ПОМЕСТИТЬ" Или ТипТокенаПросмотра(1) = "ПРАВОЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(1) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(1) = "РАЗЛИЧНЫЕ" Или ТипТокенаПросмотра(1) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(1) = "РАЗРЕШЕННЫЕ" Или ТипТокенаПросмотра(1) = "СГРУППИРОВАТЬ" Или ТипТокенаПросмотра(1) = "СЕКУНДА" Или ТипТокенаПросмотра(1) = "СОЕДИНЕНИЕ" Или ТипТокенаПросмотра(1) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(1) = "ССЫЛКА" Или ТипТокенаПросмотра(1) = "СТРОКА" Или ТипТокенаПросмотра(1) = "СУММА" Или ТипТокенаПросмотра(1) = "ТИП" Или ТипТокенаПросмотра(1) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(1) = "ТОГДА" Или ТипТокенаПросмотра(1) = "ТОЛЬКО" Или ТипТокенаПросмотра(1) = "УБЫВ" Или ТипТокенаПросмотра(1) = "УНИЧТОЖИТЬ" Или ТипТокенаПросмотра(1) = "УПОРЯДОЧИТЬ" Или ТипТокенаПросмотра(1) = "ЧАС" Или ТипТокенаПросмотра(1) = "ЧИСЛО")) Цикл
			Лексема(".");
			Значение2 = Идентификатор("ID_Полный");
			ЭтотУзел.Элементы.Добавить(Значение2);
		КонецЦикла;
		Если (ТипТокенаПросмотра(0) = ".") Тогда
			Лексема(".");
			Если (ТипТокенаПросмотра(0) = "*") Тогда
				Значение3 = НеТерминалВыражениеВсеПоляИсточника();
				Значение4 = Значение3;
			ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
				Значение5 = НеТерминалПоляВложеннойТаблицы();
				Значение4 = Значение5;
			Иначе
				ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
			КонецЕсли;
			ЭтотУзел.Элементы.Добавить(Значение4);
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "." И (ТипТокенаПросмотра(1) = "(" Или ТипТокенаПросмотра(1) = "*")) Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		Лексема(".");
		Если (ТипТокенаПросмотра(0) = "*") Тогда
			Значение6 = НеТерминалВыражениеВсеПоляИсточника();
			Значение7 = Значение6;
		ИначеЕсли (ТипТокенаПросмотра(0) = "(") Тогда
			Значение8 = НеТерминалПоляВложеннойТаблицы();
			Значение7 = Значение8;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
		КонецЕсли;
		ЭтотУзел.Элементы.Добавить(Значение7);
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("РазыменованиеПослеСкобок");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеВсеПоляИсточника()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоляИсточника(ТекущийТокен);
	Лексема("*");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПоляВложеннойТаблицы()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПоляВложеннойТаблицы(ТекущийТокен);
	Лексема("(");
	Значение1 = НеТерминалПоляВыборки();
	ЭтотУзел.Элементы = Значение1;
	Лексема(")");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокВыражений()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалВыражение();
		ЭтотУзел.Элементы.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыражениеМоделиЗапроса()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Значение = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалСписокВыраженийМодели()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	Значение1 = НеТерминалВыражениеМоделиЗапроса();
	ЭтотУзел.Элементы.Добавить(Значение1);
	Пока (ТипТокенаПросмотра(0) = ",") Цикл
		Лексема(",");
		Значение2 = НеТерминалВыражениеМоделиЗапроса();
		ЭтотУзел.Элементы.Добавить(Значение2);
	КонецЦикла;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПриведениеТипа()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПриведениеТипа(ТекущийТокен);
	Терминал("ВЫРАЗИТЬ");
	Лексема("(");
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Выражение = Значение1;
	Терминал("КАК");
	Значение2 = НеТерминалОписаниеТипа();
	ЭтотУзел.ОписаниеТипа = Значение2;
	Лексема(")");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалОписаниеТипа()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ID") Тогда
		Значение1 = НеТерминалТипСсылочногоПоля();
		РезультатПродукции = Значение1;
	ИначеЕсли (ТипТокенаПросмотра(0) = "БУЛЕВО") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаБулево(ТекущийТокен);
		Терминал("БУЛЕВО");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДАТА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаДата(ТекущийТокен);
		Терминал("ДАТА");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЧИСЛО") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаЧисло(ТекущийТокен);
		Терминал("ЧИСЛО");
		Если (ТипТокенаПросмотра(0) = "(") Тогда
			Лексема("(");
			Значение2 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.Длина = Значение2;
			Если (ТипТокенаПросмотра(0) = "," И (ТипТокенаПросмотра(1) = "ЧисловаяКонстанта")) Тогда
				Если (ТипТокенаПросмотра(0) = ",") Тогда
					Лексема(",");
					Значение3 = Константа("ЧисловаяКонстанта");
					ЭтотУзел.Точность = Значение3;
				Иначе
					ВызватьИсключениеСинтаксическаяОшибка("ОписаниеТипа");
				КонецЕсли;
			ИначеЕсли (ТипТокенаПросмотра(0) = "," И (ТипТокенаПросмотра(1) = ")")) Тогда
				Лексема(",");
			КонецЕсли;
			Лексема(")");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "СТРОКА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаСтрока(ТекущийТокен);
		Терминал("СТРОКА");
		Если (ТипТокенаПросмотра(0) = "(") Тогда
			Лексема("(");
			Значение4 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.Длина = Значение4;
			Лексема(")");
		КонецЕсли;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("ОписаниеТипа");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалВыбор()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбор(ТекущийТокен);
	Терминал("ВЫБОР");
	Если (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
		Значение1 = НеТерминалВыражение();
		ЭтотУзел.ВыражениеВыбора = Значение1;
	Иначе
		ЭтотУзел.ВыражениеВыбора = Неопределено;
	КонецЕсли;
	Значение2 = НеТерминалКогдаТогда();
	ЭтотУзел.АльтернативыВыбора.Добавить(Значение2);
	Пока (ТипТокенаПросмотра(0) = "КОГДА") Цикл
		Значение3 = НеТерминалКогдаТогда();
		ЭтотУзел.АльтернативыВыбора.Добавить(Значение3);
	КонецЦикла;
	Если (ТипТокенаПросмотра(0) = "ИНАЧЕ") Тогда
		Терминал("ИНАЧЕ");
		Значение4 = НеТерминалВыражение();
		ЭтотУзел.Иначе = Значение4;
	Иначе
		ЭтотУзел.Иначе = Неопределено;
	КонецЕсли;
	Терминал("КОНЕЦ");
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКогдаТогда()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативаВыбора(ТекущийТокен);
	Терминал("КОГДА");
	Значение1 = НеТерминалВыражение();
	ЭтотУзел.Условие = Значение1;
	Терминал("ТОГДА");
	Значение2 = НеТерминалВыражение();
	ЭтотУзел.Действие = Значение2;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалКонстанта()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "СтроковаяКонстанта") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение1 = Константа("СтроковаяКонстанта");
		ЭтотУзел.Значение = Значение1;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЧисловаяКонстанта") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Значение2 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.Значение = Значение2;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ИСТИНА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("ИСТИНА");
		ЭтотУзел.Значение = Истина;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЛОЖЬ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("ЛОЖЬ");
		ЭтотУзел.Значение = Ложь;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "NULL") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("NULL");
		ЭтотУзел.Значение = Null;
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		Терминал("НЕОПРЕДЕЛЕНО");
		ЭтотУзел.Значение = Неопределено;
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Константа");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалПараметр()
	РезультатПродукции = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПараметрЗапроса(ТекущийТокен);
	Лексема("&");
	Значение1 = Идентификатор("ID_Полный");
	ЭтотУзел.Имя = Значение1;
	РезультатПродукции = ЭтотУзел;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалАгрегатнаяФункция()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "СУММА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение1 = Терминал("СУММА");
		ЭтотУзел.ИмяФункции = Значение1;
		Лексема("(");
		Значение2 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение2;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "МАКСИМУМ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение3 = Терминал("МАКСИМУМ");
		ЭтотУзел.ИмяФункции = Значение3;
		Лексема("(");
		Значение4 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение4;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "МИНИМУМ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение5 = Терминал("МИНИМУМ");
		ЭтотУзел.ИмяФункции = Значение5;
		Лексема("(");
		Значение6 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение6;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "СРЕДНЕЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		Значение7 = Терминал("СРЕДНЕЕ");
		ЭтотУзел.ИмяФункции = Значение7;
		Лексема("(");
		Значение8 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение8;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункцияКоличество(ТекущийТокен);
		Терминал("КОЛИЧЕСТВО");
		Лексема("(");
		Если (ТипТокенаПросмотра(0) = "РАЗЛИЧНЫЕ") Тогда
			Терминал("РАЗЛИЧНЫЕ");
			ЭтотУзел.Различные = Истина;
		КонецЕсли;
		Если (ТипТокенаПросмотра(0) = "*") Тогда
			Значение9 = Лексема("*");
			Значение10 = Значение9;
		ИначеЕсли (ТипТокенаПросмотра(0) = "&" Или ТипТокенаПросмотра(0) = "(" Или ТипТокенаПросмотра(0) = "NULL" Или ТипТокенаПросмотра(0) = "НЕ" Или ТипТокенаПросмотра(0) = "СтроковаяКонстанта" Или ТипТокенаПросмотра(0) = "ВЫРАЗИТЬ" Или ТипТокенаПросмотра(0) = "ВЫБОР" Или ТипТокенаПросмотра(0) = "ЧисловаяКонстанта" Или ТипТокенаПросмотра(0) = "ИСТИНА" Или ТипТокенаПросмотра(0) = "ЛОЖЬ" Или ТипТокенаПросмотра(0) = "НЕОПРЕДЕЛЕНО" Или ТипТокенаПросмотра(0) = "СУММА" Или ТипТокенаПросмотра(0) = "МАКСИМУМ" Или ТипТокенаПросмотра(0) = "МИНИМУМ" Или ТипТокенаПросмотра(0) = "СРЕДНЕЕ" Или ТипТокенаПросмотра(0) = "КОЛИЧЕСТВО" Или ТипТокенаПросмотра(0) = "ПОДСТРОКА" Или ТипТокенаПросмотра(0) = "ГОД" Или ТипТокенаПросмотра(0) = "КВАРТАЛ" Или ТипТокенаПросмотра(0) = "МЕСЯЦ" Или ТипТокенаПросмотра(0) = "ДЕНЬГОДА" Или ТипТокенаПросмотра(0) = "ДЕНЬ" Или ТипТокенаПросмотра(0) = "НЕДЕЛЯ" Или ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ" Или ТипТокенаПросмотра(0) = "ЧАС" Или ТипТокенаПросмотра(0) = "МИНУТА" Или ТипТокенаПросмотра(0) = "СЕКУНДА" Или ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА" Или ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА" Или ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ" Или ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ" Или ТипТокенаПросмотра(0) = "ЕСТЬNULL" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ" Или ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ" Или ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ" Или ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ" Или ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ" Или ТипТокенаПросмотра(0) = "ТИП" Или ТипТокенаПросмотра(0) = "+" Или ТипТокенаПросмотра(0) = "-" Или ТипТокенаПросмотра(0) = "ID" Или ТипТокенаПросмотра(0) = "ДАТА" Или ТипТокенаПросмотра(0) = "ССЫЛКА") Тогда
			Значение11 = НеТерминалВыражение();
			Значение10 = Значение11;
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка("АгрегатнаяФункция");
		КонецЕсли;
		ЭтотУзел.Аргумент = Значение10;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("АгрегатнаяФункция");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалФункция()
	РезультатПродукции = Неопределено;
	Если (ТипТокенаПросмотра(0) = "ПОДСТРОКА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПодстрока(ТекущийТокен);
		Терминал("ПОДСТРОКА");
		Лексема("(");
		Значение1 = НеТерминалВыражение();
		ЭтотУзел.Строка = Значение1;
		Лексема(",");
		Значение2 = НеТерминалВыражение();
		ЭтотУзел.НачальнаяПозиция = Значение2;
		Лексема(",");
		Значение3 = НеТерминалВыражение();
		ЭтотУзел.КоличествоСимволов = Значение3;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ГОД") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияГод(ТекущийТокен);
		Терминал("ГОД");
		Лексема("(");
		Значение4 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение4;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "КВАРТАЛ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКвартал(ТекущийТокен);
		Терминал("КВАРТАЛ");
		Лексема("(");
		Значение5 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение5;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "МЕСЯЦ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМесяц(ТекущийТокен);
		Терминал("МЕСЯЦ");
		Лексема("(");
		Значение6 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение6;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДЕНЬГОДА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньГода(ТекущийТокен);
		Терминал("ДЕНЬГОДА");
		Лексема("(");
		Значение7 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение7;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДЕНЬ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДень(ТекущийТокен);
		Терминал("ДЕНЬ");
		Лексема("(");
		Значение8 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение8;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "НЕДЕЛЯ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньМесяца(ТекущийТокен);
		Терминал("НЕДЕЛЯ");
		Лексема("(");
		Значение9 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение9;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДЕНЬНЕДЕЛИ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньНедели(ТекущийТокен);
		Терминал("ДЕНЬНЕДЕЛИ");
		Лексема("(");
		Значение10 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение10;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЧАС") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЧас(ТекущийТокен);
		Терминал("ЧАС");
		Лексема("(");
		Значение11 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение11;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "МИНУТА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМинута(ТекущийТокен);
		Терминал("МИНУТА");
		Лексема("(");
		Значение12 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение12;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "СЕКУНДА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияСекунда(ТекущийТокен);
		Терминал("СЕКУНДА");
		Лексема("(");
		Значение13 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение13;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "НАЧАЛОПЕРИОДА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияНачалоПериода(ТекущийТокен);
		Терминал("НАЧАЛОПЕРИОДА");
		Лексема("(");
		Значение14 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение14;
		Лексема(",");
		Значение15 = НеТерминалТипПериода();
		ЭтотУзел.ТипПериода = Значение15;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "КОНЕЦПЕРИОДА") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКонецПериода(ТекущийТокен);
		Терминал("КОНЕЦПЕРИОДА");
		Лексема("(");
		Значение16 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение16;
		Лексема(",");
		Значение17 = НеТерминалТипПериода();
		ЭтотУзел.ТипПериода = Значение17;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДОБАВИТЬКДАТЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДобавитьКДате(ТекущийТокен);
		Терминал("ДОБАВИТЬКДАТЕ");
		Лексема("(");
		Значение18 = НеТерминалВыражение();
		ЭтотУзел.Дата = Значение18;
		Лексема(",");
		Значение19 = НеТерминалТипПериода();
		ЭтотУзел.ТипПериода = Значение19;
		Лексема(",");
		Значение20 = НеТерминалВыражение();
		ЭтотУзел.Сдвиг = Значение20;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "РАЗНОСТЬДАТ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияРазностьДат(ТекущийТокен);
		Терминал("РАЗНОСТЬДАТ");
		Лексема("(");
		Значение21 = НеТерминалВыражение();
		ЭтотУзел.Дата1 = Значение21;
		Лексема(",");
		Значение22 = НеТерминалВыражение();
		ЭтотУзел.Дата2 = Значение22;
		Лексема(",");
		Значение23 = НеТерминалТипПериода();
		ЭтотУзел.ТипПериода = Значение23;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЕСТЬNULL") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияIsNull(ТекущийТокен);
		Терминал("ЕСТЬNULL");
		Лексема("(");
		Значение24 = НеТерминалВыражение();
		ЭтотУзел.ПроверяемоеЗначение = Значение24;
		Лексема(",");
		Значение25 = НеТерминалВыражение();
		ЭтотУзел.Действие = Значение25;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставление(ТекущийТокен);
		Терминал("ПРЕДСТАВЛЕНИЕ");
		Лексема("(");
		Значение26 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение26;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ПРЕДСТАВЛЕНИЕССЫЛКИ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставлениеСсылки(ТекущийТокен);
		Терминал("ПРЕДСТАВЛЕНИЕССЫЛКИ");
		Лексема("(");
		Значение27 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение27;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ТИПЗНАЧЕНИЯ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТипЗначения(ТекущийТокен);
		Терминал("ТИПЗНАЧЕНИЯ");
		Лексема("(");
		Значение28 = НеТерминалВыражение();
		ЭтотУзел.Аргумент = Значение28;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ДАТАВРЕМЯ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДатаВремя(ТекущийТокен);
		Терминал("ДАТАВРЕМЯ");
		Лексема("(");
		Значение29 = Константа("ЧисловаяКонстанта");
		ЭтотУзел.Аргументы.Добавить(Значение29);
		Пока (ТипТокенаПросмотра(0) = ",") Цикл
			Лексема(",");
			Значение30 = Константа("ЧисловаяКонстанта");
			ЭтотУзел.Аргументы.Добавить(Значение30);
		КонецЦикла;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ЗНАЧЕНИЕ") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЗначение(ТекущийТокен);
		Терминал("ЗНАЧЕНИЕ");
		Лексема("(");
		Значение31 = Идентификатор("ID_Полный");
		ЭтотУзел.ЧастиПути.Добавить(Значение31);
		Лексема(".");
		Значение32 = Идентификатор("ID_Полный");
		ЭтотУзел.ЧастиПути.Добавить(Значение32);
		Если (ТипТокенаПросмотра(0) = ".") Тогда
			Лексема(".");
			Значение33 = Идентификатор("ID_Полный");
			ЭтотУзел.ЧастиПути.Добавить(Значение33);
		КонецЕсли;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	ИначеЕсли (ТипТокенаПросмотра(0) = "ТИП") Тогда
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТип(ТекущийТокен);
		Терминал("ТИП");
		Лексема("(");
		Значение34 = НеТерминалОписаниеТипа();
		ЭтотУзел.Аргумент = Значение34;
		Лексема(")");
		РезультатПродукции = ЭтотУзел;
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка("Функция");
	КонецЕсли;
	Возврат РезультатПродукции;
КонецФункции

Функция НеТерминалТипПериода()
	РезультатПродукции = Неопределено;
	Значение1 = Идентификатор("ID_Полный");
	РезультатПродукции = Значение1;
	Возврат РезультатПродукции;
КонецФункции

#КонецОбласти

#Область Инициализация

КоличествоПросматриваемыхСимволов = 2;
Инициализировать();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
