#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ТаблицаПервыхСимволовВариантов;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;
Перем ПоследняяПродукция;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция Разобрать(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);	
	УстановитьБуферТокенов();
	
	Возврат РезультатРазбора();
КонецФункции	

Функция РазобратьВыражение(Текст) Экспорт
	ЛексическийАнализатор.УстановитьОбрабатываемыйТекст(Текст);	
	УстановитьБуферТокенов();
	
	Возврат РезультатРазбораВыражения();
КонецФункции  

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Инициализировать();
	ТаблицаПервыхСимволовВариантов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ТаблицаПервыхСимволовВариантов").ПолучитьТекст());
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентификатор");
	
	ИндексируемыеПоля = Новый Массив;
	ИндексируемыеПоля.Добавить("Продукция");
	ИндексируемыеПоля.Добавить("КоличествоЭлементов");
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		ИндексируемыеПоля.Добавить("Элемент" + Сч);
		ТаблицаПервыхСимволовВариантов.Индексы.Добавить(СтрСоединить(ИндексируемыеПоля, ","));
	КонецЦикла;		
КонецПроцедуры	

Функция НовыйБуферТокенов()
	БуферТокенов = Новый Структура("ИндексТекущегоЭлемента, Токены");
	БуферТокенов.ИндексТекущегоЭлемента = -1;
	БуферТокенов.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	
	Возврат БуферТокенов;
КонецФункции	

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();	
КонецПроцедуры	

Процедура ЗаполнитьБуферТокенов()	
	МаксимальныйИндексБуфера = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента По МаксимальныйИндексБуфера Цикл
			БуферТокенов.Токены[ИндексТекущегоЭлемента - Сдвиг] = БуферТокенов.Токены[ИндексТекущегоЭлемента];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КоличествоДочитываемыхЭлементов = МаксимальныйИндексБуфера - БуферТокенов.ИндексТекущегоЭлемента;
	
	Для Сч = 1 По КоличествоДочитываемыхЭлементов Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();
	КонецЦикла;	
КонецПроцедуры	

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = - 1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		
		Возврат БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	КонецЕсли;
	
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
		
	ЗаполнитьБуферТокенов();
	
	Возврат Токен;
КонецФункции	

Процедура УстановитьТекущийТокен()
	ТекущийТокен = СледующийТокенИзБуфера();	
КонецПроцедуры	

Функция НомерВариантаПродукции(Продукция)
	СтруктураПоиска = Новый Структура("Продукция, КоличествоЭлементов", Продукция, 0);
	
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч - 1];
		Если Токен <> Неопределено И Токен.Тип <> Неопределено  Тогда
			СтруктураПоиска.Вставить("Элемент" + Сч, Токен.Тип);
			СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов + 1;
		КонецЕсли;
	КонецЦикла;		

	Для Сч = 0 По Макс(СтруктураПоиска.КоличествоЭлементов - 1, 0) Цикл
		СтрокиПервыхСимволов = ТаблицаПервыхСимволовВариантов.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПервыхСимволов.Количество() > 0 Тогда
			Возврат СтрокиПервыхСимволов[0].НомерВарианта;
		КонецЕсли;	
		
		СтруктураПоиска.Удалить("Элемент" + (СтруктураПоиска.КоличествоЭлементов - Сч));
		СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов - 1;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТекущийТокен.Тип <> ТипТерминала Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипТерминала);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущийТокен();
	
	Возврат Тип;
КонецФункции

Функция Лексема(ТипЛексемы)
	Если ТекущийТокен.Тип <> ТипЛексемы Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипЛексемы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущийТокен();
	
	Возврат Тип;
КонецФункции

Функция Идентификатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентификатор", ТипИдентификатора, ТекущийТокен.Тип);
	
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипИдентификатора);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
	
	Лексема = ТекущийТокен.Лексема; 
	
	УстановитьТекущийТокен();
	
	Возврат Лексема;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТекущийТокен.Тип <> ТипКонстанты Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипКонстанты);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
	Значение = ТекущийТокен.Значение; 
	
	УстановитьТекущийТокен();
	
	Возврат Значение;
КонецФункции

Функция РезультатРазбора()
	УстановитьТекущийТокен();

	Результат = НеТерминалПакетЗапросов();
		
	Если ТекущийТокен.Тип <> Неопределено Тогда
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор(ПоследняяПродукция);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции   

Функция РезультатРазбораВыражения()
	УстановитьТекущийТокен();

	Результат = НеТерминалВыражение(Неопределено, Неопределено);
		
	Если ТекущийТокен.Тип <> Неопределено Тогда
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор(ПоследняяПродукция);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

Процедура ВызватьИсключениеНеУдалосьВыпполнитьРазбор(Продукция)
	Если ТекущийТокен.Тип <> Неопределено И Продукция <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Продукция", Продукция, 0);
		СтруктураПоиска.Вставить("Элемент1", ТекущийТокен.Тип);
		
		Если ТаблицаПервыхСимволовВариантов.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			УстановитьТекущийТокен();
			ВызватьИсключениеСинтаксическаяОшибка();		
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка();
		КонецЕсли;	
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка();	
	КонецЕсли;
КонецПроцедуры

Процедура ВызватьИсключениеСинтаксическаяОшибка()
	Если ТекущийТокен.Тип = Неопределено Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается следующий токен";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола);
		ВызватьИсключение ТекстОшибки;
	Иначе
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Неожиданный токен ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТекущийТокен.Лексема);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
КонецПроцедуры

Функция НеТерминалПакетЗапросов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПакетЗапросов(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЗапросПакета(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеПакетаЗапросов(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеПакетаЗапросов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеПакетаЗапросов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(";");
		ТекущийЭлемент = НеТерминалЗапросПакета(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеПакетаЗапросов(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(";");
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеПакетаЗапросов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросПакета(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЗапросПакета");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросУничтожения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ЗапросПакета");
	КонецЕсли;
	ПоследняяПродукция = "ЗапросПакета";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросУничтожения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросУничтожения(ТекущийТокен);
	ТекущийЭлемент = Терминал("УНИЧТОЖИТЬ");
	ТекущийЭлемент = Идентификатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗапросВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЗапросВыбора(ТекущийТокен);
	ТекущийЭлемент = НеТерминалОбъединяемыйЗапрос(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Операторы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокОбъединить(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалБлокУпорядочить(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Порядок = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИндексировать(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Индекс = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИтоги(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалАвтоупорядочиваниеОпционально(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОбъединяемыйЗапрос(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорЗапроса(ТекущийТокен);
	ТекущийЭлемент = НеТерминалБлокВыбрать(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПоляВыборки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ВыбираемыеПоля = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокПоместить(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.__ТаблицаДляПомещения = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИз(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источники = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокГде(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Отбор = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокСгруппировать(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Группировка = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалБлокИмеющие(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ОтборСгруппированных = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокОбъединить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокОбъединить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ОБЪЕДИНИТЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТипОбъединения = ЭлементыМоделиЗапроса.НовыйТипОбъединение(ТекущийТокен);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалВсеОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТипОбъединения = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОбъединяемыйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТекущийЭлемент.ТипОбъединения = ТипОбъединения;
			ЭтотУзел.Операторы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалБлокОбъединить(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "БлокОбъединить";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВсеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ВсеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипОбъединениеВсе(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВСЕ");
	КонецЕсли;
	ПоследняяПродукция = "ВсеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокВыбрать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Терминал("ВЫБРАТЬ");
	ТекущийЭлемент = НеТерминалМодификаторыВыборки(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалМодификаторыВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("МодификаторыВыборки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазличныеРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеРазличныеОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "МодификаторыВыборки";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазличныеРазрешенныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("РазличныеРазрешенныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазличныеОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "РазличныеРазрешенныеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазрешенныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("РазрешенныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.ВыбиратьРазрешенные = Истина;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "РазрешенныеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеРазрешенныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПервыеРазрешенныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазрешенныеОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗРЕШЕННЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.__ВыбиратьРазрешенные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПервыеРазрешенныеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПервыеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПервыеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПервыеРазличныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПервыеРазличныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыбиратьРазличные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПервыеОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРВЫЕ");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Родитель.КоличествоПолучаемыхЗаписей = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРазличныеОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПервыеРазличныеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоляВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
	ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокПолейОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Оператор = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("СписокПолейОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Оператор);
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "СписокПолейОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПолеВыборки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПолеВыборки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Псевдоним = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПолеЗапроса(ТекущийТокен);
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
			ЭтотУзел.Выражение.Значение = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоля(ТекущийТокен);
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ПолеВыборки");
	КонецЕсли;
	ПоследняяПродукция = "ПолеВыборки";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдоним(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Псевдоним");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("КАК");
		ТекущийЭлемент = Идентификатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Идентификатор("ID_Псевдоним");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Псевдоним");
	КонецЕсли;
	ПоследняяПродукция = "Псевдоним";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдонимОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПсевдонимОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПсевдонимОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокПоместить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокПоместить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПОМЕСТИТЬ");
		ТекущийЭлемент = Идентификатор("ID_ИмяТаблицы");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокПоместить";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИз(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокИз");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникиЗапроса(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИЗ");
		ТекущийЭлемент = НеТерминалИсточникДанныхЗапроса(ЭтотУзел, ТекущийЭлемент, ЭтотУзел);
		ТекущийЭлемент = НеТерминалСписокТаблиц(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокИз";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокТаблиц(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("СписокТаблиц");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалИсточникДанныхЗапроса(ЭтотУзел, ТекущийЭлемент, ЭтотУзел);
		ТекущийЭлемент = НеТерминалСписокТаблиц(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "СписокТаблиц";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхЗапроса(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Источники.Элементы.Добавить(ЭтотУзел);
	ТекущийЭлемент = НеТерминалИсточникДанных(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент;
		;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСоединение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Соединение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = НеТерминалПраваяЧастьСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Соединения.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалПраваяЧастьСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Соединения.Добавить(ТекущийЭлемент);
			ТекущийЭлемент.Опционально = Истина;
		КонецЕсли;
		ТекущийЭлемент = Лексема("}");
		ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);
	КонецЕсли;
	ПоследняяПродукция = "Соединение";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПраваяЧастьСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСоединениеИсточника(ТекущийТокен);
	ТекущийЭлемент = НеТерминалТипСоединения(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ТипСоединения = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("СОЕДИНЕНИЕ");
	ТекущийЭлемент = НеТерминалИсточникДанныхСоединения(ЭтотУзел, ТекущийЭлемент, Источники);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент.ИдентификаторИсточника;
		;
	КонецЕсли;
	ТекущийЭлемент = Терминал("ПО");
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Условие = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Источники = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточник(ТекущийТокен);
	Источники.Элементы.Добавить(ЭтотУзел);
	ТекущийЭлемент = НеТерминалПрисоединяемаяТаблица(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Источник = ТекущийЭлемент;
		;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСоединение(ЭтотУзел, ТекущийЭлемент, Источники);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипСоединения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТипСоединения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияЛевое(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЛЕВОЕ");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПравое(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРАВОЕ");
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияВнутреннее(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВНУТРЕННЕЕ");
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСоединенияПолное(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПОЛНОЕ");
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ТипСоединения");
	КонецЕсли;
	ПоследняяПродукция = "ТипСоединения";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанных(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ИсточникДанных");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблицаЗначений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВложенныйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВременнаяТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ИсточникДанных");
	КонецЕсли;
	ПоследняяПродукция = "ИсточникДанных";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПрисоединяемаяТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПрисоединяемаяТаблица");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВложенныйЗапрос(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалИсточникДанныхВременнаяТаблица(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ПрисоединяемаяТаблица");
	КонецЕсли;
	ПоследняяПродукция = "ПрисоединяемаяТаблица";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхТаблицаЗначений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблицаЗначений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент.Имя;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхВременнаяТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВременнаяТаблица(ТекущийТокен);
	ТекущийЭлемент = Идентификатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхТаблица(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхТаблица(ТекущийТокен);
	ТекущийЭлемент = Идентификатор("ID_ИмяТаблицы");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалРазыменованиеТаблицы(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПараметрыТаблицыОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Параметры = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИсточникДанныхВложенныйЗапрос(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйИсточникДанныхВложенныйЗапрос(ТекущийТокен);
	ТекущийЭлемент = Лексема("(");
	ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ЗапросВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(")");
	ТекущийЭлемент = НеТерминалПсевдоним(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Псевдоним = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКакОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("КакОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("КАК");
	КонецЕсли;
	ПоследняяПродукция = "КакОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазыменованиеТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Лексема(".");
	ТекущийЭлемент = Идентификатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + "." + ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеРазыменованияТаблицы(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеРазыменованияТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеРазыменованияТаблицы");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентификатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ИмяТаблицы = ЭтотУзел.ИмяТаблицы + "." + ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеРазыменованияТаблицы(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеРазыменованияТаблицы";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметрыТаблицыОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПараметрыТаблицыОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокПараметров(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ПараметрыТаблицыОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокПараметров(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокПараметров(ТекущийТокен);
	ЭтотУзел.Добавить(Неопределено);
	ТекущийЭлемент = НеТерминалПараметрТаблицы(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел[ЭтотУзел.Количество() - 1] = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеСпискаПараметров(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеСпискаПараметров(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеСпискаПараметров");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ЭтотУзел.Добавить(Неопределено);
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПараметрТаблицы(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел[ЭтотУзел.Количество() - 1] = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеСпискаПараметров(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеСпискаПараметров";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметрТаблицы(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПараметрТаблицы");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПараметрТаблицы";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражениеСКДПараметр(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ВыражениеСКДПараметр");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема("}");
		ТекущийЭлемент = НеТерминалВыражениеСКДПараметр(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ВыражениеСКДПараметр";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокГде(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокГде");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ГДЕ");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокГде";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокСгруппировать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокСгруппировать");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("СГРУППИРОВАТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокВыраженийМодели(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокСгруппировать";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИмеющие(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокИмеющие");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИМЕЮЩИЕ");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокИмеющие";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокУпорядочить(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокУпорядочить");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УПОРЯДОЧИТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокЭлементовУпорядочивания(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель.Операторы[0]);
	КонецЕсли;
	ПоследняяПродукция = "БлокУпорядочить";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАвтоупорядочиваниеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("АвтоупорядочиваниеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		Родитель.Автопорядок = Истина;
		ТекущийЭлемент = Терминал("АВТОУПОРЯДОЧИВАНИЕ");
	КонецЕсли;
	ПоследняяПродукция = "АвтоупорядочиваниеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокЭлементовУпорядочивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементыПорядка(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЭлементУпорядочивания(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеСпискаЭлементовУпорядочивания(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеСпискаЭлементовУпорядочивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеСпискаЭлементовУпорядочивания");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалЭлементУпорядочивания(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеСпискаЭлементовУпорядочивания(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеСпискаЭлементовУпорядочивания";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЭлементУпорядочивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЭлементПорядка(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалИерархияОпционально(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Иерархия = Истина;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалНаправлениеУпорядочивания(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Направление = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалНаправлениеУпорядочивания(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("НаправлениеУпорядочивания");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеВозрастание(ТекущийТокен);
		ТекущийЭлемент = Терминал("ВОЗР");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УБЫВ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ЭлементыМоделиЗапроса.НовыйНаправлениеУбывание(ТекущийТокен);
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "НаправлениеУпорядочивания";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИерархияОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ИерархияОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Истина;
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");
	КонецЕсли;
	ПоследняяПродукция = "ИерархияОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИтоги(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокИтоги");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ИТОГИ");
		ТекущийЭлемент = НеТерминалПоляИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ВыраженияИтогов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалКонтрольныеТочкиИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонтрольныеТочкиИтогов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель.Операторы[0]);
	КонецЕсли;
	ПоследняяПродукция = "БлокИтоги";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоляИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПоляИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыраженияИтогов(ТекущийТокен);
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПоляИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонтрольныеТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольныеТочкиИтогов(ТекущийТокен);
	ТекущийЭлемент = НеТерминалКонтрольнаяТочкаИтогов(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалСписокКонтрольныхТочекОпциональное(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокКонтрольныхТочекОпциональное(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("СписокКонтрольныхТочекОпциональное");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалКонтрольнаяТочкаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСписокКонтрольныхТочекОпциональное(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "СписокКонтрольныхТочекОпциональное";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонтрольнаяТочкаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("КонтрольнаяТочкаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонтрольнаяТочкаИтогов(ТекущийТокен);
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеКонтрольнойТочкиИтогов(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОбщиеИтоги(ТекущийТокен);
		ТекущийЭлемент = Терминал("ОБЩИЕ");
		ТекущийЭлемент = НеТерминалПсевдонимОпционально(ЭтотУзел, ТекущийЭлемент);
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("КонтрольнаяТочкаИтогов");
	КонецЕсли;
	ПоследняяПродукция = "КонтрольнаяТочкаИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеКонтрольнойТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = НеТерминалТипКонтрольнойТочки(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ТипКонтрольнойТочки = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалДополнениеПериодамиИтогов(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалПсевдонимКонтрольнойТочкиИтогов(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ИмяКолонки = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалДополнениеПериодамиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ДополнениеПериодамиИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("ПЕРИОДАМИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалТипПериодаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипДополненияПериодами = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПериодДополненияИтогов(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ДополнениеПериодамиИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипКонтрольнойТочки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТипКонтрольнойТочки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиТолькоИерархия(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТОЛЬКО");
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипКонтрольнойТочкиИерархия(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИЕРАРХИЯ");
	КонецЕсли;
	ПоследняяПродукция = "ТипКонтрольнойТочки";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПсевдонимКонтрольнойТочкиИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПсевдонимКонтрольнойТочкиИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("КАК");
		ТекущийЭлемент = Идентификатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Идентификатор("ID_ПсевдонимКонтрольнойТочкиИтогов");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПсевдонимКонтрольнойТочкиИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипПериодаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТипПериодаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("СЕКУНДА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("МИНУТА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ЧАС");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ДЕНЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("НЕДЕЛЯ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("МЕСЯЦ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 7 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ГОД");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 8 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ДЕКАДА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 9 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ПОЛУГОДИЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ТипПериодаИтогов");
	КонецЕсли;
	ПоследняяПродукция = "ТипПериодаИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПериодДополненияИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПериодДополненияИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПериодИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачалоПериодаДополнения = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОкончаниеПериодаИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонецПериодаДополнения = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПериодДополненияИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОкончаниеПериодаИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОкончаниеПериодаИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалПериодИтогов(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОкончаниеПериодаИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПериодИтогов(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПериодИтогов");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ПериодИтогов";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалБлокИндексировать(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("БлокИндексировать");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИНДЕКСИРОВАТЬ");
		ТекущийЭлемент = Терминал("ПО");
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалРасширениеСКД(ЭтотУзел, ТекущийЭлемент, Родитель);
	КонецЕсли;
	ПоследняяПродукция = "БлокИндексировать";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРасширениеСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Оператор = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("РасширениеСКД");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("{");
		ТекущийЭлемент = НеТерминалТелоБлокаСКД(ЭтотУзел, ТекущийЭлемент, Оператор);
		ТекущийЭлемент = Лексема("}");
	КонецЕсли;
	ПоследняяПродукция = "РасширениеСКД";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТелоБлокаСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Оператор = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТелоБлокаСКД");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбираемыеПоля(ТекущийТокен);
		ТекущийЭлемент = НеТерминалТипБлокаСКД(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Оператор.ОтборыСКД;
		ТекущийЭлемент = Терминал("ГДЕ");
		ТекущийЭлемент = НеТерминалПолеВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСписокПолейОпционально(ЭтотУзел, ТекущийЭлемент);
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ТелоБлокаСКД");
	КонецЕсли;
	ПоследняяПродукция = "ТелоБлокаСКД";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипБлокаСКД(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТипБлокаСКД");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ВЫБРАТЬ");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("УПОРЯДОЧИТЬ");
		ТекущийЭлемент = Терминал("ПО");
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИТОГИ");
		ТекущийЭлемент = Терминал("ПО");
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ТипБлокаСКД");
	КонецЕсли;
	ПоследняяПродукция = "ТипБлокаСКД";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическоеСлагаемое(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическоеИли(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеИли(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЛогическоеИли");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ИЛИ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "ИЛИ";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеСлагаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеИли(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ЛогическоеИли";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеСлагаемое(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическийМножитель(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическоеИ(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическоеИ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЛогическоеИ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("И");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "И";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическийМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалЛогическоеИ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ЛогическоеИ";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическийМножитель(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалЛогическаяОперация(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалЛогическийОператор(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическийОператор(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЛогическийОператор");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорМежду(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("МЕЖДУ");
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачалоИнтервала = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Терминал("И");
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КонецИнтервала = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиТипа(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ССЫЛКА");
		ТекущийЭлемент = НеТерминалТипСсылочногоПоля(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипСсылочногоПоля = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПроверкиНаNULL(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = Терминал("ЕСТЬ");
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("NULL");
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорВ(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("В");
		ТекущийЭлемент = НеТерминалОпциональноеВИерархии(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Иерархия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалОперандВ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Список = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ЛогическийОператор";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипСсылочногоПоля(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйТипСсылочногоПоля(ТекущийТокен);
	;
	ТекущийЭлемент = Идентификатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Группа = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(".");
	ТекущийЭлемент = Идентификатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Таблица = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперандВ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОперандВ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалЗапросВыбора(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ОперандВ");
	КонецЕсли;
	ПоследняяПродукция = "ОперандВ";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЛогическаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЛогическаяОперация");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОтрицание(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Выражение = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ЛогическаяОперация");
	КонецЕсли;
	ПоследняяПродукция = "ЛогическаяОперация";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОперацияСравнения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОператорСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперандСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияСравнения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОперацияСравнения";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОператорСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОператорСравнения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<>");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(">");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(">=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("<=");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ОператорСравнения");
	КонецЕсли;
	ПоследняяПродукция = "ОператорСравнения";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперандСравнения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалАрифметическоеВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОператорПодобно(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОтрицание(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйЛогическоеОтрицание(ТекущийТокен);
	ТекущийЭлемент = Терминал("НЕ");
	ТекущийЭлемент = НеТерминалОтрицаниеПродолжение(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОтрицаниеПродолжение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОтрицаниеПродолжение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Терминал("НЕ");
		ТекущийЭлемент = НеТерминалОтрицаниеПродолжение(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ОтрицаниеПродолжение";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОператорПодобно(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОператорПодобно");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОператорПодобно(ТекущийТокен);
		ЭтотУзел.Операнд = ЛевыйЭлемент;
		ТекущийЭлемент = НеТерминалОпциональноеНЕ(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Инверсия = Истина;
		КонецЕсли;
		ТекущийЭлемент = Терминал("ПОДОБНО");
		ТекущийЭлемент = НеТерминалШаблонПодобия(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Шаблон = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОператорПодобно";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалШаблонПодобия(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ШаблонПодобия");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("СтроковаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ШаблонПодобия");
	КонецЕсли;
	ПоследняяПродукция = "ШаблонПодобия";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеНЕ(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОпциональноеНЕ");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("НЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОпциональноеНЕ";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеВИерархии(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОпциональноеВИерархии");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИЕРАРХИИ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОпциональноеВИерархии";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАрифметическоеВыражение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалСлагаемое(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАрифметическаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("АрифметическаяОперация");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("+");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "+";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСлагаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("-");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "-";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалСлагаемое(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАрифметическаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "АрифметическаяОперация";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСлагаемое(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияУмножения(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОперацияУмножения");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "*";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("/");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "/";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйБинарнаяОперация(ТекущийТокен);
		ЭтотУзел.ЛеваяЧасть = ЛевыйЭлемент;
		ТекущийЭлемент = Лексема("%");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Операция = "%";
		КонецЕсли;
		ТекущийЭлемент = НеТерминалМножитель(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияУмножения(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПраваяЧасть = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОперацияУмножения";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалУнарнаяОперация(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйУнарнаяОперация(ТекущийТокен);
	ТекущийЭлемент = НеТерминалЗнакУнарнойОперации(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Знаки.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалУнарнаяОперацияПродолжение(ЭтотУзел, ТекущийЭлемент);
	ТекущийЭлемент = НеТерминалОперанд(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалУнарнаяОперацияПродолжение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("УнарнаяОперацияПродолжение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		Родитель = ТекущийЭлемент;
		ТекущийЭлемент = НеТерминалЗнакУнарнойОперации(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Знаки.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалУнарнаяОперацияПродолжение(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "УнарнаяОперацияПродолжение";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалЗнакУнарнойОперации(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ЗнакУнарнойОперации");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("-");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("+");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ЗнакУнарнойОперации");
	КонецЕсли;
	ПоследняяПродукция = "ЗнакУнарнойОперации";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалМножитель(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Множитель");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалОперанд(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалУнарнаяОперация(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Множитель");
	КонецЕсли;
	ПоследняяПродукция = "Множитель";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперанд(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Операнд");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыбор(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПоле(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалКонстанта(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалПараметр(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалАгрегатнаяФункция(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалФункция(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Операнд");
	КонецЕсли;
	ПоследняяПродукция = "Операнд";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПоле(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Поле");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТекущийЭлемент = Идентификатор("ID_ПсевдонимРасширенный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент, ЭтотУзел.Элементы);
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
		ТекущийЭлемент = НеТерминалПриведениеТипа(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент, ЭтотУзел.Элементы);
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокВыражений(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
			Разыменование = ЭлементыМоделиЗапроса.НовыйРазыменование(ТекущийТокен);
			Разыменование.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент, Разыменование.Элементы);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = Разыменование;
			;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Поле");
	КонецЕсли;
	ПоследняяПродукция = "Поле";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОперацияРазыменования(Родитель = Неопределено, ЛевыйЭлемент = Неопределено, Элементы = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОперацияРазыменования");
	Если НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентификатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОперацияРазыменования(ЭтотУзел, ТекущийЭлемент, Элементы);
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ТекущийЭлемент = ЭлементыМоделиЗапроса.НовыйВыражениеВсеПоляИсточника(ТекущийТокен);
			Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПоляВложеннойТаблицы(ТекущийТокен);
		Элементы.Добавить(ЭтотУзел);
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалПоляВыборки(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ОперацияРазыменования";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокВыражений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыражений(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеСпискаВыражений(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОпциональноеПродолжениеСпискаВыражений");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыражений(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ОпциональноеПродолжениеСпискаВыражений";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражениеМоделиЗапроса(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Значение = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокВыраженийМодели(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйСписокВыражений(ТекущийТокен);
	ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОпциональноеПродолжениеСпискаВыраженийМодели");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражениеМоделиЗапроса(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Элементы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеСпискаВыраженийМодели(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ОпциональноеПродолжениеСпискаВыраженийМодели";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПриведениеТипа(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПриведениеТипа(ТекущийТокен);
	ТекущийЭлемент = Терминал("ВЫРАЗИТЬ");
	ТекущийЭлемент = Лексема("(");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Выражение = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("КАК");
	ТекущийЭлемент = НеТерминалОписаниеТипа(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ОписаниеТипа = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Лексема(")");

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеТипа(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОписаниеТипа");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалТипСсылочногоПоля(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаБулево(ТекущийТокен);
		ТекущийЭлемент = Терминал("БУЛЕВО");
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаДата(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДАТА");
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаЧисло(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЧИСЛО");
		ТекущийЭлемент = НеТерминалОписаниеЧисла(ЭтотУзел, ТекущийЭлемент);
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйОписаниеТипаСтрока(ТекущийТокен);
		ТекущийЭлемент = Терминал("СТРОКА");
		ТекущийЭлемент = НеТерминалОписаниеСтроки(ЭтотУзел, ТекущийЭлемент);
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("ОписаниеТипа");
	КонецЕсли;
	ПоследняяПродукция = "ОписаниеТипа";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеЧисла(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОписаниеЧисла");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Длина = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалТочностьЧисла(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ОписаниеЧисла";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТочностьЧисла(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ТочностьЧисла");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Точность = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Точность = 0;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ТочностьЧисла";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОписаниеСтроки(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОписаниеСтроки");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Длина = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	КонецЕсли;
	ПоследняяПродукция = "ОписаниеСтроки";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыбор(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйВыбор(ТекущийТокен);
	ТекущийЭлемент = Терминал("ВЫБОР");
	ТекущийЭлемент = НеТерминалВыражениеВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.ВыражениеВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалАльтернативыВыбора(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.АльтернативыВыбора = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = НеТерминалИначе(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Иначе = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("КОНЕЦ");

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалВыражениеВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ВыражениеВыбора");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ВыражениеВыбора";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАльтернативыВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативыВыбора(ТекущийТокен);
	ТекущийЭлемент = НеТерминалКогдаТогда(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеАльтернативВыбора(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеАльтернативВыбора(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеАльтернативВыбора");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = НеТерминалКогдаТогда(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеАльтернативВыбора(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеАльтернативВыбора";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКогдаТогда(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАльтернативаВыбора(ТекущийТокен);
	ТекущийЭлемент = Терминал("КОГДА");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Условие = ТекущийЭлемент;
	КонецЕсли;
	ТекущийЭлемент = Терминал("ТОГДА");
	ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Действие = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалИначе(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Иначе");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("ИНАЧЕ");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "Иначе";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалКонстанта(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Константа");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("СтроковаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("ИСТИНА");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Истина;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЛОЖЬ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Ложь;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("NULL");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Null;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйКонстанта(ТекущийТокен);
		ТекущийЭлемент = Терминал("НЕОПРЕДЕЛЕНО");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Значение = Неопределено;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Константа");
	КонецЕсли;
	ПоследняяПродукция = "Константа";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПараметр(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = ЭлементыМоделиЗапроса.НовыйПараметрЗапроса(ТекущийТокен);
	ТекущийЭлемент = Лексема("&");
	ТекущийЭлемент = Идентификатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Имя = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАгрегатнаяФункция(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("АгрегатнаяФункция");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "СУММА";
		ТекущийЭлемент = Терминал("СУММА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "МАКСИМУМ";
		ТекущийЭлемент = Терминал("МАКСИМУМ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "МИНИМУМ";
		ТекущийЭлемент = Терминал("МИНИМУМ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункция(ТекущийТокен);
		ЭтотУзел.ИмяФункции = "СРЕДНЕЕ";
		ТекущийЭлемент = Терминал("СРЕДНЕЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйАгрегатнаяФункцияКоличество(ТекущийТокен);
		ТекущийЭлемент = Терминал("КОЛИЧЕСТВО");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалРазличныеОпционально(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Различные = Истина;
		КонецЕсли;
		ТекущийЭлемент = НеТерминалАргументКоличество(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("АгрегатнаяФункция");
	КонецЕсли;
	ПоследняяПродукция = "АгрегатнаяФункция";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалРазличныеОпционально(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("РазличныеОпционально");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Терминал("РАЗЛИЧНЫЕ");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "РазличныеОпционально";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалАргументКоличество(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("АргументКоличество");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = Лексема("*");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел = ТекущийЭлемент;
		КонецЕсли;
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("АргументКоличество");
	КонецЕсли;
	ПоследняяПродукция = "АргументКоличество";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалФункция(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("Функция");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПодстрока(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПОДСТРОКА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Строка = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.НачальнаяПозиция = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.КоличествоСимволов = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 2 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияГод(ТекущийТокен);
		ТекущийЭлемент = Терминал("ГОД");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 3 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКвартал(ТекущийТокен);
		ТекущийЭлемент = Терминал("КВАРТАЛ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 4 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМесяц(ТекущийТокен);
		ТекущийЭлемент = Терминал("МЕСЯЦ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 5 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньГода(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬГОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 6 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДень(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 7 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньМесяца(ТекущийТокен);
		ТекущийЭлемент = Терминал("НЕДЕЛЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 8 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДеньНедели(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДЕНЬНЕДЕЛИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 9 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЧас(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЧАС");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 10 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияМинута(ТекущийТокен);
		ТекущийЭлемент = Терминал("МИНУТА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 11 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияСекунда(ТекущийТокен);
		ТекущийЭлемент = Терминал("СЕКУНДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 12 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияНачалоПериода(ТекущийТокен);
		ТекущийЭлемент = Терминал("НАЧАЛОПЕРИОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 13 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияКонецПериода(ТекущийТокен);
		ТекущийЭлемент = Терминал("КОНЕЦПЕРИОДА");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 14 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДобавитьКДате(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДОБАВИТЬКДАТЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Сдвиг = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 15 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияРазностьДат(ТекущийТокен);
		ТекущийЭлемент = Терминал("РАЗНОСТЬДАТ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата1 = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Дата2 = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалТипПериода(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ТипПериода = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 16 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияIsNull(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЕСТЬNULL");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ПроверяемоеЗначение = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Действие = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 17 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставление(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРЕДСТАВЛЕНИЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 18 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияПредставлениеСсылки(ТекущийТокен);
		ТекущийЭлемент = Терминал("ПРЕДСТАВЛЕНИЕССЫЛКИ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 19 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТипЗначения(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТИПЗНАЧЕНИЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалВыражение(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 20 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияДатаВремя(ТекущийТокен);
		ТекущийЭлемент = Терминал("ДАТАВРЕМЯ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалСписокАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 21 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияЗначение(ТекущийТокен);
		ТекущийЭлемент = Терминал("ЗНАЧЕНИЕ");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = Идентификатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентификатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалОпциональноеПродолжениеАргументаЗначение(ЭтотУзел, ТекущийЭлемент);
		ТекущийЭлемент = Лексема(")");
	ИначеЕсли НомерВариантаПродукции = 22 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = ЭлементыМоделиЗапроса.НовыйФункцияТип(ТекущийТокен);
		ТекущийЭлемент = Терминал("ТИП");
		ТекущийЭлемент = Лексема("(");
		ТекущийЭлемент = НеТерминалОписаниеТипа(ЭтотУзел, ТекущийЭлемент);
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргумент = ТекущийЭлемент;
		КонецЕсли;
		ТекущийЭлемент = Лексема(")");
	Иначе
		ВызватьИсключениеНеУдалосьВыпполнитьРазбор("Функция");
	КонецЕсли;
	ПоследняяПродукция = "Функция";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалСписокАргументовДатаВремя(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ЭтотУзел = Родитель;
	ТекущийЭлемент = Константа("ЧисловаяКонстанта");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел.Аргументы.Добавить(ТекущийЭлемент);
	КонецЕсли;
	ТекущийЭлемент = НеТерминалПродолжениеАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалПродолжениеАргументовДатаВремя(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ПродолжениеАргументовДатаВремя");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(",");
		ТекущийЭлемент = Константа("ЧисловаяКонстанта");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.Аргументы.Добавить(ТекущийЭлемент);
		КонецЕсли;
		ТекущийЭлемент = НеТерминалПродолжениеАргументовДатаВремя(ЭтотУзел, ТекущийЭлемент);
	КонецЕсли;
	ПоследняяПродукция = "ПродолжениеАргументовДатаВремя";

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалТипПериода(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	ЭтотУзел = Неопределено;
	ТекущийЭлемент = Неопределено;
	ТекущийЭлемент = Идентификатор("ID_Полный");
	Если ТекущийЭлемент <> "ПУСТО" Тогда
		ЭтотУзел = ТекущийЭлемент;
	КонецЕсли;

	Возврат ЭтотУзел;
КонецФункции

Функция НеТерминалОпциональноеПродолжениеАргументаЗначение(Родитель = Неопределено, ЛевыйЭлемент = Неопределено)
	ЭтотУзел = "ПУСТО";
	НомерВариантаПродукции = НомерВариантаПродукции("ОпциональноеПродолжениеАргументаЗначение");
	Если НомерВариантаПродукции = 1 Тогда
		ЭтотУзел = Неопределено;
		ТекущийЭлемент = Неопределено;
		ЭтотУзел = Родитель;
		ТекущийЭлемент = Лексема(".");
		ТекущийЭлемент = Идентификатор("ID_Полный");
		Если ТекущийЭлемент <> "ПУСТО" Тогда
			ЭтотУзел.ЧастиПути.Добавить(ТекущийЭлемент);
		КонецЕсли;
	КонецЕсли;
	ПоследняяПродукция = "ОпциональноеПродолжениеАргументаЗначение";

	Возврат ЭтотУзел;
КонецФункции

#КонецОбласти

#Область Инициализация
КоличествоПросматриваемыхСимволов = 2;
Инициализировать();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
