#Область СлужебныеПроцедурыИФункции

Функция ОписаниеПредставленияПоИмени(ПолноеИмяПредставления) Экспорт  
	Возврат ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениСлужебный(ПолноеИмяПредставления);	
КонецФункции   
 
Функция ИменаПредставленийВходящихВГруппу(ИмяГруппы) Экспорт
 	Возврат ПоставщикИсполняемыхПредставлений.ИменаПредставленийВходящихВГруппуСлужебный(ИмяГруппы);	
КонецФункции
 
Функция ИменаОбработокИсполняемыхПредставлений() Экспорт
	Возврат ПоставщикИсполняемыхПредставлений.ИменаОбработокИсполняемыхПредставленийСлужебный();	
КонецФункции

Функция ИменаДочернихГрупп(ИмяГруппы) Экспорт
	Возврат ПоставщикИсполняемыхПредставлений.ИменаДочернихГруппСлужебный(ИмяГруппы);		
КонецФункции

#КонецОбласти