
&НаСервере
Процедура Команда1НаСервере()
	Лексер = РеквизитФормыВЗначение("Объект");
	
	Лексер.Иницализировать(Текст);
	
	
	Схема = Новый СхемаЗапроса;
	Схема.УстановитьТекстЗапроса(Текст);
	Текст = Схема.ПолучитьТекстЗапроса();
	Начало = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	Результат = Лексер.ПолучитьТекстЗапроса();
	
	Время = ТекущаяУниверсальнаяДатаВМиллисекундах() - Начало;

	Текст = Результат;
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	Команда1НаСервере();
КонецПроцедуры
