
#Область СлужебныеПроцедурыИФункции

// Описание представления по имени.
// 
// Параметры:
//  ПолноеИмяПредставления - Строка
// 
// Возвращаемое значение:
//  см. ЭлементыМоделиОписанияПредставлений.НовыйОписаниеПредставления
Функция ОписаниеПредставленияПоИмени(ПолноеИмяПредставления) Экспорт  
	Возврат ПоставщикИсполняемыхПредставленийПовтИсп.ОписаниеПредставленияПоИмени(ПолноеИмяПредставления);	
КонецФункции   
 
Функция ИсполнительПредставления(ИмяПредставления) Экспорт
	ОписаниеПредставления = ОписаниеПредставленияПоИмени(ИмяПредставления);
	Возврат Обработки[ОписаниеПредставления.ИмяОбработчика];		
КонецФункции

Функция ГенераторИсполняемогоКода(ОписаниеПредставления) Экспорт
	Возврат Обработки[ОписаниеПредставления.ИмяОбработчика];		
КонецФункции

Функция ГенераторТекстаЗапросаДляСКД(ОписаниеПредставления) Экспорт
	Если ОписаниеПредставления.ДоступноВМеханизмеПредставленийСКД Тогда
		Возврат Обработки[ОписаниеПредставления.ИмяОбработчика];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
 
Функция ИменаПредставленийВходящихВГруппу(ИмяГруппы) Экспорт
	Возврат ПоставщикИсполняемыхПредставленийПовтИсп.ИменаПредставленийВходящихВГруппу(ИмяГруппы); 	
КонецФункции

Функция ИменаОбработокИсполняемыхПредставлений() Экспорт
	Возврат ПоставщикИсполняемыхПредставленийПовтИсп.ИменаОбработокИсполняемыхПредставлений();	
КонецФункции

Функция СоответствиеИменОбработокИменамПредставлений() Экспорт
	Возврат ПоставщикИсполняемыхПредставленийПовтИсп.СоответствиеИменОбработокИменамПредставлений();
КонецФункции

Функция ИменаДочернихГрупп(ИмяГруппы) Экспорт
	Возврат ПоставщикИсполняемыхПредставленийПовтИсп.ИменаДочернихГрупп(ИмяГруппы);		
КонецФункции

Процедура ЗаполнитьПоляПоИменам(ОписаниеПредставления)
	Для Каждого Поле Из ОписаниеПредставления.Поля Цикл
		ОписаниеПредставления.ПоляПоИменам.Вставить(ВРег(Поле.Имя), Поле);	
	КонецЦикла;	
КонецПроцедуры	

// Заполнить параметры по именам.
// 
// Параметры:
//  ОписаниеПредставления - см. ЭлементыМоделиОписанияПредставлений.НовыйОписаниеПредставления
Процедура ЗаполнитьПараметрыПоИменам(ОписаниеПредставления)
	Для Каждого Параметр Из ОписаниеПредставления.ОписаниеПараметров Цикл
		ОписаниеПредставления.ПараметрыПоИменам.Вставить(ВРег(Параметр.Имя), Параметр);	
	КонецЦикла;	
КонецПроцедуры	

Функция ГруппыИсполняемыхПредставлений() Экспорт
	Группы = Новый Массив();
	УникальныеГруппы = Новый Соответствие;
	Для Каждого Подсистема Из ПодсистемыВерхнегоУровня() Цикл
		Для Каждого ВложеннаяПодсистема Из Подсистема.Подсистемы Цикл
			ЧастиИмени = СтрРазделить(ВложеннаяПодсистема.Имя, "_");
			Если ЧастиИмени.Количество() = 2 Тогда
				ИмяГруппы = ЧастиИмени[1];
			Иначе
				ИмяГруппы = ЧастиИмени[0];
			КонецЕсли;
			Если УникальныеГруппы.Получить(ИмяГруппы) = Неопределено Тогда
				Группы.Добавить(ИмяГруппы);
				УникальныеГруппы.Вставить(ИмяГруппы, Истина);	
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат Группы;
КонецФункции

// Родительские подсистемы.
// 
// Параметры:
//  ИмяРодителя - Строка
// 
// Возвращаемое значение:
//  Массив из ОбъектМетаданныхПодсистема
//
Функция РодительскиеПодсистемы(ИмяРодителя) 
	РодительскиеПодсистемы = Новый Массив();
	Для Каждого Подсистема Из ПодсистемыВерхнегоУровня() Цикл
		ЗаполнитьРодительскиеПодсистемы(РодительскиеПодсистемы, Подсистема, ИмяРодителя);	
	КонецЦикла;
	
	Возврат РодительскиеПодсистемы;	
КонецФункции

Функция ПодсистемыВерхнегоУровня()
	ПодсистемыВерхнегоУровня = Новый Массив();
	Для Каждого Подсистема Из Метаданные.Подсистемы Цикл
		Если Подсистема.Имя = "ИсполняемыеПредставления"
			Или СтрЗаканчиваетсяНа(Подсистема.Имя, "_ИсполняемыеПредставления") Тогда
			
			ПодсистемыВерхнегоУровня.Добавить(Подсистема);	
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат ПодсистемыВерхнегоУровня;
КонецФункции

Процедура 1(РодительскиеПодсистемы, ТекущаяПодсистема, ИмяРодителя) 
	Для Каждого Подсистема Из ТекущаяПодсистема.Подсистемы Цикл
		Если Подсистема.Имя = ИмяРодителя
			Или СтрЗаканчиваетсяНа(Подсистема.Имя, "_" + ИмяРодителя) Тогда
			
			РодительскиеПодсистемы.Добавить(Подсистема);
		Иначе
			ЗаполнитьРодительскиеПодсистемы(РодительскиеПодсистемы, Подсистема, ИмяРодителя);		
		КонецЕсли;
	КонецЦикла; 			
КонецПроцедуры

// Описание представления по имени служебный.
// 
// Параметры:
//  ИмяПредставления - Строка
// 
// Возвращаемое значение:
//  см. ЭлементыМоделиОписанияПредставлений.НовыйОписаниеПредставления
Функция ОписаниеПредставленияПоИмениСлужебный(ИмяПредставления) Экспорт  
	ЧастиИмени = СтрРазделить(ИмяПредставления, ".");
	Если ЧастиИмени.Количество() < 2 
		Или ВРег(ЧастиИмени[0]) <> ВРег("ИсполняемоеПредставление") Тогда
		
		Возврат Неопределено;
	КонецЕсли;
	
	// TODO изюавится от требований к именам обработок
	
	СоответствиеИмен = СоответствиеИменОбработокИменамПредставлений();
	
	Если ЧастиИмени.Количество() = 2 Тогда
		ИмяОбработки = СоответствиеИмен.Получить(ВРег(ЧастиИмени[1]));
		Если ИмяОбработки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат Обработки[ИмяОбработки].Описание();
	ИначеЕсли ЧастиИмени.Количество() = 4 Тогда 	
		ИмяОбработки = СоответствиеИмен.Получить(ВРег(ЧастиИмени[1] + "." + ЧастиИмени[3]));	
		Если ИмяОбработки = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат Обработки[ИмяОбработки].Описание(ЧастиИмени[2]);
	Иначе	
		Возврат Неопределено;
	КонецЕсли;
КонецФункции   

Функция ИменаПредставленийВходящихВГруппуСлужебный(ИмяГруппы) Экспорт
	ЧастиИмени = СтрРазделить(ИмяГруппы, ".");
	Если ЧастиИмени.Количество = 1 Тогда 
		Если ИменаГруппОбъектовМетаданныхПоддерживаюшихПредставления().Получить(ВРег(ИмяГруппы)) <> Неопределено Тогда
			Возврат Новый Массив();
		Иначе
			ИменаОбработокПоПодсистемам = ИменаОбработокИсполняемыхПредставленийПоПодсистемам();
		КонецЕсли;
	ИначеЕсли СтрНачинаетсяС(ИмяГруппы, "РегистрСведений.") Тогда
		ИменаОбработок = ИменаОбработокИсполняемыхПредставлений();
		Возврат ПредставленияРегистровСведенийУтилиты.ИменаПредставленийРегистра(ИмяГруппы, ИменаОбработок);
	ИначеЕсли СтрНачинаетсяС(ИмяГруппы, "РегистрРасчета.") Тогда
		ИменаОбработок = ИменаОбработокИсполняемыхПредставлений();
		МетаданныеРегистра = Метаданные.НайтиПоПолномуИмени(ИмяГруппы);
		Результат = Новый Массив();
		Результат.Добавить("ИсполняемоеПредставление.РегистрРасчета." + МетаданныеРегистра.Имя + ".База");
		Возврат Результат;	
	Иначе
	 	ИменаПредставлений = Новый Массив();
	 	РодительскиеПодсистемы = РодительскиеПодсистемы(ИмяГруппы);
	 	Для Каждого Подсистема Из РодительскиеПодсистемы Цикл
			Для Каждого ОбработкаМетаданные Из Подсистема.Состав Цикл 	
				Имя = Обработки[ОбработкаМетаданные.Имя].ИмяПредставления();	
				ИменаПредставлений.Добавить(Имя);
			КонецЦикла;	
		КонецЦикла;
		Возврат ИменаПредставлений;
	КонецЕсли;
КонецФункции

Функция ИменаОбработокИсполняемыхПредставленийСлужебный() Экспорт
	ИменаОбработок = Новый Массив();
	Для Каждого Подсистема Из ПодсистемыВерхнегоУровня() Цикл
		Для Каждого ВложеннаяПодсистема Из Подсистема.Подсистемы Цикл
			Для Каждого МетаданныеОбработки Из ВложеннаяПодсистема.Состав Цикл
				ИменаОбработок.Добавить(МетаданныеОбработки.Имя);	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИменаОбработок;
КонецФункции

Функция СоответствиеИменОбработокИменамПредставленийСлужебный() Экспорт
	СоответствиеИменОбработокИменамПредставлений = Новый Соответствие();
	
	ИменаОбработок = ИменаОбработокИсполняемыхПредставлений();
	Для Каждого ИмяОбработки Из ИменаОбработок Цикл
		СоответствиеИменОбработокИменамПредставлений.Вставить(
			ВРег(Обработки[ИмяОбработки].ИмяПредставления()), 
			ИмяОбработки);
	КонецЦикла;
			
	Возврат СоответствиеИменОбработокИменамПредставлений;	
КонецФункции

Функция ИменаОбработокИсполняемыхПредставленийПоПодсистемам() Экспорт
	ИменаОбработокПоПодсистемам = Новый Соответствие();
	Для Каждого Подсистема Из ПодсистемыВерхнегоУровня() Цикл
		Для Каждого ВложеннаяПодсистема Из Подсистема.Подсистемы Цикл
			ИменаОбработок = Новый Массив();
			ИменаОбработокПоПодсистемам.Вставить(ВложеннаяПодсистема.Имя, ИменаОбработок);
			Для Каждого МетаданныеОбработки Из ВложеннаяПодсистема.Состав Цикл
				ИменаОбработок.Добавить(МетаданныеОбработки.Имя);	
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИменаОбработокПоПодсистемам;
КонецФункции

Функция ИменаДочернихГруппСлужебный(ИмяГруппы) Экспорт
	Если ИмяГруппы <> "РегистрыСведений" 
		И ИмяГруппы <> "РегистрыРасчета"  Тогда
		Возврат Новый Массив();
	КонецЕсли;
	
	ИменаДочернихГрупп = Новый Массив();
	
	ОбработкиРегистров = Новый Массив();
	Для Каждого Подсистема Из РодительскиеПодсистемы(ИмяГруппы) Цикл
		Для Каждого МетаданныеОбработки Из Подсистема.Состав Цикл
			ОбработкиРегистров.Добавить(Обработки[МетаданныеОбработки.Имя]); 		
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого МетаданныеРегистра Из Метаданные[ИмяГруппы] Цикл
		Для Каждого Обработка Из ОбработкиРегистров Цикл
			Если Обработка.Описание(МетаданныеРегистра.Имя) <> Неопределено Тогда
				ИменаДочернихГрупп.Добавить(МетаданныеРегистра.ПолноеИмя());
				Прервать;	
			КонецЕсли;	
		КонецЦикла;
	КонецЦикла;
	
	Возврат ИменаДочернихГрупп;
КонецФункции

Функция ИменаГруппОбъектовМетаданныхПоддерживаюшихПредставления()
	ИменаГрупп = Новый Соответствие();
	ИменаГрупп.Вставить(ВРег("РегистрыСведений"), Истина);
	ИменаГрупп.Вставить(ВРег("РегистрыРасчета"), Истина);
	ИменаГрупп.Вставить(ВРег("РегистрыНакопления"), Истина);
	ИменаГрупп.Вставить(ВРег("РегистрыБухгалтерии"), Истина);
	
	Возврат ИменаГрупп;
КонецФункции

Функция ИменаТиповОбъектовМетаданныхПоддерживаюшихПредставления()
	ИменаТипов = Новый Соответствие();
	ИменаТипов.Вставить(ВРег("РегистрСведений"), Истина);
	ИменаТипов.Вставить(ВРег("РегистрРасчета") Истина);
	ИменаТипов.Вставить(ВРег("РегистрНакопления"), Истина);
	ИменаТипов.Вставить(ВРег("РегистрБухгалтерии"), Истина);
	
	Возврат ИменаТипов;
КонецФункции

#КонецОбласти
