
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекстЗапроса = Параметры.ТекстЗапроса;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Установить(Команда)
	Закрыть(ТекстЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКонструкторЗапроса(Команда)
	ТекстЗапросаВФорме = СокрЛП(ТекстЗапроса);
	
	ПараметрыОткрытия = КонструкторЗапросовКлиентСерверФормы.ПараметрыРедактораЗапроса();
	ПараметрыОткрытия.ИсходныйТекстЗапроса = ТекстЗапросаВФорме;  
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ИсходныйТекстЗапроса", ТекстЗапросаВФорме);
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияРасширенногоКонструктораЗапроса", ЭтотОбъект, СтруктураПараметров);
		
	КонструкторЗапросовКлиент.ОткрытьРедакторЗапроса(ПараметрыОткрытия, ЭтотОбъект, Оповещение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияРасширенногоКонструктораЗапроса(Результат, СтруктураПараметров) Экспорт
	Если Результат = Неопределено
		Или Не Результат.Модифицированность Тогда 
		Возврат;
	КонецЕсли;
	
	ТекстЗапроса = ТекстОтредактированногоЗапроса(Результат.АдресМоделиЗапроса);
КонецПроцедуры

&НаСервере
Функция ТекстОтредактированногоЗапроса(АдресМоделиЗапроса)
	Модель = ПолучитьИзВременногоХранилища(АдресМоделиЗапроса);
	Возврат ГенерацияТекстовЗапросов.ТекстПакетаЗапросов(Модель);
КонецФункции	

#КонецОбласти