
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем МенеджерВременныхТаблиц; // МенеджерВременныхТаблиц
Перем ИсполнительЗапросов; // см. Обработка.ИсполнительПредставлений
Перем МакетКомпоновки; // МакетКомпоновкиДанных
Перем ДанныеРасщифроки; // ДанныеРасшифровкиКомпоновкиДанных
Перем НастройкиСКД; // НастройкиКомпоновкиДанных
Перем ТабличныйДокумент; // ТабличныйДокумент

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать(ИсполняемыйМакетКомпоновки, ИсполняемыеНастройкиСКД, ИсполняемыеДанныеРасщифроки, ДокументРезультат) Экспорт
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	МакетКомпоновки = ИсполняемыйМакетКомпоновки;
	НастройкиСКД = ИсполняемыеНастройкиСКД;
	ДанныеРасщифроки = ИсполняемыеДанныеРасщифроки;
	ТабличныйДокумент = ДокументРезультат;
	
	ЗначенияПараметров = ЗначенияПараметровИзМакетаКомпоновки();
	
	ИсполнительЗапросов = Обработки.ИсполнительПредставлений.Создать();
	ИсполнительЗапросов.Инициализировать(ЗначенияПараметров, МенеджерВременныхТаблиц);
КонецПроцедуры

Функция ИсполнитьУзелИсполняемоеПредставление(ИсполняемоеПредставление, ПараметрыИсполнения) Экспорт
	Возврат ИсполнительЗапросов.ИсполнитьУзелИсполняемоеПредставление(ИсполняемоеПредставление, ПараметрыИсполнения);		
КонецФункции

Функция ИсполнитьУзелЗапросУничтожения(ЗапросУничтожения) Экспорт
	Возврат ИсполнительЗапросов.ИсполнитьУзелЗапросУничтожения(ЗапросУничтожения);
КонецФункции

Функция ИсполнитьУзелЗапросВыбора(ЗапросВыбора) Экспорт
	Если ЗначениеЗаполнено(ЗапросВыбора.ТаблицаДляПомещения) Тогда
		Возврат ИсполнительЗапросов.ИсполнитьУзелЗапросВыбора(ЗапросВыбора);
	КонецЕсли;
	
	МакетКомпоновки.НаборыДанных[0].Запрос = ГенерацияТекстовЗапросов.ТекстЗапросаВыбора(ЗапросВыбора);
	
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки
		,,
		ДанныеРасщифроки,,,
		МенеджерВременныхТаблиц
	);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат Неопределено
КонецФункции

Функция ИсполнитьУзелУничтожитьВТ(ИмяВТ) Экспорт
	Возврат ИсполнительЗапросов.ИсполнитьУзелУничтожитьВТ(ИмяВТ);
КонецФункции

Функция ЗначенияПараметровИзМакетаКомпоновки()
	ЗначенияПараметров = Новый Структура();
	Для Каждого ПараметрМакета Из МакетКомпоновки.ЗначенияПараметров Цикл
		ЗначенияПараметров.Вставить(ПараметрМакета.Имя, ПараметрМакета.Значение);
	КонецЦикла;
	
	Возврат ЗначенияПараметров;
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
