
Функция СодержаитТип(ТипЭлемента, ЦелевойТип) Экспорт 
	Если ТипЭлемента = Неопределено Тогда
		Возврат Ложь;
	ИначеЕсли ТипЗнч(ТипЭлемента) = Тип("Строка") Тогда
		Возврат ТипЭлемента = ЦелевойТип;  
	ИначеЕсли ТипЗнч(ТипЭлемента) = Тип("ОписаниеТипов") 
		И ТипЗнч(ЦелевойТип) = Тип("Тип") Тогда  

		Возврат ТипЭлемента.СодержитТип(ЦелевойТип);
	Иначе 
		Возврат Ложь;
	КонецЕсли;	
КонецФункции

Функция ВыражениеВыбираемогоПоля(СтрокаТаблицы, Псевдоним = Неопределено, ДопустимыВложенныеТаблицы = Истина) Экспорт
	Если Не ЭтоПоле(СтрокаТаблицы) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ЧастиИмени = Новый Массив; 
	ЧастиИмени.Добавить(СтрокаТаблицы.Имя);
	
	СтрокаРодителя = СтрокаТаблицы;
	Пока Истина Цикл
		СтрокаРодителя = СтрокаРодителя.ПолучитьРодителя();
		Если СтрокаРодителя = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если ЭтоПоле(СтрокаРодителя) Тогда
			ЧастиИмени.Вставить(0, СтрокаРодителя.Имя); 
		ИначеЕсли ЭтоИсточникЗапроса(СтрокаРодителя) Тогда  
			ЧастиИмени.Вставить(0, СтрокаРодителя.Псевдоним);      
			
			Возврат СтрСоединить(ЧастиИмени, ".");
		Иначе 
			Возврат Неопределено;	
		КонецЕсли;			
	КонецЦикла;	
	
	Возврат Неопределено;	
КонецФункции   

Функция ЭтоПоле(СтрокаТаблицы) Экспорт 
	Если КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ДоступноеПолеТаблицы") Тогда   
		Возврат Истина;
	ИначеЕсли КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ПолеПредставления") Тогда    	
		Возврат Истина;
	ИначеЕсли КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ПолеВложеннойТаблицы") Тогда     	
		Возврат Истина;
	Иначе 
		Возврат Ложь;		
	КонецЕсли;		
КонецФункции       

Функция ЭтоИсточникЗапроса(СтрокаТаблицы, ДопустимыВложенныеТаблицы = Истина) Экспорт 
	Если КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ИсточникДанныхТаблица") Тогда
		Возврат Истина;
	ИначеЕсли  КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ИсточникДанныхВложенныйЗапрос") Тогда   	
		Возврат Истина; 
	ИначеЕсли  КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ДоступнаяВложеннаяТаблицаСхемыЗапроса") 
		И ДопустимыВложенныеТаблицы Тогда   
		Возврат Истина;	
	ИначеЕсли  КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ИсточникДанныхВременнаяТаблица") Тогда    	
		Возврат Истина;
	ИначеЕсли  КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ИсточникДанныхТаблицаЗначений") Тогда     	
		Возврат Истина; 
	ИначеЕсли  КонструкторЗапросовКлиентСерверФормы.СодержаитТип(СтрокаТаблицы.ТипЗначения, "ИсполняемоеПредставление") Тогда     	
		Возврат Истина;
	Иначе 
		Возврат Ложь;		
	КонецЕсли;		
КонецФункции

Функция ПараметрыРедактораВложенногоЗапроса() Экспорт 
	ПараметрыРедактора = Новый Структура;
	ПараметрыРедактора.Вставить("ИндексЗапросаПакета", -1);
	ПараметрыРедактора.Вставить("ЭтоВложенныйЗапрос", Истина); 
	ПараметрыРедактора.Вставить("АдресМоделиЗапроса", ""); 
	ПараметрыРедактора.Вставить("АдресСпискаДоступныхВТ", "");   
	
	Возврат ПараметрыРедактора;
КонецФункции   

Функция ПараметрыРедактораЗапроса() Экспорт 
	ПараметрыРедактора = Новый Структура;
	ПараметрыРедактора.Вставить("ЭтоВложенныйЗапрос", Ложь); 
	ПараметрыРедактора.Вставить("ИсходныйТекстЗапроса", "");   
	
	Возврат ПараметрыРедактора;
КонецФункции