
&НаКлиенте
Процедура СгенерироватьFeatureФайлыСозданияЗапросов(Команда)
	Каталог = Новый Файл(ПутьКФайлу);
	Если Не Каталог.ЭтоКаталог() Тогда
		ВызватьИсключение "Ожидается путь к каталогу с запросами";
	КонецЕсли; 
	ФайлыЗапросов = НайтиФайлы(ПутьКФайлу, "*.q1c", Ложь);
	Для Каждого Файл Из ФайлыЗапросов Цикл
		СгенерироватьFeatureФайлСозданияЗапросаНаКлиенте(Файл.ПолноеИмя);
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Функция КодFearureФайла(Запрос, ИмяЗапроса)
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.ДобавитьСтроку("#language: ru");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("@tree");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Функционал: Создание запроса""" +  ИмяЗапроса + """ в конструкторе");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Как Администратор я хочу");
	ТекДок.ДобавитьСтроку("создать запрос в конструкторе");
	ТекДок.ДобавитьСтроку("чтобы получить нужные данные");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Контекст:");
	ТекДок.ДобавитьСтроку("	И я закрыл все окна клиентского приложения");
	ТекДок.ДобавитьСтроку("	И Я запускаю сценарий открытия TestClient или подключаю уже существующий");
	ТекДок.ДобавитьСтроку("	И я закрыл все окна клиентского приложения");
	ТекДок.ДобавитьСтроку("Сценарий: создание запроса " + ИмяЗапроса);
	ТекДок.ДобавитьСтроку("	И Я открываю консоль запросов");
	ТекДок.ДобавитьСтроку("	И Я открываю конструктор запросов");	
	
	УстановитьПривилегированныйРежим(Истина);
	Генератор = Обработки.ГенераторFeatureФайлов.Создать();
	УстановитьПривилегированныйРежим(Ложь);	
	Генератор.УстановитьТекстовыйДокумент(ТекДок);
	Генератор.СценарийСозданияПакетаЗапросаВТекДок(Запрос, Символы.Таб);
	ТекДок.ДобавитьСтроку(Символы.Таб + "И Я завершаю редактирование текушего запроса в конструкторе");
	
	Возврат ТекДок;
КонецФункции

Функция СгенерироватьФайлыДляТестаНаСервере(ТекстЗапроса, ИмяФайлаИсходника)
	КодFearureФайла = КодFearureФайла(ТекстЗапроса, ИмяФайлаИсходника);
	КодFearureФайла.ДобавитьСтроку("	* Проверка результа создания запроса");
	КодFearureФайла.ДобавитьСтроку("		Тогда Текст запроса в консоли соответствует эталону ""files/" 
		+ ИмяФайлаИсходника + ".txt""");	
	
	Возврат КодFearureФайла;
КонецФункции

&НаКлиенте
Процедура СгенерироватьFeatureФайлСозданияЗапроса(Команда)
	СгенерироватьFeatureФайлСозданияЗапросаНаКлиенте(ПутьКФайлу);
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьFeatureФайлСозданияЗапросаНаКлиенте(ПолноеИмяФайла)
	Файл = Новый Файл(ПолноеИмяФайла);
	ИмяФайлаИсходника = Файл.ИмяБезРасширения;
	
	ТекстЗапроса = ТекстЗапросаИзФайла(ПолноеИмяФайла);
	КодFearureФайла = СгенерироватьФайлыДляТестаНаСервере(ТекстЗапроса, ИмяФайлаИсходника);
	
	КодFearureФайла.Записать(ПутьККаталогуТестов + "\" + ИмяФайлаИсходника + ".feature");
	
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.УстановитьТекст(ТекстЗапроса);
	ТекДок.Записать(ПутьККаталогуТестов + "\files\" + ИмяФайлаИсходника + ".txt");
КонецПроцедуры


&НаКлиенте
Функция ТекстЗапросаИзФайла(ПолноеИмяФайла)
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Файл.Расширение = ".q1c" Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолноеИмяФайла);
		Запрос = ТекстЗапросаИзФайлаНаСервере(ДвоичныеДанные);
	Иначе
		
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ТекстЗапросаИзФайлаНаСервере(ДвоичныеДанные)
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Обработки.КонсольЗапросов.Создать().ПрочитатьЗапросыИзФайлаXML(ДвоичныеДанные).Запросы[0].Текст;
	УстановитьПривилегированныйРежим(Ложь);	

	Возврат Запрос;
КонецФункции
