
&НаСервере
Функция КодFearureФайла(Запрос, ИмяЗапроса)
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.ДобавитьСтроку("#language: ru");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("@tree");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Функционал: Создание запроса в конструкторе");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Как Администратор я хочу");
	ТекДок.ДобавитьСтроку("создать запрос в конструкторе");
	ТекДок.ДобавитьСтроку("чтобы получить нужные данные");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Контекст:");
	ТекДок.ДобавитьСтроку("	И я закрыл все окна клиентского приложения");
	ТекДок.ДобавитьСтроку("");
	ТекДок.ДобавитьСтроку("Сценарий: создание простого запроса " + ИмяЗапроса);
	ТекДок.ДобавитьСтроку("	И Я открываю консоль запросов");
	ТекДок.ДобавитьСтроку("	И Я открываю конструктор запросов");	
	
	УстановитьПривилегированныйРежим(Истина);
	Генератор = Обработки.ГенераторFeatureФайлов.Создать();
	УстановитьПривилегированныйРежим(Ложь);	
	Генератор.УстановитьТекстовыйДокумент(ТекДок);
	Генератор.СценарийСозданияПакетаЗапросаВТекДок(Запрос, Символы.Таб);
	ТекДок.ДобавитьСтроку(Символы.Таб + "И Я завершаю редактирование текущего запроса в конструкторе");
	
	Возврат ТекДок;
КонецФункции

Процедура СгенерироватьФайлыДляТестаНаСервере()
	Файл = Новый Файл(ПутьКФайлу);
	ИмяФайлаИсходника = Файл.ИмяБезРасширения;
	
	Запрос = ТекстЗапросаИзФайла(ПутьКФайлу);
	КодFearureФайла = КодFearureФайла(Запрос, Файл.ИмяБезРасширения);
	КодFearureФайла.ДобавитьСтроку("	* Проверка результа создания запроса");
	КодFearureФайла.ДобавитьСтроку("		Тогда Текст запроса в консоли соответствует эталону ""files/" 
		+ ИмяФайлаИсходника + ".txt""");	
	КодFearureФайла.Записать(ПутьККаталогуТестов + "\" + ИмяФайлаИсходника + ".feature");
	
	ТекДок = Новый ТекстовыйДокумент();
	ТекДок.УстановитьТекст(Запрос);
	ТекДок.Записать(ПутьККаталогуТестов + "\files\" + ИмяФайлаИсходника + ".txt");
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьFeatureФайлСозданияЗапроса(Команда)
	СгенерироватьФайлыДляТестаНаСервере()
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаИзФайла(ПутьКФайлу)
	Файл = Новый Файл(ПутьКФайлу);
	Если Файл.Расширение = ".q1c" Тогда
		ДвоичныеДанные = Новый ДвоичныеДанные(ПутьКФайлу);
		УстановитьПривилегированныйРежим(Истина);
		Запрос = Обработки.КонсольЗапросов.Создать().ПрочитатьЗапросыИзФайлаXML(ДвоичныеДанные).Запросы[0].Текст;
		УстановитьПривилегированныйРежим(Ложь);	
	Иначе
		
	КонецЕсли;
	
	Возврат Запрос;
КонецФункции
