#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьОбращениеКПолюИсточника(ЭлементыРазыменования, Контекст) Экспорт
	ПервыйЭлементРазыменования = ЭлементыРазыменования[0];

	Если ТипЗнч(ПервыйЭлементРазыменования) <> Тип("Строка") Тогда
		Возврат;
	КонецЕсли;

	ПолеИсточникаЗапроса = ЭлементыМоделиЗапроса.НовыйПолеИсточника();

	Источник = Контекст.ИспользуемыеТаблицы.Получить(ВРег(ПервыйЭлементРазыменования));

	Если Источник = Неопределено Или Не Контекст.ДоступныПсевдонимыИсточников Тогда
		Результат = НайтиПолеВоВсехИсточниках(ПервыйЭлементРазыменования, Контекст);
		Если Результат.Поле = Неопределено Тогда
			ВызватьИсключение "Таблица " + ПервыйЭлементРазыменования + " не найдена";
		КонецЕсли;

		ПолеИсточникаЗапроса.ИдентификаторИсточника = Результат.Источник.ИдентификаторИсточника;
		ПолеИсточникаЗапроса.ИмяПоля = Результат.Поле.Имя;
	Иначе
		Если ЭлементыРазыменования.Количество() = 1  Тогда
			ВызватьИсключение "Поле " + ПервыйЭлементРазыменования + " не найдено";
		КонецЕсли;

		Если (Не Контекст.ДоступныИсточникиВнешнегоЗапроса
			И Контекст.ИдентификаторыИсточниковВнешнегоЗапроса.Получить(Источник.ИдентификаторИсточника) <> Неопределено) Тогда

			ВызватьИсключение "Таблица " + ПервыйЭлементРазыменования + " не найдена";
		КонецЕсли;

		ПолеИсточникаЗапроса.ИдентификаторИсточника = Источник.ИдентификаторИсточника;
		ПолеИсточникаЗапроса.ИмяПоля = ЭлементыРазыменования[1];

		ЭлементыРазыменования.Удалить(0);
	КонецЕсли;

	ЭлементыРазыменования[0] = ПолеИсточникаЗапроса;
КонецПроцедуры

Функция НайтиПолеВоВсехИсточниках(ИмяПоля, Контекст)
	РезультатПоиска = Новый Структура("Поле, Источник");

	Поле = Неопределено;
	Источник = Неопределено;
	Для Каждого КлючЗначение Из Контекст.ИспользуемыеТаблицы Цикл
		Если (Не Контекст.ДоступныИсточникиВнешнегоЗапроса
			И Контекст.ИдентификаторыИсточниковВнешнегоЗапроса.Получить(КлючЗначение.Значение.ИдентификаторИсточника) <> Неопределено) Тогда

			Продолжить;
		КонецЕсли;

		ТекущееПоле = НайтиПолеВИсточнике(
			ИмяПоля, КлючЗначение.Значение.Источник, Контекст, Ложь);
		Источник = КлючЗначение.Значение;
		Если Поле <> Неопределено
			И ТекущееПоле <> Неопределено Тогда

			ВызватьИсключение "Не однозначное имя поля " + ИмяПоля;
		ИначеЕсли ТекущееПоле <> Неопределено Тогда
			Поле = ТекущееПоле;
			НайденныйИсточника = Источник;
		КонецЕсли;
	КонецЦикла;

	РезультатПоиска.Поле = Поле;
	РезультатПоиска.Источник = НайденныйИсточника;

	Возврат РезультатПоиска;
КонецФункции

Функция НайтиПолеВИсточнике(
	ИмяПоля, Источник, Контекст, РазрешитьНеявноеПолеЛокальногоИсточника = Истина) Экспорт
	Если Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
		Колонка = Источник.ЗапросВыбора.КолонкиПоПсевдонимам.Получить(ВРег(ИмяПоля));
		Если Колонка = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		Возврат МетаданныеТаблицЗапроса.НовыйОписаниеПоля(
			ИмяПоля, ИмяПоля, МетаданныеТаблицЗапроса.ВидПоляОбычное(), Колонка.ТипЗначения);
	ИначеЕсли Источник.Тип = "ИсточникДанныхВременнаяТаблица" Тогда
		ОписаниеВТ = Источник.ОписаниеВТ;
		Если ОписаниеВТ = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
		ТипЗначения = ОписаниеВТ.Колонки.Получить(ВРег(ИмяПоля));
		Если ТипЗначения = Неопределено Тогда
			ЗаполнятьОписаниеВТ = Ложь;
			Контекст.Свойство("ЗаполнятьОписаниеВременныхТаблиц", ЗаполнятьОписаниеВТ);
			Если Не ЗаполнятьОписаниеВТ
				Или ОписаниеВТ.ИндексЗапросаСоздания <> -1
				Или Не РазрешитьНеявноеПолеЛокальногоИсточника Тогда

				Возврат Неопределено;
			КонецЕсли;
			ТипЗначения = МодельЗапросаТипы.ОписаниеПроизвольногоТипа();
			МодельЗапросаУтилиты.ДобавитьПолеВОписаниеВТ(
				ОписаниеВТ, ИмяПоля, ТипЗначения);
		КонецЕсли;
		Возврат МетаданныеТаблицЗапроса.НовыйОписаниеПоля(
			ИмяПоля, ИмяПоля, МетаданныеТаблицЗапроса.ВидПоляОбычное(), ТипЗначения);
	ИначеЕсли Источник.Тип = "ИсточникДанныхТаблицаЗначений"
		И РазрешитьНеявноеПолеЛокальногоИсточника Тогда
		Возврат МетаданныеТаблицЗапроса.НовыйОписаниеПоля(
			ИмяПоля,
			ИмяПоля,
			МетаданныеТаблицЗапроса.ВидПоляОбычное(),
			МодельЗапросаТипы.ОписаниеПроизвольногоТипа());
	ИначеЕсли Источник.Тип = "ИсточникДанныхТаблица"
		Или Источник.Тип = "ИсполняемоеПредставление" Тогда

		Возврат НайтиПолеВИменованномИсточнике(
			Источник.ИмяТаблицы, ИмяПоля, Контекст);
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

Функция НайтиПолеВИменованномИсточнике(ИмяТаблицы, ИмяПоля, Контекст)
	Реестр = Контекст.РеестрПоставщиковМетаданныхТаблиц;
	Если Реестр = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Возврат Реестр.НайтиПоле(ИмяТаблицы, ИмяПоля);
КонецФункции

Функция ТипЭлементаРазыменованияИзОписанияТипов(
	ЭлементРазыменования, ТекущийТип, Контекст) Экспорт

	НовыйТип = Неопределено;
	Для Каждого Тип Из ТекущийТип.Типы() Цикл
		Если Тип = МодельЗапросаТипы.ПроизвольныйТип() Тогда
			Если НовыйТип = Неопределено Тогда
				НовыйТип = МодельЗапросаТипы.ОписаниеПроизвольногоТипа();
			Иначе
				ДобавляемыеТипы = Новый Массив;
				ДобавляемыеТипы.Добавить(МодельЗапросаТипы.ПроизвольныйТип());
				НовыйТип = Новый ОписаниеТипов(НовыйТип, ДобавляемыеТипы);
			КонецЕсли;
			Продолжить;
		КонецЕсли;

		МетаданныеТипа = Метаданные.НайтиПоТипу(Тип);
		Если МетаданныеТипа = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Поле = НайтиПолеВИменованномИсточнике(
			МетаданныеТипа.ПолноеИмя(),
			ЭлементРазыменования,
			Контекст);
		Если Поле = Неопределено
			Или Поле.ВидПоля <> МетаданныеТаблицЗапроса.ВидПоляОбычное()
			Или Поле.ТипЗначения = Неопределено Тогда

			Продолжить;
		КонецЕсли;
		Если НовыйТип = Неопределено Тогда
			НовыйТип = Поле.ТипЗначения;
		Иначе
			НовыйТип = Новый ОписаниеТипов(НовыйТип, Поле.ТипЗначения.Типы());
		КонецЕсли;
	КонецЦикла;

	Если НовыйТип = Неопределено Тогда
		ВызватьИсключение "Поле не найдено " + ЭлементРазыменования;
	КонецЕсли;

	Возврат НовыйТип;
КонецФункции

Функция ТипПоляПоИмени(ИмяПоля, Источник, Контекст) Экспорт
	Поле = НайтиПолеВИсточнике(ИмяПоля, Источник, Контекст);
	Если Поле <> Неопределено Тогда
		Возврат Поле.ТипЗначения;
	КонецЕсли;

	Если Источник.Тип = "ИсточникДанныхВложенныйЗапрос" Тогда
		ВызватьИсключение "Поле " + Источник.Псевдоним + "." + ИмяПоля + " не найдено";
	ИначеЕсли Источник.Тип = "ИсточникДанныхВременнаяТаблица" Тогда
		Если Контекст.ЗаполнятьОписаниеВременныхТаблиц
			И Источник.ОписаниеВТ.ИндексЗапросаСоздания = -1 Тогда
			ТипПоля = МодельЗапросаТипы.ОписаниеПроизвольногоТипа();
			МодельЗапросаУтилиты.ДобавитьПолеВОписаниеВТ(Источник.ОписаниеВТ, ИмяПоля, ТипПоля);

			Возврат ТипПоля;
		Иначе
			ВызватьИсключение "Поле " + Источник.Псевдоним + "." + ИмяПоля + " не найдено";
		КонецЕсли;
	ИначеЕсли Источник.Тип = "ИсточникДанныхТаблица" Тогда
		ВызватьИсключение "Поле " + Источник.Псевдоним + "." + ИмяПоля + " не найдено";
	ИначеЕсли Источник.Тип = "ИсполняемоеПредставление" Тогда
		ВызватьИсключение "Поле " + Источник.Псевдоним + "." + ИмяПоля + " не найдено";
	Иначе
		ВызватьИсключение "Не известный тип источника";
	КонецЕсли;
КонецФункции

Функция ТипИзОписанияТипаЗапроса(ОписаниеТипаЗапроса) Экспорт
	Если ОписаниеТипаЗапроса.Тип = "ОписаниеТипаБулево" Тогда
		Возврат Новый ОписаниеТипов("Булево");
	ИначеЕсли ОписаниеТипаЗапроса.Тип = "ОписаниеТипаДата" Тогда
		Возврат Новый ОписаниеТипов("Дата");
	ИначеЕсли ОписаниеТипаЗапроса.Тип = "ОписаниеТипаЧисло" Тогда
		Возврат Новый ОписаниеТипов("Число");
	ИначеЕсли ОписаниеТипаЗапроса.Тип = "ОписаниеТипаСтрока" Тогда
		Возврат Новый ОписаниеТипов("Строка");
	ИначеЕсли ОписаниеТипаЗапроса.Тип = "ТипСсылочногоПоля" Тогда
		Возврат ТипСссылкиПоОписанию(ОписаниеТипаЗапроса);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ТипСссылкиПоОписанию(ТипСсылочногоПоля)	Экспорт
	Имя = ТипСсылочногоПоля.Группа + "." + ТипСсылочногоПоля.Таблица;
	МетаданныеТипа = Метаданные.НайтиПоПолномуИмени(Имя);
	Если МетаданныеТипа = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;

	Если Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("СправочникСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.Документы.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ДокументСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.Перечисления.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ПеречислениеСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.ПланыОбмена.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ПланОбменаСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.ПланыСчетов.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ПланСчетовСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.ПланыВидовРасчета.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ПланВидовРасчетаСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.ПланыВидовХарактеристик.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ПланВидовХарактеристикСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.БизнесПроцессы.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("БизнесПроцессСсылка." + ТипСсылочногоПоля.Таблица);
	ИначеЕсли Метаданные.Задачи.Содержит(МетаданныеТипа) Тогда
		Возврат Новый ОписаниеТипов("ЗадачаСсылка." + ТипСсылочногоПоля.Таблица);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции

Функция ТипФункцииЗначение(ФункцияЗначение) Экспорт
	Если ФункцияЗначение.ЧастиПути.Количество() = 2 Тогда
		// TODO проверять обращения к системны перечислениям, пока вернем заглущку
		Возврат Новый ОписаниеТипов("ВидДвиженияНакопления");
	Иначе
		ОписаниеСсылочногоПоля = ЭлементыМоделиЗапроса.НовыйТипСсылочногоПоля();
		ОписаниеСсылочногоПоля.Группа = ФункцияЗначение.ЧастиПути[0];
		ОписаниеСсылочногоПоля.Таблица = ФункцияЗначение.ЧастиПути[1];

		Тип = ТипСссылкиПоОписанию(ОписаниеСсылочногоПоля);
		Если ВРег(ФункцияЗначение.ЧастиПути[2]) = "ПУСТАЯССЫЛКА" Тогда
			Возврат Тип;
		Иначе
			// TODO проверить наличие предопределенного элемента
			Возврат Тип;
		КонецЕсли;
	КонецЕсли;
КонецФункции

#КонецОбласти
