#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗначениеПараметра(СтруктураПараметров, ПараметрыВыполнения, ПараметрыЗапроса, ИмяПараметра, Знач ИмяПараметраВыполнения = Неопределено) Экспорт
	Если ИмяПараметраВыполнения = Неопределено Тогда
		ИмяПараметраВыполнения = ИмяПараметра;
	КонецЕсли;
		
	ЗначениеПараметра = ЗначениеПараметраКонстанты(ИмяПараметраВыполнения, ПараметрыВыполнения, ПараметрыЗапроса);
	Если ЗначениеПараметра <> Неопределено Тогда
		СтруктураПараметров[ИмяПараметра] = ЗначениеПараметра;	
	КонецЕсли;	
КонецПроцедуры

Процедура УстановитьЗначениеПараметров(СтруктураПараметров, ПараметрыВыполнения, ПараметрыЗапроса, УстанавливаемыеПараметры) Экспорт
	Для Каждого КлючЗначение Из УстанавливаемыеПараметры Цикл
		ИмяПараметраВыполнения = КлючЗначение.Ключ;
		ИмяПараметра = КлючЗначение.Значение;
		Если ИмяПараметра = Неопределено Тогда
			ИмяПараметра = ИмяПараметраВыполнения;
		КонецЕсли;
		
		УстановитьЗначениеПараметра(
			СтруктураПараметров, 
			ПараметрыВыполнения, 
			ПараметрыЗапроса, 
			ИмяПараметра,
			ИмяПараметраВыполнения);
	КонецЦикла;
КонецПроцедуры

Функция ЗначениеПараметраКонстанты(ИмяПараметра, ПараметрыВыполнения, ПараметрыЗапроса, УчитыватьЗначениеПоУмолчанию = Ложь) Экспорт
	Параметр = ПараметрыВыполнения.ЗначенияПараметровКонстант.Получить(ИмяПараметра);
	Если Параметр = Неопределено Тогда
		Если Не УчитыватьЗначениеПоУмолчанию Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Описание = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмени(ПараметрыВыполнения.ИмяИсполняемогоПредставления);
		ОписаниеПараметра = Описание.ПараметрыПоИменам.Получить(ВРег(ИмяПараметра));
		Если ОписаниеПараметра <> Неопределено
			И ОписаниеПараметра.ЗначениеПоУмолчанию <> Неопределено Тогда
		
			Возврат ОписаниеПараметра.ЗначениеПоУмолчанию;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецЕсли;	
	
	Если Параметр.ЭтоПараметрЗапроса Тогда
		Возврат ПараметрыЗапроса[Параметр.Значение];
	Иначе
		Возврат Параметр.Значение
	КонецЕсли;
КонецФункции

Функция ИспользуютсяПоляПредставления(СписокПолейСтрокой, ПараметрыВыполнения) Экспорт
	Поля = СтрРазделить(СписокПолейСтрокой, ",");
	
	Для Каждого Поле Из Поля Цикл
		Если ПараметрыВыполнения.ИспользуемыеПоля.Получить(СокрЛП(ВРег(Поле))) <> Неопределено Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция УдалитьБлокПоместитьИзПоследнегоЗапроса(ТекстЗапроса) Экспорт
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	Схема.ПакетЗапросов[Схема.ПакетЗапросов.Количество() - 1].ТаблицаДляПомещения = Неопределено;
	
	Возврат Схема.ПолучитьТекстЗапроса(); 	
КонецФункции

#КонецОбласти