#Область СлужебныеПроцедурыИФункции

// Новый параметры выполнения представления.
// 
// Возвращаемое значение:
//  Структура - Новый параметры выполнения представления:
// * ИмяИсполняемогоПредставления - Строка
// * ИмяВТРезультат - Строка - 
// * ОписаниеВТФильтр - см. НовыйОписаниеВТФильтр
// * ЗначенияПараметровКонстант - Соответствие из КлючИЗначение:
// 	** Ключ - Строка
// 	** Значение - см. НовыйЗначениеПараметраКонстанта 
// * Отборы - Массив из см. НовыйЭлементОтбора
// * Индексы - Массив из Строка
// * ПсевдонисыПолей - Соответствие из КлючИЗначение:
// 	** Ключ - Строка
// 	** Значение - Строка
// * ИспользуемыеПоля - Соответствие из КлючИЗначение:
// 	** Ключ - Строка
// 	** Значение - Булево
// * ТолькоРазрешенные - Булево 
Функция НовыйПараметрыВыполненияПредставления() Экспорт
	Параметры = Новый Структура();
	Параметры.Вставить("ИмяИсполняемогоПредставления", "");
	Параметры.Вставить("ИмяВТРезультат", "");
	Параметры.Вставить("ОписаниеВТФильтр");	
	Параметры.Вставить("ЗначенияПараметровКонстант", Новый Соответствие());
	Параметры.Вставить("Отборы", Новый Массив());
	Параметры.Вставить("Индексы", Новый Массив());
	Параметры.Вставить("ПсевдонисыПолей", Новый Соответствие());
	Параметры.Вставить("ИспользуемыеПоля", Новый Соответствие());
	Параметры.Вставить("ТолькоРазрешенные", Ложь);
	
	Возврат Параметры;
КонецФункции

// Новый описание ВТФильтр.
// 
// Возвращаемое значение:
//  Структура - Новый описание ВТФильтр:
// * ИмяВТ - Строка - 
// * ПсевдонимыПолей - Соответствие из Строка, Строка 
Функция НовыйОписаниеВТФильтр() Экспорт
	Описание = Новый Структура();
	Описание.Вставить("ИмяВТ", "");
	Описание.Вставить("ПсевдонимыПолей", Новый Соответствие());	
	
	Возврат Описание;
КонецФункции

// Новый значение параметра константа.
// 
// Возвращаемое значение:
//  Структура - Новый значение параметра константа:
// * Значение - Произвольный 
// * ЭтоПараметрЗапроса - Булево
Функция НовыйЗначениеПараметраКонстанта() Экспорт
	ЗначениеПараметраКонстанта = Новый Структура();
	ЗначениеПараметраКонстанта.Вставить("Значение");
	ЗначениеПараметраКонстанта.Вставить("ЭтоПараметрЗапроса", Ложь);	
	
	Возврат ЗначениеПараметраКонстанта;
КонецФункции

// Новый элемент отбора.
// 
// Возвращаемое значение:
//  Структура - Новый элемент отбора:
// * ПутьКПолю - Массив из Строка
// * ВидСравнения - Строка - 
// * ЗначениеОтбора - см. НовыйЭлементОтбора
Функция НовыйЭлементОтбора() Экспорт
	ЭлементОтбора = Новый Структура();	
	ЭлементОтбора.Вставить("ПутьКПолю", Новый Массив());
	ЭлементОтбора.Вставить("ВидСравнения", "");
	ЭлементОтбора.Вставить("ЗначениеОтбора");
	
	Возврат ЭлементОтбора;
КонецФункции

// Значение отбора.
// 
// Возвращаемое значение:
//  Структура - Значение отбора:
// * Значение - Произвольный
// * ЭтоПараметрЗапроса - Булево
Функция НовыйЗначениеОтбора() Экспорт
	ЗначениеОтбора = Новый Структура();
	ЗначениеОтбора.Вставить("Значение", Неопределено);
	ЗначениеОтбора.Вставить("ЭтоПараметрЗапроса", Ложь);	
	
	Возврат ЗначениеОтбора;
КонецФункции



#КонецОбласти