#Область СлужебныеПроцедурыИФункции

Функция ОписаниеБазовогоОтбора() Экспорт
	Возврат ЭлементыМоделиОписанияПредставлений.НовыйОписаниеОтбора();		
КонецФункции

Функция ОписаниеОтбораСоВсемиВозможнстями() Экспорт
	ОписаниеОтбора = ЭлементыМоделиОписанияПредставлений.НовыйОписаниеОтбора();
	
	ОписаниеОтбора.ДоступенВПараметрах = Истина;
	ОписаниеОтбора.ПробрасыватьОтборИзСекцииГДЕ = Истина;
	
	ОписаниеОтбора.ДополнительныеОперации.ИЛИ = Истина;
	ОписаниеОтбора.ДополнительныеОперации.СравнениеПолейИсточника = Истина;
	ОписаниеОтбора.ДополнительныеОперации.МЕЖДУ = Истина;
	ОписаниеОтбора.ДополнительныеОперации.ПОДОБНО = Истина;
	ОписаниеОтбора.ДополнительныеОперации.МЕЖДУ = Истина;
	ОписаниеОтбора.ДополнительныеОперации.ПОДОБНО = Истина;
	ОписаниеОтбора.ДополнительныеОперации.ВложенныйЗапрос = Истина;
	ОписаниеОтбора.ДополнительныеОперации.СписокВыражений = Истина;
	ОписаниеОтбора.ДополнительныеОперации.РазыменованиеПолей = Истина;
	ОписаниеОтбора.ДополнительныеОперации.ФункцииЯзыкаЗапросов = Истина;
	ОписаниеОтбора.ДополнительныеОперации.ЯзыкВыражений = Истина;
		
	Возврат ОписаниеОтбора;		
КонецФункции


#КонецОбласти