
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
перем ПакетЗапросов;
	
#Область СлужебныеПроцедурыИФункции

//@skip-check module-empty-method
Процедура Инициализировать(ЗначенияПараметровЗапроса) Экспорт
	ПараметрыМетода = Новый Массив();
	Для Каждого КлючЗначение Из ЗначенияПараметровЗапроса Цикл
		ПараметрыМетода.Добавить(КлючЗначение.Ключ);	
	КонецЦикла;
КонецПроцедуры

Функция КодЗапросаДляСКД() Экспорт
	Если Не ЗначениеЗаполнено(ПакетЗапросов) Тогда
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = СтрСоединить(ПакетЗапросов, " ; ");
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(ТекстЗапроса);
	Возврат Схема.ПолучитьТекстЗапроса();
КонецФункции

Функция ИсполнитьУзелИсполняемоеПредставление(ИсполняемоеПредставление, ПараметрыИсполнения) Экспорт
	ОписаниеПредставления = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмени(ИсполняемоеПредставление.ИмяТаблицы);
	Если Не ОписаниеПредставления.ДоступноВМеханизмеПредставленийСКД Тогда
		ВызватьИсключение "Исполняемое представление " + ОписаниеПредставления.Имя + " не поддерживает генерацию кода для СКД";
	КонецЕсли;
	
	ГенераторКода = ПоставщикИсполняемыхПредставлений.ГенераторТекстаЗапросаДляСКД(ОписаниеПредставления);
	ТекстЗапроса = ГенераторКода.ТекстЗапросаДляСКД(ПараметрыИсполнения);
	ДобавитьЗапросВТекущийПакет(ТекстЗапроса);
КонецФункции

Функция ИсполнитьУзелЗапросУничтожения(ЗапросУничтожения) Экспорт
	ТекстЗапроса = ГенерацияТекстовЗапросов.ТекстЗапросаУничтожения(ЗапросУничтожения);
	ДобавитьЗапросВТекущийПакет(ТекстЗапроса);
КонецФункции

Функция ИсполнитьУзелЗапросВыбора(ЗапросВыбора) Экспорт
	ТекстЗапрса = ГенерацияТекстовЗапросов.ТекстЗапросаВыбора(ЗапросВыбора);
	ДобавитьЗапросВТекущийПакет(ТекстЗапрса);
КонецФункции

Функция ИсполнитьУзелУничтожитьВТ(ИмяВТ) Экспорт
	ТекстЗапроса = "УНИЧТОЖИТЬ " + ИмяВТ;
	
	ДобавитьЗапросВТекущийПакет(ТекстЗапроса);
КонецФункции

#КонецОбласти

#Область ВспомогательныеМетоды

Процедура ДобавитьЗапросВТекущийПакет(ТекстЗапроса)
	ПакетЗапросов.Добавить(ТекстЗапроса);	
КонецПроцедуры

#КонецОбласти

ПакетЗапросов = Новый Массив();;	

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
