Функция ПараметрыПостроенияВТИмяРегистра()
	
	ПараметрыПостроения = Новый Структура;
	ПараметрыПостроения.Вставить("ИндексироватьПо");
	ПараметрыПостроения.Вставить("Отборы", Новый Массив);
	ПараметрыПостроения.Вставить("ФормироватьСПериодичностьДень", Истина);
	ПараметрыПостроения.Вставить("ИспользоватьРасширениеЯзыкаЗапросовДляСКД", Истина);
	ПараметрыПостроения.Вставить("ПостоянныеПоля");
	ПараметрыПостроения.Вставить("ИсключаемыеРегистраторы", Ложь);
	ПараметрыПостроения.Вставить("СоответствиеПсевдонимовПолей", Новый Соответствие);
	ПараметрыПостроения.Вставить("СоответствиеПсевдонимовПолейСКД", Новый Соответствие);
	ПараметрыПостроения.Вставить("ИсключатьНеИспользуемыеПоля", Истина);
	
	Возврат ПараметрыПостроения;
	
КонецФункции

Функция ОписаниеФильтраДляСоздатьВТИмяРегистра(Знач ТаблицаФильтра, Знач ИзмеренияФильтра = "", Знач ПоляФильтра = "") Экспорт
	
	ОписаниеФильтра = Новый Структура;
	
	ОписаниеФильтра.Вставить("ВременнаяТаблица", ТипЗнч(ТаблицаФильтра) = Тип("Строка"));
	ОписаниеФильтра.Вставить("ТаблицаФильтра", ТаблицаФильтра);
	ОписаниеФильтра.Вставить("ИзмеренияФильтра", ИзмеренияФильтра);
	ОписаниеФильтра.Вставить("СоответствиеИзмеренийРегистраИзмерениямФильтра", Новый Соответствие);
	Если ТипЗнч(ПоляФильтра) = Тип("Строка") Тогда
		МассивПолейФильтра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляФильтра, , , Истина);
	Иначе
		МассивПолейФильтра = ИзмеренияФильтра;
	КонецЕсли;
	ОписаниеФильтра.Вставить("ПоляФильтра", МассивПолейФильтра);
	
	Возврат ОписаниеФильтра;
	
КонецФункции
