
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ИсполняемыйЗапрос; // Запрос

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать(ЗначенияПараметровЗапроса, МенеджерВременныхТаблиц = Неопределено) Экспорт
	Если МенеджерВременныхТаблиц = Неопределено Тогда
		ИсполняемыйЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Иначе
		ИсполняемыйЗапрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	КонецЕсли;
		
	Для Каждого КлючЗначение Из ЗначенияПараметровЗапроса Цикл
		ИсполняемыйЗапрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	
КонецПроцедуры

Функция ИсполнитьУзелИсполняемоеПредставление(ИсполняемоеПредставление, ПараметрыИсполнения) Экспорт
	
	Описание = ПоставщикИсполняемыхПредставлений.ОписаниеПредставленияПоИмениТаблицы(ИсполняемоеПредставление.ИмяТаблицы);
	Исполнитель = ПоставщикИсполняемыхПредставлений.ИсполнительПредставления(Описание);
	
	Если ПараметрыИсполнения.УдалятьПромежуточныеВТ Тогда
		ИменаВТДо = ИменаИспользуемыхВТ();	
	КонецЕсли;
	
	Результат = Исполнитель.Исполнить(ПараметрыИсполнения, ИсполняемыйЗапрос);
	
	Если ПараметрыИсполнения.УдалятьПромежуточныеВТ Тогда
		УдалитьПромежуточныеВТ(ПараметрыИсполнения.ИмяВТРезультат, ИменаВТДо);
	КонецЕсли;
	
	Возврат Результат;		
КонецФункции

Функция ИсполнитьУзелЗапросУничтожения(ЗапросУничтожения) Экспорт
	ТекстЗапроса = ГенерацияТекстовЗапросов.ТекстЗапросаУничтожения(ЗапросУничтожения);
	ИсполняемыйЗапрос.Текст = ТекстЗапроса;	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

Функция ИсполнитьУзелЗапросВыбора(ЗапросВыбора) Экспорт
	ТекстЗапроса = ГенерацияТекстовЗапросов.ТекстЗапросаВыбора(ЗапросВыбора);
	ИсполняемыйЗапрос.Текст = ТекстЗапроса;
	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

Функция ИсполнитьУзелУничтожитьВТ(ИмяВТ) Экспорт
	ИсполняемыйЗапрос.Текст = "УНИЧТОЖИТЬ " + ИмяВТ;
	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

Функция ИменаИспользуемыхВТ()
	ИменаВТ = Новый Соответствие;
	Для Каждого ВТ Из ИсполняемыйЗапрос.МенеджерВременныхТаблиц.Таблицы Цикл	
		ИменаВТ.Вставить(ВРег(ВТ.ПолноеИмя), Истина);
	КонецЦикла;
	
	Возврат ИменаВТ;
КонецФункции

Процедура УдалитьПромежуточныеВТ(ИмяВТРезультат, ИменаИспользуемыхВТ)
	ШаблонЗапросаУничтожения = "УНИЧТОЖИТЬ #ИмяВТ";
	
	ЧастиЗапроса = Новый Массив();
	Для Каждого ВТ Из ИсполняемыйЗапрос.МенеджерВременныхТаблиц.Таблицы Цикл
		Если ВРег(ВТ.ПолноеИмя) <> ВРег(ИмяВТРезультат)
			И ИменаИспользуемыхВТ.Получить(ВРег(ВТ.ПолноеИмя)) = Неопределено Тогда
			
			ЧастиЗапроса.Добавить(СтрЗаменить(ШаблонЗапросаУничтожения, "#ИмяВТ", ВТ.ПолноеИмя));	
		КонецЕсли;
	КонецЦикла;
	
	Если ЧастиЗапроса.Количество() > 0 Тогда			
		Запрос = Новый Запрос(СтрСоединить(ЧастиЗапроса, ";" + Символы.ПС));
		Запрос.МенеджерВременныхТаблиц = ИсполняемыйЗапрос.МенеджерВременныхТаблиц;
		Запрос.Выполнить();
	КонецЕсли;
КонецПроцедуры

#Область Инициализация

ИсполняемыйЗапрос = Новый Запрос();

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
