
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ИсполняемыйЗапрос;
	
#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать(ЗначенияПараметровЗапроса) Экспорт
	ИсполняемыйЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц();
	Для Каждого КлючЗначение Из ЗначенияПараметровЗапроса Цикл
		ИсполняемыйЗапрос.УстановитьПараметр(КлючЗначение.Ключ, КлючЗначение.Значение);
	КонецЦикла;	
КонецПроцедуры

Функция ИсполнитьУзелИсполняемоеПредставление(ИсполняемоеПредставление, ПараметрыИсполнения) Экспорт
	
	Исполнитель = ПоставщикИсполняемыхПредставлений.ИсполнительПредставления(ИсполняемоеПредставление.ИмяТаблицы);
	
	Возврат Исполнитель.Исполнить(ПараметрыИсполнения, ИсполняемыйЗапрос);		
КонецФункции

Функция ИсполнитьУзелЗапросУничтожения(ЗапросУничтожения) Экспорт
	ТекстЗапрса = ГенерацияТекстовЗапросов.ТекстЗапросаУничтожения(ЗапросУничтожения);
	ИсполняемыйЗапрос.Текст = ТекстЗапрса;	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

Функция ИсполнитьУзелЗапросВыбора(ЗапросВыбора) Экспорт
	ТекстЗапрса = ГенерацияТекстовЗапросов.ТекстЗапросаВыбора(ЗапросВыбора);
	ИсполняемыйЗапрос.Текст = ТекстЗапрса;
	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

Функция ИсполнитьУзелУничтожитьВТ(ИмяВТ) Экспорт
	ИсполняемыйЗапрос.Текст = "УНИЧТОЖИТЬ " + ИмяВТ;
	
	Возврат ИсполняемыйЗапрос.Выполнить();
КонецФункции

ИсполняемыйЗапрос = Новый Запрос();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
