#Область СлужебныеПроцедурыИФункции

Процедура ОбработчикКоманды(ФормаОтчета, Команда, Результат) Экспорт
	Если Команда.Имя = "Подключаемая_УстановитьЗапрос" Тогда
		ОткрытьРедакторЗапроса(ФормаОтчета);
		Результат = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьРедакторЗапроса(ФормаОтчета)
	ТекстЗапроса = ТекстЗапросаИзНастроек(ФормаОтчета);
	ПараметрыОткрытия = Новый Структура("ТекстЗапроса", ТекстЗапроса);
	
	Оповещение = Новый ОписаниеОповещения(
		"УстановитьТекстЗапроса",
		ЭтотОбъект,
		Новый Структура("ФормаОтчета", ФормаОтчета));
	
	ОткрытьФорму(
		"Отчет.УниверсальныйОтчетРасширенный.Форма.РедакторЗапроса",
		ПараметрыОткрытия,
		ФормаОтчета,
		,
		,
		,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

Функция ТекстЗапросаИзНастроек(ФормаОтчета)
	Для Каждого ЗначениеПараметра Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если ЗначениеПараметра.Параметр = Новый ПараметрКомпоновкиДанных("ТекстЗапросаИсточника") Тогда
			Возврат ЗначениеПараметра.Значение;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат "";
КонецФункции

Процедура УстановитьТекстЗапроса(ТекстЗапроса, ДополнительныеПараметры) Экспорт
	Если ТекстЗапроса = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаОтчета = ДополнительныеПараметры.ФормаОтчета;
	Для Каждого ЗначениеПараметра Из ФормаОтчета.Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы Цикл
		Если ЗначениеПараметра.Параметр = Новый ПараметрКомпоновкиДанных("ТекстЗапросаИсточника") Тогда
			ЗначениеПараметра.Значение = ТекстЗапроса;
			Возврат;
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти