#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// <parsergen:entrypoints>

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Инициализировать();
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентификатор");
КонецПроцедуры

Функция НовыйБуферТокенов()
	Буфер = Новый Структура("ИндексТекущегоЭлемента, Токены");
	Буфер.ИндексТекущегоЭлемента = -1;
	Буфер.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	Возврат Буфер;
КонецФункции

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();
КонецПроцедуры

Процедура ЗаполнитьБуферТокенов()
	МаксимальныйИндекс = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для Индекс = Сдвиг По МаксимальныйИндекс Цикл
			БуферТокенов.Токены[Индекс - Сдвиг] = БуферТокенов.Токены[Индекс];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;
	КонецЕсли;
	КоличествоДочитываемых = МаксимальныйИндекс - БуферТокенов.ИндексТекущегоЭлемента;
	Для Сч = 1 По КоличествоДочитываемых Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();
	КонецЦикла;
КонецПроцедуры

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = -1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		Возврат БуферТокенов.Токены[0];
	КонецЕсли;
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	ЗаполнитьБуферТокенов();
	Возврат Токен;
КонецФункции

Процедура УстановитьТекущийТокен()
	ТекущийТокен = СледующийТокенИзБуфера();
КонецПроцедуры

Функция ТипТокенаПросмотра(Смещение)
	Индекс = БуферТокенов.ИндексТекущегоЭлемента + Смещение;
	Если Индекс < 0 Или Индекс >= БуферТокенов.Токены.Количество() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Токен = БуферТокенов.Токены[Индекс];
	Если Токен = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат Токен.Тип;
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТипТокенаПросмотра(0) <> ТипТерминала Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипТерминала, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Тип;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Лексема(ТипЛексемы)
	Возврат Терминал(ТипЛексемы);
КонецФункции

Функция Идентификатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентификатор", ТипИдентификатора, ТипТокенаПросмотра(0));
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипИдентификатора, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Лексема;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТипТокенаПросмотра(0) <> ТипКонстанты Тогда
		ВызватьИсключениеСинтаксическаяОшибка(ТипКонстанты, Истина);
	КонецЕсли;
	Значение = ТекущийТокен.Значение;
	УстановитьТекущийТокен();
	Возврат Значение;
КонецФункции

// <parsergen:entry-results>

Процедура ВызватьИсключениеСинтаксическаяОшибка(Ожидаемое, ОжидаетсяКонкретныйТокен = Ложь)
	Если ТекущийТокен = Неопределено Тогда
		Если ОжидаетсяКонкретныйТокен Тогда
			ВызватьИсключение "Синтаксическая ошибка. Ожидается """ + Ожидаемое + """";
		Иначе
			ВызватьИсключение "Синтаксическая ошибка. Ожидается следующий токен";
		КонецЕсли;
	ИначеЕсли ОжидаетсяКонкретныйТокен Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, Ожидаемое);
		ВызватьИсключение ТекстОшибки;
	ИначеЕсли ТипТокенаПросмотра(0) = Неопределено Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается следующий токен";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола);
		ВызватьИсключение ТекстОшибки;
	Иначе
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Неожиданный токен ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТекущийТокен.Тип);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
КонецПроцедуры

Процедура ВызватьИсключениеСинтаксическаяОшибкаОжидаемыеТокены(ОжидаемыеТокены)
	Если ТекущийТокен = Неопределено Тогда
		ВызватьИсключение "Синтаксическая ошибка. Ожидается один из токенов: " + ОжидаемыеТокены;
	КонецЕсли;

	ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается один из токенов: %3";
	ТекстОшибки = СтрШаблон(
		ШаблонОшибки,
		ТекущийТокен.НомерСтроки,
		ТекущийТокен.НомерСимвола,
		ОжидаемыеТокены);
	ВызватьИсключение ТекстОшибки;
КонецПроцедуры

// <parsergen:productions>

#КонецОбласти

#Область Инициализация

КоличествоПросматриваемыхСимволов = {{LOOKAHEAD}};
Инициализировать();

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
