#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТекущийТокен;
Перем ЛексическийАнализатор;
Перем ТаблицаПервыхСимволовВариантов;
Перем ОпределенияИдентификаторов;
Перем БуферТокенов;
Перем КоличествоПросматриваемыхСимволов;
Перем ПоследняяПродукция;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// <parsergen:entrypoints>

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура Инициализировать()
	ЛексическийАнализатор = Обработки.ЛексическийАнализатор.Создать();
	ЛексическийАнализатор.Инициализировать();
	ТаблицаПервыхСимволовВариантов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ТаблицаПервыхСимволовВариантов").ПолучитьТекст());
	ОпределенияИдентификаторов = ЗначениеИзСтрокиВнутр(ПолучитьМакет("ОпределенияИдентификаторов").ПолучитьТекст());
	ОпределенияИдентификаторов.Индексы.Добавить("Тип, Идентификатор");
	
	ИндексируемыеПоля = Новый Массив;
	ИндексируемыеПоля.Добавить("Продукция");
	ИндексируемыеПоля.Добавить("КоличествоЭлементов");
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		ИндексируемыеПоля.Добавить("Элемент" + Сч);
		ТаблицаПервыхСимволовВариантов.Индексы.Добавить(СтрСоединить(ИндексируемыеПоля, ","));
	КонецЦикла;		
КонецПроцедуры	

Функция НовыйБуферТокенов()
	БуферТокенов = Новый Структура("ИндексТекущегоЭлемента, Токены");
	БуферТокенов.ИндексТекущегоЭлемента = -1;
	БуферТокенов.Токены = Новый Массив(КоличествоПросматриваемыхСимволов);
	
	Возврат БуферТокенов;
КонецФункции	

Процедура УстановитьБуферТокенов()
	БуферТокенов = НовыйБуферТокенов();	
КонецПроцедуры	

Процедура ЗаполнитьБуферТокенов()	
	МаксимальныйИндексБуфера = КоличествоПросматриваемыхСимволов - 1;
	Если БуферТокенов.ИндексТекущегоЭлемента > 0 Тогда
		Сдвиг = БуферТокенов.ИндексТекущегоЭлемента;
		Для ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента По МаксимальныйИндексБуфера Цикл
			БуферТокенов.Токены[ИндексТекущегоЭлемента - Сдвиг] = БуферТокенов.Токены[ИндексТекущегоЭлемента];
		КонецЦикла;
		БуферТокенов.ИндексТекущегоЭлемента = 0;
	ИначеЕсли БуферТокенов.ИндексТекущегоЭлемента <> -1 И БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента] = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	КоличествоДочитываемыхЭлементов = МаксимальныйИндексБуфера - БуферТокенов.ИндексТекущегоЭлемента;
	
	Для Сч = 1 По КоличествоДочитываемыхЭлементов Цикл
		БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч] = ЛексическийАнализатор.СледующийТокен();
	КонецЦикла;	
КонецПроцедуры	

Функция СледующийТокенИзБуфера()
	Если БуферТокенов.ИндексТекущегоЭлемента = - 1 Тогда
		ЗаполнитьБуферТокенов();
		БуферТокенов.ИндексТекущегоЭлемента = 0;
		
		Возврат БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
	КонецЕсли;
	
	БуферТокенов.ИндексТекущегоЭлемента = БуферТокенов.ИндексТекущегоЭлемента + 1;
	Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента];
		
	ЗаполнитьБуферТокенов();
	
	Возврат Токен;
КонецФункции	

Процедура УстановитьТекущийТокен()
	ТекущийТокен = СледующийТокенИзБуфера();	
КонецПроцедуры	

Функция НомерВариантаПродукции(Продукция)
	СтруктураПоиска = Новый Структура("Продукция, КоличествоЭлементов", Продукция, 0);
	
	Для Сч = 1 По КоличествоПросматриваемыхСимволов Цикл
		Токен = БуферТокенов.Токены[БуферТокенов.ИндексТекущегоЭлемента + Сч - 1];
		Если Токен <> Неопределено И Токен.Тип <> Неопределено  Тогда
			СтруктураПоиска.Вставить("Элемент" + Сч, Токен.Тип);
			СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов + 1;
		КонецЕсли;
	КонецЦикла;		

	Для Сч = 0 По Макс(СтруктураПоиска.КоличествоЭлементов - 1, 0) Цикл
		СтрокиПервыхСимволов = ТаблицаПервыхСимволовВариантов.НайтиСтроки(СтруктураПоиска);
		Если СтрокиПервыхСимволов.Количество() > 0 Тогда
			Возврат СтрокиПервыхСимволов[0].НомерВарианта;
		КонецЕсли;	
		
		СтруктураПоиска.Удалить("Элемент" + (СтруктураПоиска.КоличествоЭлементов - Сч));
		СтруктураПоиска.КоличествоЭлементов = СтруктураПоиска.КоличествоЭлементов - 1;
	КонецЦикла;
	
	Возврат Неопределено;
КонецФункции

Функция Терминал(ТипТерминала)
	Если ТекущийТокен.Тип <> ТипТерминала Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипТерминала);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущийТокен();
	
	Возврат Тип;
КонецФункции

Функция Лексема(ТипЛексемы)
	Если ТекущийТокен.Тип <> ТипЛексемы Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипЛексемы);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
	
	Тип = ТекущийТокен.Тип; 

	УстановитьТекущийТокен();
	
	Возврат Тип;
КонецФункции

Функция Идентификатор(ТипИдентификатора)
	СтруктураПоиска = Новый Структура("Тип, Идентификатор", ТипИдентификатора, ТекущийТокен.Тип);
	
	Если ОпределенияИдентификаторов.НайтиСтроки(СтруктураПоиска).Количество() = 0 Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипИдентификатора);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
	
	Лексема = ТекущийТокен.Лексема; 
	
	УстановитьТекущийТокен();
	
	Возврат Лексема;
КонецФункции

Функция Константа(ТипКонстанты)
	Если ТекущийТокен.Тип <> ТипКонстанты Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТипКонстанты);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;	
	
	Значение = ТекущийТокен.Значение; 
	
	УстановитьТекущийТокен();
	
	Возврат Значение;
КонецФункции

// <parsergen:entry-results>

Процедура ВызватьИсключениеНеУдалосьВыпполнитьРазбор(Продукция)
	Если ТекущийТокен.Тип <> Неопределено И Продукция <> Неопределено Тогда
		СтруктураПоиска = Новый Структура("Продукция", Продукция, 0);
		СтруктураПоиска.Вставить("Элемент1", ТекущийТокен.Тип);
		
		Если ТаблицаПервыхСимволовВариантов.НайтиСтроки(СтруктураПоиска).Количество() > 0 Тогда
			УстановитьТекущийТокен();
			ВызватьИсключениеСинтаксическаяОшибка();		
		Иначе
			ВызватьИсключениеСинтаксическаяОшибка();
		КонецЕсли;	
	Иначе
		ВызватьИсключениеСинтаксическаяОшибка();	
	КонецЕсли;
КонецПроцедуры

Процедура ВызватьИсключениеСинтаксическаяОшибка()
	Если ТекущийТокен.Тип = Неопределено Тогда
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Ожидается следующий токен";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола);
		ВызватьИсключение ТекстОшибки;
	Иначе
		ШаблонОшибки = "{(%1, %2)}: Синтаксическая ошибка. Неожиданный токен ""%3""";
		ТекстОшибки = СтрШаблон(ШаблонОшибки, ТекущийТокен.НомерСтроки, ТекущийТокен.НомерСимвола, ТекущийТокен.Лексема);
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;		
КонецПроцедуры

// <parsergen:productions>