	
Процедура ОткрытьРедакторЗапроса(ПараметрыОткрытия, Владелец, Оповещение) Экспорт
	ОткрытьФорму(
		"Обработка.КонструкторЗапросов.Форма.КонструкторЗапросов", 
		ПараметрыОткрытия,
		Владелец, , , ,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		  	
КонецПроцедуры

Процедура ОткрытьРедакторВыражений(ПараметрыОткрытия, Оповещение) Экспорт
	ОткрытьФорму(
		"Обработка.КонструкторЗапросов.Форма.РедакторВыражений", 
		ПараметрыОткрытия, ЭтотОбъект, , , ,
		Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
КонецПроцедуры  