#Область СлужебныеПроцедурыИФункции

Функция ОписаниеТипаДата() Экспорт
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Дата);
	Возврат Новый ОписаниеТипов("Дата", , , , ,КвалификаторДаты);
КонецФункции	

Функция ОписаниеТипаДатаВремя() Экспорт
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	Возврат Новый ОписаниеТипов("Дата", , , , ,КвалификаторДаты);
КонецФункции	

Функция ОписаниеТипаВремя() Экспорт
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.Время);
	Возврат Новый ОписаниеТипов("Дата", , , , ,КвалификаторДаты);
КонецФункции

//TODO отказаться

Функция ОписаниеПараметраКонстанта(Имя, ТипКонстанты, Обязательный = Истина, ЗначениеПоУмолчанию = Неопределено, ДопустимПараметрЗапроса = Истина) Экспорт
	ОписаниеПараметра = ЭлементыМоделиОписанияПредставлений.НовыйОписаниеПараметраКонстанта(); 
	ОписаниеПараметра.Имя = Имя;
	ОписаниеПараметра.Обязательный = Обязательный;   
	
	ОписаниеПараметра.ЗначениеПоУмолчанию = ЗначениеПоУмолчанию;
	ОписаниеПараметра.ДопустимПараметрЗапроса = ДопустимПараметрЗапроса;
	ОписаниеПараметра.ТипКонстанты = ТипКонстанты;		
	
	Возврат ОписаниеПараметра;
КонецФункции

#КонецОбласти