#Область ТестовыйИнтерфейс

Процедура ИсполняемыеСценарии() Экспорт

    ЮТТесты
        .ДобавитьТестовыйНабор("СемантикаЧистыеВыражения")
            .Тег("СемантикаЧистая")
            .ДобавитьСерверныйТест("ВыводТипаЧисловойКонстанты");

КонецПроцедуры

Процедура ВыводТипаЧисловойКонстанты() Экспорт

    Результат = ОбработатьУзел(НовыйУзелКонстанты(1));
    ПроверитьТипы(Результат.ТипЗначения, МассивТипов(Тип("Число")),
        "Числовая константа должна иметь тип Число");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйУзелКонстанты(Значение)
    Узел = ЭлементыМоделиЗапроса.НовыйКонстанта();
    Узел.Значение = Значение;
    Возврат Узел;
КонецФункции

Функция ОбработатьУзел(Узел, Контекст = Неопределено)
    Если Контекст = Неопределено Тогда
        Контекст = Новый Структура;
    КонецЕсли;
    Результат = ЭлементыМоделиЗапроса.НовыйВыражениеМоделиЗапроса();
    Результат.Значение = Узел;
    ОбработкаМоделиЗапроса.ОбработатьВыражение(Узел, Контекст, Результат);
    Возврат Результат;
КонецФункции

Функция МассивТипов(
    Тип1,
    Тип2 = Неопределено,
    Тип3 = Неопределено,
    Тип4 = Неопределено)

    Результат = Новый Массив;
    Результат.Добавить(Тип1);
    Если Тип2 <> Неопределено Тогда
        Результат.Добавить(Тип2);
    КонецЕсли;
    Если Тип3 <> Неопределено Тогда
        Результат.Добавить(Тип3);
    КонецЕсли;
    Если Тип4 <> Неопределено Тогда
        Результат.Добавить(Тип4);
    КонецЕсли;
    Возврат Результат;
КонецФункции

Процедура ПроверитьТипы(ОписаниеТипов, ОжидаемыеТипы, ОписаниеПроверки)
    ЮТест.ОжидаетЧто(ОписаниеТипов.Типы().Количество())
        .Равно(ОжидаемыеТипы.Количество(), ОписаниеПроверки);
    Для Каждого ОжидаемыйТип Из ОжидаемыеТипы Цикл
        ЮТест.ОжидаетЧто(ОписаниеТипов.СодержитТип(ОжидаемыйТип))
            .ЭтоИстина(ОписаниеПроверки);
    КонецЦикла;
КонецПроцедуры

#КонецОбласти
