#Область СлужебныеПроцедурыИФункции

// Новый описание представления.
// 
// Возвращаемое значение:
//  Структура - Новый описание представления:
// * Тип - Строка - 
// * Имя - Строка - 
// * ПолноеИмя - Строка - 
// * Поля - Массив из см. НовыйПолеПредставления - 
// * ОписаниеВТФильтр - см. НовыйОписаниеВТФильтр
// * ОписаниеПараметров - Массив из см. НовыйОписаниеПараметраКонстанта - 
// * ДоступныеОтборы - Массив из см. НовыйОписаниеОтбора
// * ПоддерживаетсяПсевдонимыПолей - Булево
// * ПоддерживаютсяИндексы - Булево - 
// * ПоддерживаетсяПолучениеРезультатаЗапроса - Булево - 
// * ИмяФормируемойВТПоУмолчанию - Строка -
// * ИмяВТДляСКД - Строка
// * ПоддерживаетсяУказаниеИмяВТРезультат - Булево - 
// * ПоляПоИменам - Соответствие из КлючИЗначение:
// 		** Ключ - Строка -
// 		** Значение - см. НовыйПолеПредставления
// * ПараметрыПоИменам - Соответствие из КлючИЗначение:
// 		** Ключ - Строка -
// 		** Значение - см. НовыйОписаниеПараметраКонстанта
// * ДоступноВМеханизмеПредставленийСКД - Булево - 
// * Подсказка - Строка
// * ИмяОбработчика - Строка
Функция НовыйОписаниеПредставления() Экспорт                                        
	ОписаниеПредставления = Новый Структура();	 
	ОписаниеПредставления.Вставить("Тип", "ОписаниеПредставления");  
	ОписаниеПредставления.Вставить("Имя", "");  
	ОписаниеПредставления.Вставить("ПолноеИмя", "");  
	ОписаниеПредставления.Вставить("Поля", Новый Массив); 
	ОписаниеПредставления.Вставить("ОписаниеВТФильтр");
	ОписаниеПредставления.Вставить("ОписаниеПараметров", Новый Массив);  
	ОписаниеПредставления.Вставить("ДоступныеОтборы", Новый Массив);
	ОписаниеПредставления.Вставить("ПоддерживаетсяПсевдонимыПолей", Ложь);
	ОписаниеПредставления.Вставить("ПоддерживаютсяИндексы", Ложь); 
	ОписаниеПредставления.Вставить("ПоддерживаетсяПолучениеРезультатаЗапроса", Ложь);
	ОписаниеПредставления.Вставить("ИмяФормируемойВТПоУмолчанию", ""); 
	ОписаниеПредставления.Вставить("ИмяВТДляСКД", ""); 
	ОписаниеПредставления.Вставить("ПоддерживаетсяУказаниеИмяВТРезультат", Ложь);  
	ОписаниеПредставления.Вставить("ПоляПоИменам", Новый Соответствие); 
	ОписаниеПредставления.Вставить("ПараметрыПоИменам", Новый Соответствие); 
	ОписаниеПредставления.Вставить("ДоступноВМеханизмеПредставленийСКД", Ложь);
	ОписаниеПредставления.Вставить("Подсказка", "");
	ОписаниеПредставления.Вставить("ИмяОбработчика", ""); 
	
	Возврат ОписаниеПредставления;
КонецФункции	                  

// Новый поле представления.
// 
// Возвращаемое значение:
//  Структура - Новый поле представления:
// * Тип - Строка - 
// * Имя - Строка - 
// * ТипЗначения - ОписаниеТипов, Неопределено - 
// * ДоступноПриНаличииПодсистемы - Строка, Неопределено - 
Функция НовыйПолеПредставления() Экспорт 
	Поле = Новый Структура; 
	Поле.Вставить("Тип", "ПолеПредставления");
	Поле.Вставить("Имя", "");
	Поле.Вставить("ТипЗначения", Неопределено);
	Поле.Вставить("ДоступноПриНаличииПодсистемы", Неопределено);  
	
	Возврат Поле;
КонецФункции

Функция НовыйПолеФильтра() Экспорт
	Поле = Новый Структура;  
	Поле.Вставить("Имя", "");
	Поле.Вставить("Обязательный", Ложь); 
	
	Возврат Поле;
КонецФункции

// Новый описание  ВТФильтр.
// 
// Возвращаемое значение:
//  Структура - Новый описание типа параметра ВТФильтр:
// * Тип - Строка - 
// * ПоддерживаютсяПсевдонимы - Булево - 
// * ПоддерживаетсяИмяВТФильтр - Булево - 
// * ИмяВТПоУмолчанию - Строка - 
// * ПоддерживаниетсяТЗФильтр - Булево - 
// * ПоляФильтра - Массив из см. НовыйПолеФильтра - 
// * Обязательный - Булево
// * _ПоляФильтраПоИменам - Соответствие из КлючИЗначение - 
Функция НовыйОписаниеВТФильтр() Экспорт
	ОписаниеТипаПараметра = Новый Структура("Тип", "ОписаниеВТФильтра");
	ОписаниеТипаПараметра.Вставить("ПоддерживаютсяПсевдонимы", Ложь);  
	ОписаниеТипаПараметра.Вставить("ПоддерживаетсяИмяВТФильтр", Ложь);
	ОписаниеТипаПараметра.Вставить("ИмяВТПоУмолчанию", ""); 
	ОписаниеТипаПараметра.Вставить("ПоддерживаниетсяТЗФильтр", Ложь);
	ОписаниеТипаПараметра.Вставить("ПоляФильтра", Новый Массив); 
	ОписаниеТипаПараметра.Вставить("Обязательный", Истина); 
	ОписаниеТипаПараметра.Вставить("_ПоляФильтраПоИменам", Новый Соответствие);
		
	Возврат ОписаниеТипаПараметра; 	
КонецФункции

// Новый описание параметра константа.
// 
// Возвращаемое значение:
//  Структура - Новый описание параметра константа:
// * Тип - Строка - 
// * Обязательный - Булево - 
// * Имя - Строка - 
// * ЗначениеПоУмолчанию - Произвольный - 
// * ДопустимПараметрЗапроса - Булево - 
// * ТипКонстанты - Неопределено - 
Функция НовыйОписаниеПараметраКонстанта() Экспорт
	ОписаниеПараметра = Новый Структура();   
	ОписаниеПараметра.Вставить("Тип", "ОписаниеПараметраКонстанта");
    ОписаниеПараметра.Вставить("Обязательный", Истина);	
	ОписаниеПараметра.Вставить("Имя", "");   
	ОписаниеПараметра.Вставить("ЗначениеПоУмолчанию", Неопределено); 
	ОписаниеПараметра.Вставить("ДопустимПараметрЗапроса", Ложь); 
	ОписаниеПараметра.Вставить("ТипКонстанты", Неопределено); 
	
	Возврат ОписаниеПараметра; 	
КонецФункции 

// Новый описание отбора.
// 
// Возвращаемое значение:
//  Структура - Новый описание отбора:
// * Тип - Строка - 
// * Поле - Строка - 
// * ДоступноРазыменование - Булево - 
// * ДоступенДляСКД - Булево - 
Функция НовыйОписаниеОтбора() Экспорт
	ОписаниеОтбора = Новый Структура("Тип", "ОписаниеОтбора");	
	ОписаниеОтбора.Вставить("Поле", "");
	ОписаниеОтбора.Вставить("ДоступноРазыменование", Истина);
	ОписаниеОтбора.Вставить("ДоступенДляСКД", Ложь);
	
	Возврат ОписаниеОтбора;
КонецФункции

#КонецОбласти