#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Создает реестр для обработки модели запроса.
//
// Параметры:
//  ОписанияВременныхТаблиц - Массив, Неопределено - доступные временные таблицы пакета.
//  ИндексЗапросаПакета - Число - индекс текущего запроса пакета.
//
// Возвращаемое значение:
//  ОбработкаОбъект.РеестрПоставщиковМетаданныхТаблиц - реестр поставщиков.
Функция СоздатьДляОбработкиЗапроса(ОписанияВременныхТаблиц = Неопределено, ИндексЗапросаПакета = -1) Экспорт
	Реестр = Обработки.РеестрПоставщиковМетаданныхТаблиц.Создать();
	Возврат Реестр.Инициализировать("ОбработкаЗапроса", ОписанияВременныхТаблиц, ИндексЗапросаПакета);
КонецФункции

// Создает реестр для серверного сценария формы конструктора запросов.
//
// Параметры:
//  ОписанияВременныхТаблиц - Массив, Неопределено - доступные временные таблицы формы.
//  ИндексЗапросаПакета - Число - индекс текущего запроса пакета.
//
// Возвращаемое значение:
//  ОбработкаОбъект.РеестрПоставщиковМетаданныхТаблиц - реестр поставщиков.
Функция СоздатьДляФормы(ОписанияВременныхТаблиц = Неопределено, ИндексЗапросаПакета = -1) Экспорт
	Реестр = Обработки.РеестрПоставщиковМетаданныхТаблиц.Создать();
	Возврат Реестр.Инициализировать("ФормаКонструктора", ОписанияВременныхТаблиц, ИндексЗапросаПакета);
КонецФункции

#КонецОбласти

#КонецЕсли
