
#Область СлужебныеПроцедурыИФункции

Функция ДоступенИнтервальныйРегистрСведений(ИмяРегистра) Экспорт
	Возврат Метаданные.РегистрыСведений.Найти(ИнтервальныеРегистрыБЗК.ИмяИнтервальногоРегистра(ИмяРегистра)) <> Неопределено;
КонецФункции

Функция ОписаниеОтбораИсполняемогоПредставления(МетаданныеРегистра) Экспорт
	ОписаниеОтбора = ОписаниеИсполняемыхПредставленийШаблоны.ОписаниеБазовогоОтбора();
	
	ОписаниеОтбора.ДоступенВПараметрах = Ложь;
	ОписаниеОтбора.ПробрасыватьОтборИзСекцииГДЕ = Истина;
	ОписаниеОтбора.ДополнительныеОперации.РазыменованиеПолей = Истина;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ОписаниеОтбора.ДоступныеПоля.Добавить(Ресурс.Имя);	
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		ОписаниеОтбора.ДоступныеПоля.Добавить(Реквизит.Имя);	
	КонецЦикла; 	
		
	Возврат ОписаниеОтбора;	
КонецФункции

#КонецОбласти
