
#Область СлужебныеПроцедурыИФункции

Функция ДоступенИнтервальныйРегистрСведений(ИмяРегистра) Экспорт
	Возврат Метаданные.РегистрыСведений.Найти(ИнтервальныеРегистрыБЗК.ИмяИнтервальногоРегистра(ИмяРегистра)) <> Неопределено;
КонецФункции

Функция ОписаниеОтбораИсполняемогоПредставления(МетаданныеРегистра) Экспорт
	ОписаниеОтбора = ЭлементыМоделиОписанияПредставлений.НовыйОписаниеОтбора();
	
	ОписаниеОтбора.ДоступенВПараметрах = Ложь;
	ОписаниеОтбора.ПробрасыватьОтборИзСекцииГДЕ = Истина;
	
	Для Каждого Ресурс Из МетаданныеРегистра.Ресурсы Цикл
		ОписаниеОтбора.ДоступныеПоля.Добавить(Ресурс.Имя);	
	КонецЦикла;
	
	Для Каждого Реквизит Из МетаданныеРегистра.Реквизиты Цикл
		ОписаниеОтбора.ДоступныеПоля.Добавить(Реквизит.Имя);	
	КонецЦикла; 	
	
	ОписаниеОтбора.ПоддерживаемыеОперации.ВИерархии = Истина;
	ОписаниеОтбора.ПоддерживаемыеОперации.ВложенныйЗапрос = Ложь;
	ОписаниеОтбора.ПоддерживаемыеОперации.ВСписок = Истина;
	ОписаниеОтбора.ПоддерживаемыеОперации.ИЛИ = Ложь;
	ОписаниеОтбора.ПоддерживаемыеОперации.МЕЖДУ = Ложь;
	ОписаниеОтбора.ПоддерживаемыеОперации.ПОДОБНО = Истина;
	ОписаниеОтбора.ПоддерживаемыеОперации.РазыменованиеПолей = Истина;
	ОписаниеОтбора.ПоддерживаемыеОперации.СписокВыражений = Ложь;
	ОписаниеОтбора.ПоддерживаемыеОперации.Сравнение = Истина;
	ОписаниеОтбора.ПоддерживаемыеОперации.ЯзыкВыражений = Ложь;
		
	Возврат ОписаниеОтбора;	
КонецФункции

#КонецОбласти
